#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Автомобили") Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Автомобиль",  ПараметрКоманды));
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ТипыЦен") Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ТипЦен", ПараметрКоманды));
	Иначе
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Регистратор", ПараметрКоманды));
	КонецЕсли;
	
	ОткрытьФорму(
		"РегистрСведений.ЦеныАвтомобилей.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно
	);
	
КонецПроцедуры

#КонецОбласти