
#Область ПрограммныйИнтерфейс

// Дает возможность переопределить состав складов доступных пользователю
// в АРМ Состояние обеспечения.
//
// Параметры:
//  СтандартнаяОбработка - Булево - Признак, что необходимо использовать значение из этой функции,
//                                  а не из СостояниеОбеспеченияСервер.ДоступныеСкладыПоУмолчанию().
// 
// Возвращаемое значение:
//  ФиксированныйМассив - Доступные склады.
//
Функция ДоступныеСкладыПоУмолчанию(СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Истина;
	
КонецФункции

#КонецОбласти