////////////////////////////////////////////////////////////////////////////////
// Автомобили (вызов сервера):
//  - Формирование данных, связанных с автомобилями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет размер пробега автомобиля на каждую из списка дат
//
// Параметры:
//  Автомобиль - СправочникСсылка.Автомобили - Автомобиль для которого необходимо получить пробеги;
//  КлючевыеДаты - Массив, Дата - Коллекция дат на которые необходимо получить пробеги.
//
// Возвращаемое значение:
//  Соответствие - Где ключ дата, а значение пробег.
//
Функция ПробегиАвтомобиляПоДатам(Автомобиль, КлючевыеДаты) Экспорт
	
	Возврат АвтомобилиСервер.ПробегиАвтомобиляПоДатам(Автомобиль, КлючевыеДаты);
	
КонецФункции

// Выполняет обновление свойства автомобиля
//
// Параметры:
//  Свойство - Строка - имя свойства автомобиля;
//  Значение - Произвольный - новое значение свойства;
//  Автомобиль - СправочникСсылка.Автомобили - обновляемый автомобиль.
//
Процедура ОбновитьСвойствоАвтомобиля(Свойство, Значение, Автомобиль) Экспорт
	
	АвтомобилиСервер.ОбновитьСвойствоАвтомобиля(Свойство, Значение, Автомобиль);
	
КонецПроцедуры

#КонецОбласти