#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ЗаказПокупателя",               ПараметрКоманды);
	Отбор.Вставить("СостояниеГотовКОтгрузке",       Истина);
	Отбор.Вставить("СостояниеОжидаетПоставки",      Истина);
	Отбор.Вставить("СостояниеТребуетсяОбеспечение", Истина);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	
	СостояниеОбеспеченияКлиент.ОткрытьСостояниеОбеспечения(ПараметрКоманды, ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти