
#Область СлужебныеПроцедурыИФункции

Функция ПечатьНеПроведенныхДокументов(ПечатаемыеОбъекты) Экспорт
	
	Возврат НЕ ПравоПользователя("ПечатьНепроведенных", ?(ПечатаемыеОбъекты.Количество() > 0, ПечатаемыеОбъекты[0], Неопределено));
	
КонецФункции

Функция ОписаниеКомандыОбработки(ИмяЭлемента, АдресТаблицыКомандВоВременномХранилище) Экспорт
	
	Возврат ДополнительныеОтчетыИОбработкиАльфаАвто.ОписаниеКомандыОбработки(ИмяЭлемента,
		АдресТаблицыКомандВоВременномХранилище);
	
КонецФункции

#КонецОбласти
