
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Количество = 1;
	Цена = 0;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьКоличество(Команда)
	
	ВведенныеДанные = Новый Структура;
    ВведенныеДанные.Вставить("Количество", Количество);
    ВведенныеДанные.Вставить("Цена", Цена);
	
	Закрыть(ВведенныеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

