#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		ТипПараметрКоманды = ТипЗнч(ПараметрКоманды);
		ПараметрыОткрытия = Новый Структура;
		Если ТипПараметрКоманды = Тип("ДокументСсылка.СводныйРемонтныйЗаказ") Тогда
			ПараметрыОткрытия.Вставить("СводныйРемонтныйЗаказ", ПараметрКоманды);
		ИначеЕсли ТипПараметрКоманды = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			ПараметрыОткрытия.Вставить("ЗаказНаряд", ПараметрКоманды);
		КонецЕсли;
		Если ТипПараметрКоманды = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
			ПараметрыОткрытия.Вставить("ЗаявкаНаРемонт", ПараметрКоманды);
		Иначе
			ПараметрыОткрытия.Вставить("ЗаявкаНаРемонт", Неопределено);
		КонецЕсли;
		
		ОткрытьФорму("Обработка.ОбменСAudaPadWeb.Форма",
			ПараметрыОткрытия,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Источник.КлючУникальности,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти