
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторУчастника = Параметры.ИдентификаторУчастника;
	ФизическоеЛицо = Параметры.ФизическоеЛицо;
	
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		
		ФизическоеЛицоПриИзмененииНаСервере();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Фамилия) Тогда
		
		Фамилия = Параметры.Фамилия;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Имя) Тогда
		
		Имя = Параметры.Имя;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Отчество) Тогда
		
		Отчество = Параметры.Отчество;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Почта) Тогда
		
		Почта = Параметры.Почта;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Телефон) Тогда
		
		Телефон = Параметры.Телефон;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	
	ФизическоеЛицоПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьФизическоеЛицо(Команда)
	
	Если ПоляЗаполненыВерно() Тогда
		
		Если Не ЗначениеЗаполнено(ИдентификаторУчастника) Тогда
			
			ИдентификаторУчастника = УчастникиПЭПВызовСервера.ИдентификаторУчастника(ФизическоеЛицо);
			
		КонецЕсли;
		
		Результат = Новый Структура();
		Результат.Вставить("Фамилия", Фамилия);
		Результат.Вставить("Имя", Имя);
		Результат.Вставить("Отчество", Отчество);
		Результат.Вставить("ИдентификаторУчастника", ИдентификаторУчастника);
		Результат.Вставить("Почта", Почта);
		Результат.Вставить("Телефон", Телефон);
		Результат.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		Закрыть(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ФизическоеЛицоПриИзмененииНаСервере()
	
	ДанныеФизическогоЛица = УчастникиПЭП.ДанныеФизическогоЛица(ФизическоеЛицо);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеФизическогоЛица);
	ИдентификаторУчастника = УчастникиПЭПВызовСервера.ИдентификаторУчастника(ФизическоеЛицо);
	
КонецПроцедуры

&НаКлиенте
Функция ПоляЗаполненыВерно()
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "ФизическоеЛицо";
		Сообщение.Текст = НСтр("ru = 'Не заполнено физическое лицо'");
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Фамилия) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "Фамилия";
		Сообщение.Текст = НСтр("ru = 'Не заполнена фамилия'");
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Имя) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "Имя";
		Сообщение.Текст = НСтр("ru = 'Не заполнено имя'");
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчество) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "Отчество";
		Сообщение.Текст = НСтр("ru = 'Не заполнено отчество'");
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Почта) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "Почта";
		Сообщение.Текст = НСтр("ru = 'Не заполнена почта'");
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Телефон) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "Телефон";
		Сообщение.Текст = НСтр("ru = 'Не заполнен телефон'");
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
