
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Событие = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Событие");
	
	Если Событие.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	Если ПричинаОтказа.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена причина отказа.'"));
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ОтменитьСобытие(Отказ);
	
	Если НЕ Отказ Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры // Применить()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтменитьСобытие(Отказ)
	
	ДокументСобытие = Событие.ПолучитьОбъект();
	
	ДокументСобытие.ПричинаОтказа         = ПричинаОтказа;
	ДокументСобытие.ОписаниеПричиныОтказа = ОписаниеПричиныОтказа;
	ДокументСобытие.Состояние             = Перечисления.СостоянияСобытий.Отменено;
	ДокументСобытие.ДатаОкончания         = ТекущаяДатаСеанса();
	
КонецПроцедуры // ОтменитьСобытие()

#КонецОбласти