
#Область ПрограммныйИнтерфейс

Функция МенеджерыУчастниковПоТипам() Экспорт
	
	Результат = Новый Структура("ЮрЛица,КонтактныеЛица,ФизЛица", Новый Массив, Новый Массив, Новый Массив);
	
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ЮридическиеЛицаПЭП.Тип.Типы() Цикл
		
		МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
		
		Если МетаданныеТипа = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если СтрНачинаетсяС(МетаданныеТипа.ПолноеИмя(), "Справочник") Тогда
			
			Результат.ЮрЛица.Добавить(Справочники[МетаданныеТипа.Имя]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.КонтактныеЛицаПЭП.Тип.Типы() Цикл
		
		МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
		
		Если МетаданныеТипа = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если СтрНачинаетсяС(МетаданныеТипа.ПолноеИмя(), "Справочник") Тогда
			
			Результат.КонтактныеЛица.Добавить(Справочники[МетаданныеТипа.Имя]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ФизическиеЛицаПЭП.Тип.Типы() Цикл
		
		МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
		
		Если МетаданныеТипа = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если СтрНачинаетсяС(МетаданныеТипа.ПолноеИмя(), "Справочник") Тогда
			
			Результат.ФизЛица.Добавить(Справочники[МетаданныеТипа.Имя]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
