
#Область ПрограммныйИнтерфейс

// Обработчик события возникающего при вызове команды формирования отчета "Печать реестра"
//
// Параметры:
//  МассивСсылок     	- Массив 			- Массив ссылок на объекты, для котороых выполняется обработка события.
//  ПараметрыДействия 	- Структура 		- Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПечатиРеестра(МассивСсылок, ПараметрыДействия = Неопределено) Экспорт
	
	Форма 			= ПараметрыДействия.Форма;
	ТекущиеДанные	= Форма.Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или ЕстьРеквизитНаКлиенте(ТекущиеДанные, "ГруппировкаСтроки") 
		И ЗначениеЗаполнено(ТекущиеДанные.ГруппировкаСтроки) Тогда 
		Возврат;
	КонецЕсли;
	
	Результат 			= Новый Структура;
		
	ОписаниеОповещения 	= Новый ОписаниеОповещения("Подключаемый_ОбработкаКомандыПечатиРеестра", Форма);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат);

	Результат.Вставить("ПечатьРеестра");
	Результат.Вставить("СформироватьПриОткрытии", Истина);

	ОткрытьФорму("Отчет.ПечатьРеестра.Форма", Результат);
	
КонецПроцедуры

#КонецОбласти