// Модуль менеджера регистра сведений "Доступность подсистем по ключу"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьДоступностьПодсистемКлюча(Ключ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоступностьПодсистемПоКлючу.МаскаКлюча
	|ИЗ
	|	РегистрСведений.ДоступностьПодсистемПоКлючу КАК ДоступностьПодсистемПоКлючу
	|ГДЕ
	|	ДоступностьПодсистемПоКлючу.МаскаКлюча = &МаскаКлюча";
	Запрос.УстановитьПараметр("МаскаКлюча", Ключ);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.ДоступностьПодсистемПоКлючу.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	Запись = Набор.Добавить();
	Запись.МаскаКлюча = Ключ;
	
	Для Индекс = 1 По 16 Цикл
		Запись["ЗначениеБитаНомер"+Индекс] = СтрНачинаетсяС(Сред(Запись.МаскаКлюча,Индекс), "1");
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли