// Модуль набора записей регистра "Упущенный спрос"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Запись = ?(ЭтотОбъект.Количество() > 0, ЭтотОбъект[0], Неопределено);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И Запись <> Неопределено Тогда
		Если ДанныеЗаполнения.Свойство("Номенклатура") Тогда
			Запись.Номенклатура = ДанныеЗаполнения.Номенклатура;
			
			РегистрыСведений.УпущенныйСпрос.НоменклатураПриИзменении(Запись);
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Количество") Тогда
			Запись.Количество = ДанныеЗаполнения.Количество;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Автор = Пользователи.ТекущийПользователь();
	КонецЦикла;
	
КонецПроцедуры 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли