#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получения состояний ввода в оборот кода маркировки
// 	Возвращаемое значение:
//   Массив - массив, состояний кодов маркировки.
//
Функция СостоянияВводаВОборотМаркировки() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.СостоянияКодовМаркировки.ВведенВОборот);
	Результат.Добавить(Перечисления.СостоянияКодовМаркировки.ВведенВОборотПриВозврате);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
