
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

Процедура ЗаполнитьКрастностьПоставок() Экспорт

	Запрос          = Новый Запрос;
	Запрос.Текст    = 
	    "ВЫБРАТЬ
	    |	ДополнительныеРеквизитыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ДополнительныеРеквизитыНоменклатуры.ЗначениеРеквизита КАК КратностьПоставок
	    |ИЗ
	    |	РегистрСведений.ДополнительныеРеквизитыНоменклатуры КАК ДополнительныеРеквизитыНоменклатуры
	    |ГДЕ
	    |	ДополнительныеРеквизитыНоменклатуры.ДополнительныйРеквизит = ЗНАЧЕНИЕ(Перечисление.ДополнительныеРеквизитыНоменклатуры.УдалитьКвантПоставки)
	    |	И ДополнительныеРеквизитыНоменклатуры.ЗначениеРеквизита <> 0
	    |	И ДополнительныеРеквизитыНоменклатуры.Номенклатура.КратностьПоставок = 0";
	
	Результат 	= Запрос.Выполнить();
	Выборка 	= Результат.Выбрать();
	           
	Пока Выборка.Следующий() Цикл
		Номенклатура 						= Выборка.Номенклатура.ПолучитьОбъект();
		Номенклатура.КратностьПоставок 		= Выборка.КратностьПоставок;
		Номенклатура.ОбменДанными.Загрузка 	= Истина;
		Номенклатура.Записать();
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти

#КонецЕсли