
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора         = Новый СписокЗначений();
	
	Для Каждого Значение Из Метаданные.Перечисления.ДокументыОбработкиСобытия.ЗначенияПеречисления Цикл
		
		Если Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(Метаданные.Документы[Значение.Имя]) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеВыбора.Добавить(Перечисления.ДокументыОбработкиСобытия[Значение.Имя], Значение.Синоним);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
