
#Область ПрограммныйИнтерфейс

// Открывает форму автоматического планирования в зависимости от режима планирования
//
// Параметры:
//  Данные  - Структура - Данные документа для автоматического планирования
//  Форма - Форма - Форма владелец
//  РежимОткрытияЭксперт  - Булево - режим формы для открытия
//
Процедура ОткрытьФормуАвтоматическогоПланирования(Данные, Форма, РежимОткрытияЭксперт=Истина) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("АвтоматическоеПланированиеЗавершение", Форма);
	
	Если РежимОткрытияЭксперт Тогда
		
		ОткрытьФорму(
			"Обработка.АвтоматическоеПланированиеРесурсов.Форма.ФормаЭкспертногоРежима",
			Новый Структура("Данные", Данные),
			Форма,
			Форма.УникальныйИдентификатор,
			,
			,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФорму(
		"Обработка.АвтоматическоеПланированиеРесурсов.Форма.ФормаУпрощенногоРежима",
		Новый Структура("Данные", Данные),
		Форма,
		Форма.УникальныйИдентификатор,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОткрытьФормуАвтоматическогоПланирования()

#КонецОбласти