
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	РежимыПоискаИдентификатораКлиента = МенеджерОборудованияАльфаАвтоКлиентСервер.РежимыПоискаИдентификатораКлиента();
	РежимыПоискаИдентификатораКлиентаПодробности = МенеджерОборудованияАльфаАвтоКлиентСервер.РежимыПоискаИдентификатораКлиентаПодробности();
	
	Для Каждого КлючЗначение Из РежимыПоискаИдентификатораКлиента Цикл
		
		Описание = РежимыПоискаИдентификатораКлиентаПодробности[КлючЗначение.Значение];
		Элементы.Режим.СписокВыбора.Добавить(КлючЗначение.Значение, Описание.Представление);
		
	КонецЦикла;
	
	ПараметрыУникальностиРабочихМест = МенеджерОборудованияАльфаАвтоВызовСервера.ПараметрыПолученияИдентификатораРабочегоМеста();
	Объект.Режим = ПараметрыУникальностиРабочихМест.РежимПоиска;
	Подсказка = РежимыПоискаИдентификатораКлиентаПодробности[Объект.Режим].Подсказка;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	СохраняемоеЗначение = Новый Структура("РежимПоиска", Объект.Режим);
	УстановитьПривилегированныйРежим(Истина);
	Константы.ПараметрыПолученияИдентификатораРабочегоМеста.Установить(Новый ХранилищеЗначения(СохраняемоеЗначение));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	
	Подсказка = МенеджерОборудованияАльфаАвтоКлиентСервер.РежимыПоискаИдентификатораКлиентаПодробности()[Объект.Режим].Подсказка;
	
КонецПроцедуры

#КонецОбласти