#Область ОбработчикиСобытий

// Обработчик события нажатия кнопки "Наличие на складах".
//
// Параметры:
//  ПараметрКоманды - Произвольный - В параметр передается значение от источника, в котором реализована команда
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды - В обработчике команды можно изменить
//  значение свойств параметра Окно и Уникальность. 
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено ИЛИ ПараметрКоманды.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	ОтчетОтбор.Вставить("Номенклатура", ?(ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.СводныйРемонтныйЗаказ"), ПолучитьСписокТоваровЗаказНарядов(ПараметрКоманды), ПолучитьСписокТоваров(ПараметрКоманды)));
	
	ОткрытьФорму("Отчет.ОстаткиИОборотыТоваров.Форма", Новый Структура("Отбор,КлючВарианта,СформироватьПриОткрытии", ОтчетОтбор, "Остатки", Истина), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность);
	
	//// заполним параметры отчета
	//Отчет=Отчеты.ОстаткиИОборотыТоваров.Создать();
	//Отчет.ВидОтчета=Перечисления.ВидыОтчетов.Остатки;
	//Отчет.ДатаНачала=НачалоДня(ТекущаяДата());
	//Отчет.ДатаКонца=КонецДня(ТекущаяДата());
	//Отчет.РежимВыводаОтчета=Перечисления.РежимыВыводаОтчета.ТабличныйДокумент;
	//Отчет.РежимНастройки=Перечисления.РежимыНастройкиОтчетов.Эксперт;
	//Отчет.ИмяФормыНастроек="НастройкиОстатки";
	//Отчет.ЗаполнитьНачальныеНастройки("ТекстЗапросаОстатки");
	//
	//Отчет.ИзмеренияСтроки.Очистить();

	////Измерение Номенклатура
	//НоваяСтрока=Отчет.ИзмеренияСтроки.Добавить();
	//НоваяСтрока.Использование=Истина;
	//НоваяСтрока.ПутьКДанным="Номенклатура";
	//НоваяСтрока.Представление="Номенклатура";
	//НоваяСтрока.ТипИзмерения="Элементы";
	//
	////Колонка Склад
	//НоваяСтрока=Отчет.ИзмеренияКолонки.Добавить();
	//НоваяСтрока.Использование=Истина;
	//НоваяСтрока.ПутьКДанным="СкладКомпании";
	//НоваяСтрока.Представление="СкладКомпании";
	//НоваяСтрока.ТипИзмерения="Элементы";

	//// Дополнительное поле артикула номенклатуры
	//ДопПоляНоменклатура=Неопределено;
	//Если Отчет.ПараметрыИзмеренийСтрок.Свойство("Номенклатура",ДопПоляНоменклатура) Тогда
	//	ДопПоляНоменклатура.Вставить("ПоляПредставление","№ по каталогу");
	//	тзПоля=Новый ТаблицаЗначений;
	//	тзПоля.Колонки.Добавить("Имя");
	//	тзПоля.Колонки.Добавить("Представление");
	//	тзПоля.Колонки.Добавить("ПутьКДанным");
	//	НоваяСтрока=тзПоля.Добавить();
	//	НоваяСтрока.Имя="";
	//	НоваяСтрока.Представление="№ по каталогу";
	//	НоваяСтрока.ПутьКДанным="Номенклатура.Артикул";
	//	ДопПоляНоменклатура.Вставить("Поля",тзПоля);
	//КонецЕсли; 
	//
	//// Расставим показатели
	//Для каждого ОтчетПоказатель Из Отчет.Показатели Цикл
	//	ОтчетПоказатель.Использование=(ОтчетПоказатель.Имя="СвободныйОстаток");
	//КонецЦикла; 

	//	//Расставим функции
	//Для каждого ОтчетФункция Из Отчет.Функции Цикл
	//	ОтчетФункция.Использование=(ОтчетФункция.Имя="КонечныйОстаток");
	//КонецЦикла;

	//// Уберем лишние отборы
	//Для каждого ОтчетОтбор Из Отчет.ПостроительОтчета.Отбор Цикл
	//	ОтчетОтбор.Использование=Ложь;
	//КонецЦикла;
	//
	//СписокТоваров=Новый СписокЗначений();
	//СписокТоваров.ЗагрузитьЗначения(ТекущийДокумент.Товары.ВыгрузитьКолонку("Номенклатура"));
	//// Установим фильтр по заказ-наряду
	//ОтборНоменклатура=Отчет.ПостроительОтчета.Отбор.Найти("Номенклатура");
	//Если ОтборНоменклатура=Неопределено Тогда
	//	ОтборНоменклатура=Отчет.ПостроительОтчета.Отбор.Добавить("Номенклатура","Номенклатура","Номенклатура");
	//КонецЕсли; 
	//ОтборНоменклатура.ВидСравнения=ВидСравнения.ВСписке;
	//ОтборНоменклатура.Значение=СписокТоваров;
	//ОтборНоменклатура.Использование=Истина;
	//
	//// ДопПоля в отдельную колонку
	//Отчет.ВыводитьДополнительныеПоляВОтдельнойКолонке=Истина;
	//
	//ФормаОтчета=ПолучитьОбщуюФорму("Отчет");
	//ФормаОтчета.ОтчетОбъект=Отчет;
	//ФормаОтчета.Заголовок="Наличие на складах";
	//ФормаОтчета.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает список номенклатуры табличной части "Товары"
//
&НаСервере
Функция ПолучитьСписокТоваров(Документ)
	
	СписокТоваров = Новый СписокЗначений;
	Если Документ.Товары.Количество() <> 0 Тогда
		Для Каждого Товар Из Документ.Товары Цикл
			СписокТоваров.Добавить(Товар.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	Возврат СписокТоваров;
	
КонецФункции

// Функция возвращает список заказ-нарядов выбранного сводного ремонтного заказа
//
&НаСервере
Функция ПолучитьСписокТоваровЗаказНарядов(Документ)
	
	СписокТоваровЗаказНарядов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка.СводныйРемонтныйЗаказ = &Документ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		СписокТоваровЗаказНарядов.Добавить(РезультатЗапроса.Номенклатура);
	КонецЦикла;
	
	Возврат СписокТоваровЗаказНарядов;
	
КонецФункции

#КонецОбласти