///////////////////////////////////////////////////////////////////////////////
// Модуль формы списка регистра "Дополнительные реквизиты номенклатуры"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Номенклатура") И ОбщегоНазначения.ОбъектЯвляетсяГруппой(Параметры.Отбор.Номенклатура) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Использование для групп запрещено.'"),,,, Отказ);
	КонецЕсли;
	
	РаботаСФормой.НастроитьОсновнойДинамическийСписокФормы(ЭтотОбъект);
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// ОценкаПроизводительности
	Если Копирование Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("КопированиеРегистраСведенийДополнительныеРеквизитыНоменклатуры");
	Иначе
		ОценкаПроизводительностиКлиент.ЗамерВремени("СозданиеРегистраСведенийДополнительныеРеквизитыНоменклатуры");
	КонецЕсли;
	// Конец ОценкаПроизводительности
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеЗаписиРегистраСведенийДополнительныеРеквизитыНоменклатуры");
	
КонецПроцедуры

#КонецОбласти
