#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Клиент",                        ПолучитьЗначениеКонтрагента(ПараметрКоманды));
	Отбор.Вставить("СостояниеГотовКОтгрузке",       Истина);
	Отбор.Вставить("СостояниеОжидаетПоставки",      Истина);
	Отбор.Вставить("СостояниеТребуетсяОбеспечение", Истина);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	
	СостояниеОбеспеченияКлиент.ОткрытьСостояниеОбеспечения(ПараметрКоманды, ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьЗначениеКонтрагента(Ссылка)
	
	Возврат Ссылка.Контрагент;
	
КонецФункции

#КонецОбласти