
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаВыполнитьСинхронизациюПЭП.Видимость = ПравоДоступа("Изменение",
		Метаданные.РегистрыСведений.ЖурналЗапросовПЭП);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьСинхронизациюПЭП(Команда)
	
	Попытка
		
		ВыполнитьСинхронизациюНаСервере();
		ПоказатьПредупреждение(, НСтр("ru = 'Обновлены статусы заявок на подписание'"));
		Элементы.Список.Обновить();
		
	Исключение
		
		ВызватьИсключение НСтр("ru = 'Не удалось обновить статус заявок на подписание.
									 |Подробнее в журнале регистрации'");
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ВыполнитьСинхронизациюНаСервере()
	
	ЗаявкиНаПодписаниеПЭП.ОбновитьСтатусЗаявокНаПодпись();
	
КонецПроцедуры

#КонецОбласти