
#Область ПрограммныйИнтерфейс

// см. Участники.ИдентификаторУчастника
Функция ИдентификаторУчастника(Участник) Экспорт
	
	Возврат УчастникиПЭП.ИдентификаторУчастника(Участник);
	
КонецФункции

// См. Участники.ЗафиксироватьРегистрациюУчастникаВПЭП
Процедура ЗафиксироватьРегистрациюУчастникаВПЭП(Участник) Экспорт
	
	УчастникиПЭП.ЗафиксироватьРегистрациюУчастникаВПЭП(Участник);
	
КонецПроцедуры

// Определить тип участника.
// 
// Параметры:
//  Участник - Произвольный - 
// 
// Возвращаемое значение:
//  Структура -  Определить тип участника:
// * ЭтоЮридическоеЛицо - Булево - 
// * ЭтоКонтактноеЛицо - Булево - 
// * ЭтоФизическоеЛицо - Булево - 
Функция ОпределитьТипУчастника(Участник) Экспорт
	
	Возврат Новый Структура(
		"ЭтоЮридическоеЛицо,ЭтоКонтактноеЛицо,ЭтоФизическоеЛицо",
		УчастникиПЭП.ЭтоЮридическоеЛицо(Участник),
		УчастникиПЭП.ЭтоКонтактноеЛицо(Участник),
		УчастникиПЭП.ЭтоФизическоеЛицо(Участник)
	);
	
КонецФункции

// см. Участники.ОтправитьИлиОбновитьУчастника
Функция ОтправитьИлиОбновитьУчастника(ДанныеУчастника, ТипУчастника) Экспорт
	
	Возврат УчастникиПЭП.ОтправитьИлиОбновитьУчастника(ДанныеУчастника, ТипУчастника);
	
КонецФункции

#КонецОбласти
