// Модуль набора записей регистра "Прайс-листы контрагентов журнал загрузки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПриЗаписи(Отказ, Замещение)
	
	// Проверим, что сюда не попали Веб прайс-листы
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.ПрайсЛист.ВидПрайсЛиста = Перечисления.ВидыПрайсЛистов.ВебПрайсЛист Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'В журнал загрузки нельзя записывать веб-прайс-листы поставщиков.'")
			);
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
