#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыПечати = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПараметрыПечати");
	
	ПечататьНомераУПД = Истина;
	РазбиватьПоСделкам = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область ОбработчикиПечать
&НаКлиенте
Процедура Печать(Команда)
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ПечататьНомераУПД", ЭтотОбъект.ПечататьНомераУПД);
	СтруктураВозврата.Вставить("РазбиватьПоСделкам", ЭтотОбъект.РазбиватьПоСделкам);
	СтруктураВозврата.Вставить("ВладелецФормы", ЭтотОбъект.ВладелецФормы);
	СтруктураВозврата.Вставить("ПараметрыПечати", ПараметрыПечати);
	
	ЭтотОбъект.Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти
