
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСостояние" И Источник = ВладелецФормы.УникальныйИдентификатор И Параметр <> Неопределено Тогда
		Если Параметр.Свойство("Текст") Тогда
			Элементы.ДекорацияПоясняющийТекстДлительнойОперации.Заголовок = Параметр.Текст;
		КонецЕсли;
		Если Параметр.Свойство("Процент") Тогда
			Процент = Параметр.Процент;
			Элементы.Процент.Видимость = Истина;
		Иначе
			Элементы.Процент.Видимость = Ложь;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ЗаданиеВыполнено" И Источник = ВладелецФормы.УникальныйИдентификатор Тогда
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти