
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеВДанныеФормы(ПолучитьИзВременногоХранилища(Параметры.ДеревоСсылок), Объект.ДеревоСсылок);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиСсылку(Команда)
    ЭлДер = НайтиЭлементДерева(СсылкаПоиска, Объект.ДеревоСсылок);
    Если ЭлДер <> Неопределено Тогда
    	Элементы.ДеревоСсылок.ТекущаяСтрока = ЭлДер;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не найдено.'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НайтиЭлементДерева(СсылкаДляПоиска,ЗНАЧ Дер)
    ЭлементыДерева = Дер.ПолучитьЭлементы();
    Для Каждого ТекЭл Из ЭлементыДерева Цикл
        Если ТекЭл.Ссылка = СсылкаПоиска Тогда
            Возврат ТекЭл.ПолучитьИдентификатор();
        КонецЕсли;
        НайдЭл = НайтиЭлементДерева(СсылкаДляПоиска,ТекЭл);
        Если НайдЭл <> Неопределено Тогда
            Возврат НайдЭл;
        КонецЕсли;
    КонецЦикла;
КонецФункции

#КонецОбласти