
#Область ОбработчикиСобытийФормы

// ПриСозданииНаСервере
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаКомпановкиДанных = Обработки.МониторАвтосервиса.ПолучитьМакет("Макет");
	АдресСхемыКомпановкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпановкиДанных, УникальныйИдентификатор);
	Объект.ФильтрыОтчета.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпановкиДанных));
	Объект.ФильтрыОтчета.ЗагрузитьНастройки(СхемаКомпановкиДанных.НастройкиПоУмолчанию);
	
	Если НЕ ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПараметрыМонитора", Неопределено) = Неопределено Тогда
		Объект.ПоказыватьВРаботе    = Параметры.ПараметрыМонитора.ПоказыватьВРаботе;
		Объект.ПоказыватьВыдачу     = Параметры.ПараметрыМонитора.ПоказыватьВыдачу;
		Объект.ПоказыватьНевыданные = Параметры.ПараметрыМонитора.ПоказыватьНевыданные;
		Объект.ПоказыватьПриемку    = Параметры.ПараметрыМонитора.ПоказыватьПриемку;
		Объект.ПериодСменыСтраниц   = Параметры.ПараметрыМонитора.ПериодСменыСтраниц;
		Объект.СтрокНаСтраницу      = Параметры.ПараметрыМонитора.СтрокНаСтраницу;
		Объект.ЦветоваяСхема        = Параметры.ПараметрыМонитора.ЦветоваяСхема;
		Объект.РазмерШрифта         = Параметры.ПараметрыМонитора.РазмерШрифта;
		Объект.ШиринаЛоготипа       = Параметры.ПараметрыМонитора.ШиринаЛоготипа;
		Объект.ВысотаЛоготипа       = Параметры.ПараметрыМонитора.ВысотаЛоготипа;
		Объект.ШиринаФото           = Параметры.ПараметрыМонитора.ШиринаФото;
		Объект.ВысотаФото           = Параметры.ПараметрыМонитора.ВысотаФото;
		Объект.Организация          = Параметры.ПараметрыМонитора.Организация;
		Объект.Идентификатор        = Параметры.ПараметрыМонитора.Идентификатор;
		Объект.ФотоНаЭкран          = Параметры.ПараметрыМонитора.ФотоНаЭкран;
		Объект.ОтображатьСотрудника = Параметры.ПараметрыМонитора.ОтображатьСотрудника;
		Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[0].Использование  = Параметры.ПараметрыМонитора.ФильтрыОтчета.Настройки.Отбор.Элементы[0].Использование;
		Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[0].ВидСравнения   = Параметры.ПараметрыМонитора.ФильтрыОтчета.Настройки.Отбор.Элементы[0].ВидСравнения;
		Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[0].ПравоеЗначение = Параметры.ПараметрыМонитора.ФильтрыОтчета.Настройки.Отбор.Элементы[0].ПравоеЗначение;
		Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[1].Использование  = Параметры.ПараметрыМонитора.ФильтрыОтчета.Настройки.Отбор.Элементы[1].Использование;
		Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[1].ВидСравнения   = Параметры.ПараметрыМонитора.ФильтрыОтчета.Настройки.Отбор.Элементы[1].ВидСравнения;
		Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[1].ПравоеЗначение = Параметры.ПараметрыМонитора.ФильтрыОтчета.Настройки.Отбор.Элементы[1].ПравоеЗначение;
		Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[2].Использование  = Параметры.ПараметрыМонитора.ФильтрыОтчета.Настройки.Отбор.Элементы[2].Использование;
		Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[2].ВидСравнения   = Параметры.ПараметрыМонитора.ФильтрыОтчета.Настройки.Отбор.Элементы[2].ВидСравнения;
		Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[2].ПравоеЗначение = Параметры.ПараметрыМонитора.ФильтрыОтчета.Настройки.Отбор.Элементы[2].ПравоеЗначение;
		
	КонецЕсли;
	
	Если НЕ Объект.ПоказыватьПриемку И НЕ Объект.ПоказыватьВыдачу И НЕ Объект.ПоказыватьНевыданные И НЕ Объект.ПоказыватьВРаботе Тогда
		Объект.ПоказыватьПриемку    = Истина;
		Объект.ПоказыватьВыдачу     = Истина;
		Объект.ПоказыватьНевыданные = Истина;
		Объект.ПоказыватьВРаботе    = Истина;
	КонецЕсли;
	
	Если Объект.АвтоВНевыданные = Перечисления.РежимыПопаданияВТаблицуНевыданные.ПустаяССылка() Тогда 
		Объект.АвтоВНевыданные = Перечисления.РежимыПопаданияВТаблицуНевыданные.НаСледующийДень;
	КонецЕсли;

	Если Объект.ПериодСменыСтраниц = 0 Тогда
		Объект.ПериодСменыСтраниц = 7;
	КонецЕсли;
	Если Объект.СтрокНаСтраницу = 0 Тогда
		Объект.СтрокНаСтраницу = 10;
	КонецЕсли;
	Если Объект.РазмерШрифта = 0 Тогда
		Объект.РазмерШрифта = 20;
	КонецЕсли;
	Если Объект.ЦветоваяСхема = "" Тогда
		Объект.ЦветоваяСхема = "CSSBlue";
	КонецЕсли;
	Если Объект.ШиринаЛоготипа = 0 Тогда
		Объект.ШиринаЛоготипа = 320;
	КонецЕсли;
	Если Объект.ВысотаЛоготипа = 0 Тогда
		Объект.ВысотаЛоготипа = 240;
	КонецЕсли;Если Объект.ШиринаЛоготипа = 0 Тогда
		Объект.ШиринаЛоготипа = 150;
	КонецЕсли;
	Если Объект.ВысотаЛоготипа = 0 Тогда
		Объект.ВысотаЛоготипа = 100;
	КонецЕсли;
	
	ОтображатьСотрудниковПриИзмененииНаСервере();
	ИдентификаторПриИзмененииНаСервере();
	
КонецПроцедуры // ПриОткрытии

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.АвтоВНевыданные = ПредопределенноеЗначение("Перечисление.РежимыПопаданияВТаблицуНевыданные.ПослеУказанногоВремени") Тогда 
		
		Элементы.ВремяКонтроляНевыданных.Доступность= Истина;
		
	Иначе
		
		Элементы.ВремяКонтроляНевыданных.Доступность = Ложь;
		
	КонецЕсли;
	
	ОбновитьВариантОтображенияСотрудников();
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	СохранитьНастройкиНаСервере()
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - Фильтры отчета настройки отбор перед началом добавления
//
&НаКлиенте
Процедура ФильтрыОтчетаНастройкиОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

// Процедура - Фильтры отчета настройки отбор перед удалением
//
&НаКлиенте
Процедура ФильтрыОтчетаНастройкиОтборПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент=Неопределено)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Организация" в контексте сервера.
//
&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если Объект.Организация.Пустая() Тогда
		Объект.Идентификатор = Справочники.ОрганизацииПрисоединенныеФайлы.ПустаяСсылка();
	Иначе //заполним первым идентификатором (если он есть)
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|Организации.ФайлКартинки
		|ИЗ
		|Справочник.Организации КАК Организации
		|ГДЕ
		|Организации.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Организация);
		
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Если Результат.ФайлКартинки = Справочники.ОрганизацииПрисоединенныеФайлы.ПустаяСсылка() Тогда
				Объект.Идентификатор = "";
			Иначе
				Объект.Идентификатор = Результат.ФайлКартинки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ИдентификаторПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Идентификатор" в контексте сервера.
//
&НаСервере
Процедура ИдентификаторПриИзмененииНаСервере()
	Если Объект.Идентификатор = Справочники.ОрганизацииПрисоединенныеФайлы.ПустаяСсылка() Тогда
		Элементы.Идентификатор.Доступность = Ложь;
	Иначе
		Элементы.Идентификатор.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Отображать сотрудников".
//
&НаКлиенте
Процедура ОтображатьСотрудниковПриИзменении(Элемент)
	
	ОтображатьСотрудниковПриИзмененииНаСервере();
	ОбновитьВариантОтображенияСотрудников();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Отображать сотрудников" в контексте сервера.
//
&НаСервере
Процедура ОтображатьСотрудниковПриИзмененииНаСервере()
	
	Если Объект.ОтображатьСотрудника Тогда
		Элементы.ГруппаЗаголовкиФотографий.Доступность = Истина;
		Элементы.ГруппаРазмерыФотоСотрудников.Доступность = Истина;
	Иначе
		Элементы.ГруппаЗаголовкиФотографий.Доступность = Ложь;
		Элементы.ГруппаРазмерыФотоСотрудников.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Нажатие на кнопку открытия файла идентификатора
//
&НаКлиенте
Процедура ИдентификаторНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ Объект.Идентификатор.Пустая() Тогда 
		РаботаСФайламиКлиент.ОткрытьФайл(
				РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(
					Объект.Идентификатор,
					УникальныйИдентификатор));
	КонецЕсли;				
КонецПроцедуры

&НаКлиенте
Процедура ВыводДиспетчераПриИзменении(Элемент)
	
	ОбновитьВариантОтображенияСотрудников();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Нажатие на кнопку формирования отчета
//
&НаКлиенте
Процедура КнопкаСформироватьНажатие(Кнопка)
	
	Если НЕ (Объект.ПоказыватьПриемку ИЛИ Объект.ПоказыватьВыдачу ИЛИ Объект.ПоказыватьНевыданные ИЛИ Объект.ПоказыватьВРаботе) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана ни одна таблица для отображения.'"));
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиНаСервере();
	
	ЭтаФорма.Закрыть(Новый Структура("ФильтрыОтчета", Объект.ФильтрыОтчета));	
	
КонецПроцедуры

// Нажатие на кнопку сброса настроек отчета
//
&НаКлиенте
Процедура ВосстановитьСтандартныеНастройки(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Данное действие установит все настройки по умолчанию. Хотите продолжить сброс настроек?';"), Режим, 0, КодВозвратаДиалога.Нет, "Предупреждение");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сохраняет настройки монитора при закрытии на сервере
//
&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ПоказыватьВРаботе",          Объект.ПоказыватьВРаботе);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ПоказыватьВыдачу",           Объект.ПоказыватьВыдачу);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ПоказыватьНевыданные",       Объект.ПоказыватьНевыданные);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ПоказыватьПриемку",          Объект.ПоказыватьПриемку);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ПериодСменыСтраниц",         Объект.ПериодСменыСтраниц);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "СтрокНаСтраницу",            Объект.СтрокНаСтраницу);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ЦветоваяСхема",              Объект.ЦветоваяСхема);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "РазмерШрифта",               Объект.РазмерШрифта);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ШиринаЛоготипа",             Объект.ШиринаЛоготипа);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ВысотаЛоготипа",             Объект.ВысотаЛоготипа);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ШиринаФото",                 Объект.ШиринаФото);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ВысотаФото",                 Объект.ВысотаФото);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "Организация",                Объект.Организация);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "Идентификатор",              Объект.Идентификатор);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ПутьКартинки",               Объект.ПутьКартинки);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ФотоНаЭкран",                Объект.ФотоНаЭкран);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ОтображатьСотрудника",       Объект.ОтображатьСотрудника);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ВыводДиспетчера",            Объект.ВыводДиспетчера);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ВариантОтображения",         Объект.ВариантОтображения);

	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "АвтоВНевыданные",            Объект.АвтоВНевыданные);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ВремяКонтроляНевыданных",    Объект.ВремяКонтроляНевыданных);
	
	СохранитьОтборыМонитора();
	
КонецПроцедуры

// Сохраняет настройки отборов монитора при закрытии на сервере
//
&НаСервере
Процедура СохранитьОтборыМонитора()
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ВидРемонтаИспользование",    Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[0].Использование);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ВидРемонтаВидСравнения",     Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[0].ВидСравнения);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ВидРемонтаЗначение",         Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[0].ПравоеЗначение);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ОрганизацияИспользование",   Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[1].Использование);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ОрганизацияВидСравнения",    Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[1].ВидСравнения);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ОрганизацияЗначение",        Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[1].ПравоеЗначение);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ПодразделениеИспользование", Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[2].Использование);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ПодразделениеВидСравнения",  Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[2].ВидСравнения);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ФормаНастроекОбработкиМониторАвтосервиса", "ПодразделениеЗначение",      Объект.ФильтрыОтчета.Настройки.Отбор.Элементы[2].ПравоеЗначение);
	
КонецПроцедуры

// Обработчик события возникающего после закрытия вопроса.
//
// Параметры:
//  Результат - КодВозвратаДиалога - Результат выполнения операции в подчиненной форме.
//  Параметры - Произвольный       - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ИнициализироватьНастройкиПоУмолчанию();
		ОбновитьВариантОтображенияСотрудников();
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет сброс настроек
//
&НаСервере
Процедура ИнициализироватьНастройкиПоУмолчанию()
	
	СхемаКомпановкиДанных = Обработки.МониторАвтосервиса.ПолучитьМакет("Макет");
	АдресСхемыКомпановкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпановкиДанных, УникальныйИдентификатор);
	Объект.ФильтрыОтчета.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпановкиДанных));
	Объект.ФильтрыОтчета.ЗагрузитьНастройки(СхемаКомпановкиДанных.НастройкиПоУмолчанию);
	
	Объект.ПоказыватьВРаботе    = Истина;
	Объект.ПоказыватьВыдачу     = Истина;
	Объект.ПоказыватьНевыданные = Истина;
	Объект.ПоказыватьПриемку    = Истина;
	Объект.АвтоВНевыданные      = Перечисления.РежимыПопаданияВТаблицуНевыданные.НаСледующийДень;
	Объект.ПериодСменыСтраниц   = 7;
	Объект.СтрокНаСтраницу      = 10;
	Объект.ЦветоваяСхема        = "CSSBlue";
	Объект.РазмерШрифта         = 20;
	Объект.ШиринаЛоготипа       = 320;
	Объект.ВысотаЛоготипа       = 240;
	Объект.ШиринаФото           = 150;
	Объект.ВысотаФото           = 100;
	Объект.ПутьКартинки         = "";
	Объект.ФотоНаЭкран          = 99;
	Объект.ОтображатьСотрудника = Ложь;
	Объект.Организация          = Справочники.Организации.ПустаяСсылка();
	Объект.Идентификатор        = Справочники.ОрганизацииПрисоединенныеФайлы.ПустаяСсылка();
	Объект.Сотрудники.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоВНевыданныеПриИзменении(Элемент)
	
	Если Объект.АвтоВНевыданные = ПредопределенноеЗначение("Перечисление.РежимыПопаданияВТаблицуНевыданные.ПослеУказанногоВремени") Тогда 
		
		Элементы.ВремяКонтроляНевыданных.Доступность = Истина;
		
	Иначе 
	  Элементы.ВремяКонтроляНевыданных.Доступность = Ложь;
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВариантОтображенияСотрудников()
	
	Элементы.ОформлениеОтображенияСотрудников.Видимость = Объект.ВыводДиспетчера И Объект.ОтображатьСотрудника;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВариантОтображения) Тогда
		Объект.ВариантОтображения = "ДиспетчерВТаблицеДиспетчерФото";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
