
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбщегоНазначенияБЭДКлиент.НовыеПараметрыОткрытияФормы();
	ПараметрыОткрытия.Владелец = ПараметрыВыполненияКоманды.Источник;
	ПараметрыОткрытия.Уникальность = ПараметрыВыполненияКоманды.Уникальность;
	ПараметрыОткрытия.Окно = ПараметрыВыполненияКоманды.Окно;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Источник", ПараметрКоманды);
	
	НастройкиЭДОКлиент.ОткрытьФормуНастроекЭДО(ПараметрыФормы, ПараметрыОткрытия);
	
КонецПроцедуры
