
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Пытается получить данные пустого пакета из регистра информации.
// Если не удасться найти информацию в регистре создает запись со значениями по умолчанию
//
Функция ИнформацияПоПустомуПакету() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИнформацияОПакете = РегистрыСведений.ИнформацияОПакетахАвторабот.СоздатьМенеджерЗаписи();
	ИнформацияОПакете.ПакетРабот = "00000000-0000-0000-0000-000000000000";
	ИнформацияОПакете.Прочитать();
	
	Если ИнформацияОПакете.Выбран() Тогда
		ПустойПакетИнфо = Новый Структура("ПакетРабот,Представление,НомерПакета,ТекущиеИсполнители,НомерКартинкиСостоянияПакетаРабот,СтатусПакета");
		ЗаполнитьЗначенияСвойств(ПустойПакетИнфо, ИнформацияОПакете);
		ПустойПакетИнфо.НомерКартинкиСостоянияПакетаРабот = 3;
		ПустойПакетИнфо.СтатусПакета                      = Справочники.ВидыСостоянийПакетовРабот.НеСтартовал;
	Иначе
		ИнформацияОПакете.ПакетРабот         = "00000000-0000-0000-0000-000000000000";
		ИнформацияОПакете.Представление      = "Вне пакетов";
		ИнформацияОПакете.НомерПакета        = 0;
		ИнформацияОПакете.ТекущиеИсполнители = "";
		ИнформацияОПакете.Записать(Истина);
		
		ПустойПакетИнфо = Новый Структура("ПакетРабот,Представление,НомерПакета,ТекущиеИсполнители,НомерКартинкиСостоянияПакетаРабот,СтатусПакета");
		ЗаполнитьЗначенияСвойств(ПустойПакетИнфо, ИнформацияОПакете);
		ПустойПакетИнфо.НомерКартинкиСостоянияПакетаРабот = 3;
		ПустойПакетИнфо.СтатусПакета                      = Справочники.ВидыСостоянийПакетовРабот.НеСтартовал;
	КонецЕсли;
	
	Возврат ПустойПакетИнфо;
	
КонецФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли