
#Область ПрограммныйИнтерфейс

#Область ФормаОтображенияQRКода

// Определяет алгоритм, выполняющийся при отображении QR кода на форме подготовки платежной ссылки СБП.
//
// Параметры:
//   ДанныеПлатежнойСсылки - Структура - содержит в себе описание платежной ссылки:
//    * ПлатежнаяСсылка - Строка - ссылка сформированная по данным документа операции.
//    * QRКод - ДвоичныеДанные - данные изображения QR-кода.
//  Параметры - Структура - описание параметров переданных из метода
//   ИнтеграцияСПлатежнымиСистемамиКлиентПереопределяемый.ПриОткрытииФормыQRКода.
//
// Пример:
//  Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПоддержкаОборудования.ПодключаемоеОборудование.ДисплеиПокупателя") Тогда
//
//     МодульОборудованиеДисплеиПокупателяКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеДисплеиПокупателяКлиент");
//
//       Если МодульОборудованиеДисплеиПокупателяКлиент.ПодключенныеДисплеиПокупателяВыводятQRКод() Тогда
//
//         ПараметрыОперации = МодульОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя();
//         ПараметрыОперации.ЗначениеQRКода = ДанныеПлатежнойСсылки.ПлатежнаяСсылка;
//         ПараметрыОперации.КартинкаQRКода = Base64Строка(ДанныеПлатежнойСсылки.QRКод);
//
//         МодульОборудованиеДисплеиПокупателяКлиент.НачатьВыводQRКодаНаДисплейПокупателя(
//           Неопределено,
//           Новый УникальныйИдентификатор,
//           Неопределено,
//           ПараметрыОперации);
//
//         КонецЕсли;
//  КонецЕсли;
//
Процедура ПриОтображенииQRКода(ДанныеПлатежнойСсылки, Параметры) Экспорт
	
	  Если ОборудованиеДисплеиПокупателяКлиент.ПодключенныеДисплеиПокупателяВыводятQRКод() Тогда 
		
		ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя();
		ПараметрыОперации.СтрокиТекста   = ДанныеПлатежнойСсылки.СтрокиТекста;
		ПараметрыОперации.ЗначениеQRКода = ДанныеПлатежнойСсылки.ЗначениеQRКода;
		
		ОборудованиеДисплеиПокупателяКлиент.НачатьВыводQRКодаНаДисплейПокупателя(
		Неопределено,
		Параметры.Форма, 
		Неопределено, 
		ПараметрыОперации);
		
	КонецЕсли;

КонецПроцедуры

// Определяет алгоритм, выполняющийся при закрытии формы отображения QR-кода.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма отображения QR-кода.
//
Процедура ПриЗакрытииФормыQRКода(Форма) Экспорт

	ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя();
	ОборудованиеДисплеиПокупателяКлиент.НачатьОчисткуДисплеяПокупателя(
		Неопределено,
		Форма, 
		Неопределено, 
		ПараметрыОперации);
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, Форма); 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
