
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписьЗначенияРегистраСведения(
	Автор,
	ЗаказНаряд,
	ИдентификаторДела,
	ИдентификаторЗадания,
	Период=Неопределено,
	Калькуляция=Неопределено,
	ПолучательАХ=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = РегистрыСведений.ОбменСAudaPadWeb.СоздатьМенеджерЗаписи();
	Менеджер.Период               = ?(Период = Неопределено, ТекущаяДатаСеанса(), Период);
	Менеджер.Автор                = Автор;
	Менеджер.ЗаказНаряд           = ЗаказНаряд;
	Менеджер.ИдентификаторДела    = ИдентификаторДела;
	Менеджер.ИдентификаторЗадания = ИдентификаторЗадания;
	
	Если НЕ Калькуляция = Неопределено Тогда
		Менеджер.Калькуляция = Калькуляция;
	КонецЕсли;
	
	Если НЕ ПолучательАХ = Неопределено Тогда
		Менеджер.ПолучательАХ = ПолучательАХ;
	КонецЕсли;
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры // ЗаписьЗначенияРегистраСведения()

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли