// Модуль набора записей регистра "Границы заказы"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Заказ Экспорт;   // Документ.ЗаказПокупателя ИЛИ Документ.ЗаказВнутренний ИЛИ Документ.ЗаказПоставщику ИЛИ Массив. Содержит заказы по которым сдвигается граница последовательности
Перем ЗаказБыл Экспорт;   // Документ.ЗаказПокупателя ИЛИ Документ.ЗаказВнутренний ИЛИ Документ.ЗаказПоставщику ИЛИ Массив. Содержит заказы по которым сдвигается граница последовательности
Перем МоментВремени Экспорт;   // Дата-время документа
Перем МоментВремениБыл Экспорт;   // Дата-время документа до изменения
Перем ДокументСсылка Экспорт;  // Ссылка на документ

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли