// Общий модуль "Управление печати этикеток и ценников (клиент)"


#Область ПрограммныйИнтерфейс

// Обработка подготовки перед печатью
//
// Параметры:
//  ОписаниеКоманды - Структура - Параметры команды.
// 
// Возвращаемое значение:
//  Булево - Признак возможности дальнейшей обработки события.
//
Функция ПодготовкаПечати(ОписаниеКоманды) Экспорт
	Если ОписаниеКоманды.МенеджерПечати = "Справочник.Номенклатура" Тогда
		ЭтоДокумент = Ложь;
	Иначе 
		ЭтоДокумент = Истина;
	КонецЕсли;
		
	АдресВХранилище =
		УправлениеПечатьюАльфаАвтоВызовСервера.ПолучитьДанныеДляПечатиЦенниковИЭтикеток(
			ОписаниеКоманды.Идентификатор,
			ОписаниеКоманды.ОбъектыПечати,
			ЭтоДокумент);
	
	ОткрытьФорму(
		"Обработка.ПечатьЭтикетокИЦенников.Форма.Форма",
		Новый Структура("АдресВХранилище, НазначениеШаблона", АдресВХранилище, Неопределено),
		ОписаниеКоманды.Форма,
		Новый УникальныйИдентификатор);
	
	Возврат Истина;

КонецФункции

#КонецОбласти