#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ТипыЦен") Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ТипЦен", ПараметрКоманды));
	Иначе
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Регистратор", ПараметрКоманды));
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ЦеныОпций.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,, ПараметрыВыполненияКоманды.НавигационнаяСсылка,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти