
#Область ПрограммныйИнтерфейс

// Создания нового массива сразу заполненго значениями.
//  
// Параметры:
//  Значение1 - Произвольный - Значение1
//  Значение2 - Произвольный -  Значение2
//  Значение3 - Произвольный -  Значение3
//  Значение4 - Произвольный -  Значение4
//  Значение5 - Произвольный -  Значение5
//  Значение6 - Произвольный -  Значение6
//  Значение7 - Произвольный -  Значение7
//  Значение8 - Произвольный -  Значение8
// 
// Возвращаемое значение:
// Массив Из Произвольный
//@skip-check method-too-many-params  
Функция Создать(Значение1,
                Значение2 = Неопределено,
                Значение3 = Неопределено,
                Значение4 = Неопределено,
                Значение5 = Неопределено,
                Значение6 = Неопределено,
                Значение7 = Неопределено,
                Значение8 = Неопределено) Экспорт
	
	Результат = Новый Массив();
	
	Если Значение1 <> Неопределено Тогда
		
		Результат.Добавить(Значение1);
		
	КонецЕсли;
	
	Если Значение2 <> Неопределено Тогда
		
		Результат.Добавить(Значение2);
		
	КонецЕсли;
	
	Если Значение3 <> Неопределено Тогда
		
		Результат.Добавить(Значение3);
		
	КонецЕсли;
	
	Если Значение4 <> Неопределено Тогда
		
		Результат.Добавить(Значение4);
		
	КонецЕсли;
	
	Если Значение5 <> Неопределено Тогда
		
		Результат.Добавить(Значение5);
		
	КонецЕсли;
	
	Если Значение6 <> Неопределено Тогда
		
		Результат.Добавить(Значение6);
		
	КонецЕсли;
	
	Если Значение7 <> Неопределено Тогда
		
		Результат.Добавить(Значение7);
		
	КонецЕсли;
	
	Если Значение8 <> Неопределено Тогда
		
		Результат.Добавить(Значение8);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает первый элемент массива.
// Если массив пустой, возвращается неопределено.
// 
// Параметры:
//  Коллекция - Массив из Произвольный - Массив
// 
// Возвращаемое значение:
//  Произвольный
Функция Голова(Коллекция) Экспорт
	
	Если Коллекция.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Коллекция[0];
	
КонецФункции

#КонецОбласти
