///////////////////////////////////////////////////////////////////////////////
// Модуль формы записи регистра "Соответствия настроек ЭДО и подразделений организации"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
	Отказ = Отказ Или РаботаСФормой.НужноОтменитьОткрытиеФормы();
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Если ЗначениеЗаполнено(Запись.Подразделение) Тогда
			Запись.Отправитель = Запись.Подразделение.Организация;
		КонецЕсли;
	КонецЕсли;
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		НастроитьПараметрыВыбораЭлементовФормы();
		УправлениеДиалогомНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	НастроитьПараметрыВыбораЭлементовФормы();
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Если ПодразделениеСоответствуетОрганизации() Тогда  
		ЗаполнитьОрганизациюЗаписи();
	Иначе
		Запись.Подразделение = Неопределено;   
		ТекстСообщения = НСтр("ru='Организация выбранного подразделения не соответствует выбранной организации.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодразделениеСоответствуетОрганизации()
	Если Не ЗначениеЗаполнено(Запись.Отправитель) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ОрганизацияПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Подразделение, "Организация");
	
	Если ЗначениеЗаполнено(Запись.Отправитель)
		И Запись.Отправитель = ОрганизацияПодразделения Тогда
		
		Возврат Истина;
		
	КонецЕсли;		
	
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ЗаполнитьОрганизациюЗаписи()
	Если ЗначениеЗаполнено(Запись.Подразделение) Тогда
		Запись.Отправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Подразделение, "Организация");
		Возврат;
	КонецЕсли;
КонецПроцедуры

#Область ОбработчикиСлужебногоПрограммногоИнтерфейса

&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	УправлениеДиалогомРегистраСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры 

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	УправлениеДиалогомРегистраСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
КонецПроцедуры 

#КонецОбласти

#КонецОбласти
