
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФайлЗаданийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ВыборФайлаКаталога", ЭтотОбъект, Ложь);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(Объект.ФайлЗаданий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ВыборФайлаКаталога(РасширениеРаботыСФайламиПодключено, РежимДиалогаВыбораФайлаВыборКаталога) Экспорт
	
	Если РасширениеРаботыСФайламиПодключено Тогда
		ДиалогВыбора = Новый ДиалогВыбораФайла(?( НЕ РежимДиалогаВыбораФайлаВыборКаталога, РежимДиалогаВыбораФайла.Открытие, РежимДиалогаВыбораФайла.ВыборКаталога));
		ДиалогВыбора.МножественныйВыбор = Ложь;
		ДиалогВыбора.Заголовок = НСтр(СтрШаблон("ru = '%1'", ?( НЕ РежимДиалогаВыбораФайлаВыборКаталога, "Выбор файла задания", "Выбор каталога импорта")));
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ДиалогВыбора", ДиалогВыбора);
		ПараметрыОповещения.Вставить("РежимДиалогаВыбораФайлаВыборКаталога", РежимДиалогаВыбораФайлаВыборКаталога);
		ДиалогВыбора.Показать(
			Новый ОписаниеОповещения("Подключаемый_ВыборФайлаКаталогаЗавершение", ЭтотОбъект, ПараметрыОповещения));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыборФайлаКаталогаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбора = ДополнительныеПараметры.ДиалогВыбора;
	РежимДиалогаВыбораФайлаВыборКаталога = ДополнительныеПараметры.РежимДиалогаВыбораФайлаВыборКаталога;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		Если НЕ РежимДиалогаВыбораФайлаВыборКаталога Тогда
			Объект.ФайлЗаданий = ДиалогВыбора.ПолноеИмяФайла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

