#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено ИЛИ ПараметрКоманды.Пустая() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОтчетОтбор = Новый Структура;
	ОтчетОтбор.Вставить("Заявка", ПараметрКоманды);
	ОткрытьФорму(
		"Отчет.ЗаявкиНаАвтомобиль.Форма",
		Новый Структура("Отбор,СформироватьПриОткрытии", ОтчетОтбор, Истина),
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность
	);
	
КонецПроцедуры

#КонецОбласти
