
#Область ПрограммныйИнтерфейс

// Процедура - Установить параметры функциональных опций интерфейса обработка оповещения.
//
// Параметры:
//  Результат               - Произвольный - Результат обработки оповещения
//  ДополнительныеПараметры - Произвольный - Дополнительные параметры обработки оповещения.
//
Процедура УстановитьПараметрыФункциональныхОпцийИнтерфейсаОбработкаОповещения(
	Результат,
	ДополнительныеПараметры) Экспорт
	
	Маска = АльфаАвтоВызовСервера.ПолучитьМаскуЛицензирования();
	
	УстанавливаемыеПараметры = Новый Структура; СбрасываемыеПараметры = Новый Массив;
	Если Маска <> Неопределено Тогда
		УстанавливаемыеПараметры.Вставить("ДоступностьПодсистемПоКлючуМаскаКлюча", Маска);
		УстановитьПараметрыФункциональныхОпцийИнтерфейса(УстанавливаемыеПараметры, СбрасываемыеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти