////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для получения данных связанных работ на клиенте.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает вид использования автоработы.
//
// Параметры:
//  СвязаннаяАвторабота - СправочникСсылка.Автоработы - авторабота.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыИспользованияАвторабот - вид использования автоработы.
//
Функция ВидИспользоватнияСвязаннойАвтоработы(СвязаннаяАвторабота) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СвязаннаяАвторабота, "ВидИспользования");
	
КонецФункции

// Возвращает Истина, если это ссылка на источник связанных работ.
//
// Параметры:
//  Тип - Тип - тип значения проверяемого.
//
// Возвращаемое значение:
//  Булево - Истина, если это ссылка на источник связанных работ.
//
Функция ЭтоСсылкаНаИсточник(Тип) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.ИсточникиСвязанныхРабот.Тип.СодержитТип(Тип);
	
КонецФункции

#КонецОбласти