///////////////////////////////////////////////////////////////////////////////
// Модуль формы "Заполнение простым способом"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СценарийПланирования        = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СценарийПланирования",        Неопределено);
	ФормаМастера                = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ФормаМастера",                Ложь);
	КоличествоПериодов          = ПолучитьЗначениеПараметраСтруктуры(Параметры, "КоличествоПериодов",          0);
	КоэффициентРоста            = ПолучитьЗначениеПараметраСтруктуры(Параметры, "КоэффициентРоста",            0);
	КоэффициентСезонности       = ПолучитьЗначениеПараметраСтруктуры(Параметры, "КоэффициентСезонности",       0);
	ТипАнализа                  = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ТипАнализа",                  Неопределено);
	ПоказательПланирования      = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПоказательПланирования",      Неопределено);
	СпособОкругления            = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СпособОкругления",            0);
	НеУчитыватьПериодыБезДанных = ПолучитьЗначениеПараметраСтруктуры(Параметры, "НеУчитыватьПериодыБезДанных", Ложь);
	КоличествоСезонов           = ПолучитьЗначениеПараметраСтруктуры(Параметры, "КоличествоСезонов",           0);
	СмещениеПланирования        = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СмещениеПланирования",        0);
	
	Если НЕ ФормаМастера Тогда
		ВалютаУпрУчета = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		Подразделение  = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПодразделениеКомпании", Справочники.ПодразделенияКомпании.ПустаяСсылка());
	Иначе
		ДокументОснование = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДокументОснование", Неопределено);
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Подразделение = ДокументОснование.ПодразделениеКомпании;
		КонецЕсли;
	КонецЕсли;
	
	ДатаПланирования = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДатаПланирования", Дата('00010101'));
	Периодичность    = СценарийПланирования.Периодичность;
	ТипЦен           = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ТипЦен", Справочники.ТипыЦен.ПустаяСсылка());
	ДатаДокумента    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Дата", Дата('00010101'));
	КурсДокумента    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "КурсДокумента", 0);
	
	Если НЕ ЗначениеЗаполнено(СценарийПланирования) ИЛИ НЕ ЗначениеЗаполнено(СценарийПланирования.Периодичность) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			Нстр("ru = 'Не выбран сценарий планирования, либо у выбранного сценария не указана периодичность.'"),
			, , , Отказ
		);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипАнализа) Тогда
		ТипАнализа = Перечисления.ТипыАнализа.ПоФактическимДаннымПродаж;
	КонецЕсли;
	
	Если КоличествоПериодов=0 Тогда
		КоличествоПериодов=3;
	КонецЕсли;
	
	Если КоэффициентРоста=0 Тогда
		КоэффициентРоста = 1;
	КонецЕсли;
	
	Если КоэффициентСезонности=0 Тогда
		КоэффициентСезонности=1;
	КонецЕсли;
	
	Если СмещениеПланирования=0 Тогда
		СмещениеПланирования=1;
	КонецЕсли;
	
	Если КоличествоСезонов=0 Тогда
		КоличествоСезонов=1;
	КонецЕсли;
	
	НастроитьПолеОтбора(Подразделение);
	
	ПараметрыТипаЦен = Новый Структура;
	ПараметрыТипаЦен.Вставить("ТипЦен",                    ТипЦен);
	ПараметрыТипаЦен.Вставить("КурсДокумента",             КурсДокумента);
	ПараметрыТипаЦен.Вставить("НадписьИнформацияОТипеЦен", Элементы.НадписьИнформацияОТипеЦен);
	ПланированиеСервер.СформироватьНадписьТипаЦены(ПараметрыТипаЦен);
	
	ВывестиПредставлениеПериода();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события возникающего на клиенте при изменении данных реквизита "КоличествоСезонов".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КоличествоСезоновПриИзменении(Элемент)
	
	КоличествоСезоновПриИзмененииНаСервере();
	
КонецПроцедуры // КоличествоСезоновПриИзменении()

// Обработчик события возникающегопри изменении данных реквизита "КоличествоСезонов" в контексте сервера.
//
&НаСервере
Процедура КоличествоСезоновПриИзмененииНаСервере()
	
	ПланированиеСервер.ПроверкаКоличестваСезонов(ЭтотОбъект, Периодичность);
	ВывестиПредставлениеПериода();
	
КонецПроцедуры // КоличествоСезоновПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "СмещениеПланирования".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СмещениеПланированияПриИзменении(Элемент)
	
	ВывестиПредставлениеПериода();
	
КонецПроцедуры // СмещениеПланированияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "КоличествоПериодов".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КоличествоПериодовПриИзменении(Элемент)
	
	КоличествоПериодовПриИзмененииНаСервере();
	
КонецПроцедуры // КоличествоПериодовПриИзменении()

// Обработчик события возникающегопри изменении данных реквизита "КоличествоПериодов" в контексте сервера.
//
&НаСервере
Процедура КоличествоПериодовПриИзмененииНаСервере()
	
	ПланированиеСервер.ПроверкаКоличестваСезонов(ЭтотОбъект, Периодичность);
	ВывестиПредставлениеПериода();
	
КонецПроцедуры // КоличествоПериодовПриИзмененииНаСервере()

// Обработчик события события возникающего на клиенте при регулировании поля ввода "КоэффициентРоста".
//
&НаКлиенте
Процедура КоэффициентРостаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КоэффициентРоста = Макс(КоэффициентРоста + Направление*0.01, 0);
	
КонецПроцедуры // КоэффициентРостаРегулирование()

// Обработчик события события возникающего на клиенте при регулировании поля ввода "КоэффициентСезонности".
//
&НаКлиенте
Процедура КоэффициентСезонностиРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КоэффициентСезонности = Макс(КоэффициентСезонности + Направление*0.01, 0);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик выполнения команды "Выбрать" на сервере
//
&НаСервере
Процедура ВыбратьНаСервере()
	
	ВВалютеУчета  = ТипЦен.ВВалютеУчета;
	РабочийТипЦен = ТипЦен;
	ПоКоличеству  = ПоказательПланирования;
	КоличествоПрошлыхПериодов = КоличествоПериодов*КоличествоСезонов;
	
	ДополнительныеПараметры = ПолучитьДополнительныеПараметрыЗапроса();
	МаксКоличествоПериодов = ПланированиеСервер.ПолучитьМаксимальноеКоличествоПериодов(ЭтотОбъект, ДополнительныеПараметры, "Авторабота");
	
	Если НеУчитыватьПериодыБезДанных Тогда
		
		Если МаксКоличествоПериодов = 0 Тогда
			Если ТипАнализа = Перечисления.ТипыАнализа.ПоФактическимДаннымПродаж Тогда
				ТекстТипАнализа = "по автоработам";
			ИначеЕсли ТипАнализа=Перечисления.ТипыАнализа.ПоРанееПланируемымДаннымПродаж Тогда
				ТекстТипАнализа = "по плановым автоработам";
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(Нстр("ru = 'Для анализа %1 и заданного периода планирования нет данных.'"),ТекстТипАнализа)
			);
			Возврат;
		КонецЕсли;
		
	ИначеЕсли (((КоличествоСезонов - 1) * 12) + (КоличествоПериодов)) > МаксКоличествоПериодов Тогда
		
		Если ТипАнализа = Перечисления.ТипыАнализа.ПоФактическимДаннымПродаж Тогда
			ТекстТипАнализа = "по автоработам";
		ИначеЕсли ТипАнализа=Перечисления.ТипыАнализа.ПоРанееПланируемымДаннымПродаж Тогда
			ТекстТипАнализа = "по плановым автоработам";
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
				Нстр("ru = 'Максимально допустимое количество периодов для анализа %1 для текущего планируемого периода: %2 %3.'"),
				ТекстТипАнализа,
				МаксКоличествоПериодов,
				ПланированиеСервер.ВернутьСтрокуКоличествоПериодовДляАнализа(МаксКоличествоПериодов, Периодичность)
			)
		);
		КоличествоПериодов = Мин(МаксКоличествоПериодов, КоличествоПериодов);
		СмещениеПланирования = Мин(МаксКоличествоПериодов - КоличествоПериодов + 1, СмещениеПланирования);
		КоличествоСезонов = Мин(КоличествоСезонов, Макс(Цел(МаксКоличествоПериодов / 12),1));
		ВывестиПредставлениеПериода();
		Возврат;
	КонецЕсли;
	
	ТекстОтбора = "";
	Если ДополнительныеПараметры.Свойство("ОтборПоПодразделению") Тогда
		ТекстОтбора = Символы.ПС+" И "+ДополнительныеПараметры.ОтборПоПодразделению;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ДопОтборы") Тогда
		ТекстОтбора = ТекстОтбора+Символы.ПС+"И "+ДополнительныеПараметры.ДопОтборы.ТекстОтбора;
	КонецЕсли;
	
	СтруктураПолей = Новый Структура;
	СтрПериодичность = СокрЛП(Периодичность);
	СтруктураПолей.Вставить("Поля", Новый Структура("Авторабота"));
	СтруктураПолей.Вставить("Количество");
	
	ИмяТаблицыРегистра = ?(ТипАнализа = Перечисления.ТипыАнализа.ПоФактическимДаннымПродаж, "Продажи", "БюджетОказанияУслугПоАвтоработам");
	
	ТекстЗапроса =
		"ВЫБРАТЬ 
		| 	МАКСИМУМ(ТаблицаДанных.Авторабота.Номенклатура.СтавкаНДС.Ставка) КАК Ставка,
		|	ТаблицаДанных.Авторабота.Наименование КАК Представление,
		|	ТаблицаДанных.Авторабота КАК Авторабота,
		|	НАЧАЛОПЕРИОДА(ТаблицаДанных.Период, "+СтрПериодичность+") КАК Период,
		|	СУММА(ТаблицаДанных.Количество) КАК Количество,
		|	ВЫРАЗИТЬ(СУММА(ТаблицаДанных.СуммаУпр)/СУММА(ТаблицаДанных.Количество) КАК ЧИСЛО(15,2)) КАК Цена,
		|	СУММА(ТаблицаДанных.СуммаУпр) КАК СуммаУпр,
		|	0 КАК СуммаНДС,
		|	"+Строка(СпособОкругления)+" КАК СпособОкругления
		|ПОМЕСТИТЬ 
		|	ТаблицаРегистра
		|
		|ИЗ
		|	РегистрНакопления."+ИмяТаблицыРегистра+" КАК ТаблицаДанных
		|ГДЕ
		| #ТекстОтбора# 
		|	"+ТекстОтбора+"
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДанных.Авторабота,
		|	НАЧАЛОПЕРИОДА(ТаблицаДанных.Период, "+СтрПериодичность+")
		|ИМЕЮЩИЕ
		|	СУММА(ТаблицаДанных.Количество)<>0";
	
	// Получим даты границ анализируемого периода
	ПараметрыДляАнализаДат = Новый Структура;
	ПараметрыДляАнализаДат.Вставить("Периодичность", Периодичность);
	ПараметрыДляАнализаДат.Вставить("ДатаПланирования", ДатаПланирования);
	ПланированиеСервер.ПолучитьПериодыПланирования(ЭтотОбъект, ПараметрыДляАнализаДат);
	
	Запрос = Новый Запрос();
	МенеджерДанныхРегистра = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерДанныхРегистра;
	
	Для Каждого ТекПараметр Из ПараметрыДляАнализаДат.СтруктураСезонов Цикл
		Запрос.УстановитьПараметр(ТекПараметр.Ключ, ТекПараметр.Значение);
	КонецЦикла;
	
	Если ДополнительныеПараметры.Свойство("ДопОтборы") Тогда
		Для Каждого ТекПараметр Из ДополнительныеПараметры.ДопОтборы.Параметры Цикл
			Запрос.УстановитьПараметр(ТекПараметр.Ключ, ТекПараметр.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "#ТекстОтбора#", ПараметрыДляАнализаДат.ТекстОтбора);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Если ДополнительныеПараметры.Свойство("Подразделение") Тогда
		Запрос.УстановитьПараметр("Подразделение", ДополнительныеПараметры.Подразделение);
	КонецЕсли;
	
	Запрос.Выполнить();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КоэффициентРостаПродаж", КоэффициентРоста);
	СтруктураПараметров.Вставить("КоэффициентСезонности", КоэффициентСезонности);
	СтруктураПараметров.Вставить("КоличествоПрошлыхПериодов", КоличествоПрошлыхПериодов);
	СтруктураПараметров.Вставить("ДатаДокумента", ДатаДокумента);
	СтруктураПараметров.Вставить("ПоКоличеству", ПоКоличеству);
	СтруктураПараметров.Вставить("СтрПериодичность", СтрПериодичность);
	СтруктураПараметров.Вставить("НеУчитыватьПериодыБезДанных", НеУчитыватьПериодыБезДанных);
	
	ДанныеАвторабот = ПланированиеСервер.ОбработатьРезультатНаивногоПрогнозирования(СтруктураПараметров, СтруктураПолей, МенеджерДанныхРегистра);
	
	Для Каждого ТекСтрока Из ДанныеАвторабот Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры // ВыбратьНаСервере()

// Обработчик команды "Выбрать"
//
&НаКлиенте
Процедура Выбрать(Команда)
	
	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Нстр("ru = 'Не выбран тип цен.'"));
		Возврат;
	КонецЕсли;
	
	Если КоличествоПериодов = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Нстр("ru = 'Количество периодов для анализа должно быть отлично от нуля.'"));
		Возврат;
	КонецЕсли;
	
	ВыбратьНаСервере();
	
	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("КоличествоПериодов",          КоличествоПериодов);
	РезультатВыбора.Вставить("КоэффициентРостаПродаж",      КоэффициентРоста);
	РезультатВыбора.Вставить("КоэффициентСезонности",       КоэффициентСезонности);
	РезультатВыбора.Вставить("ТипАнализа",                  ТипАнализа);
	РезультатВыбора.Вставить("ПоказательПланирования",      ПоказательПланирования);
	РезультатВыбора.Вставить("СпособОкругления",            СпособОкругления);
	РезультатВыбора.Вставить("НеУчитыватьПериодыБезДанных", НеУчитыватьПериодыБезДанных);
	РезультатВыбора.Вставить("КоличествоСезонов",           КоличествоСезонов);
	РезультатВыбора.Вставить("СмещениеПланирования",        СмещениеПланирования);
	
	ТаблицаРезультата = Новый Массив;
	Для Каждого ТекСтрока Из Результат Цикл
		
		НоваяСтрока = Новый Структура("Авторабота, Количество, Цена, СуммаВсегоУпр, СуммаНДС, СтавкаНДС", 
		                              ТекСтрока.Авторабота, ТекСтрока.Количество, ТекСтрока.Цена, ТекСтрока.СуммаВсегоУпр, ТекСтрока.СуммаНДС, ТекСтрока.Ставка);
		ТаблицаРезультата.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	РезультатВыбора.Вставить("ТаблицаАвторабот", ТаблицаРезультата);
	РезультатВыбора.Вставить("СпособПоследнегоЗаполнения", 0);
	
	Закрыть(РезультатВыбора);
	
КонецПроцедуры // Выбрать()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиПредставлениеПериода()
	
	Если Периодичность=Перечисления.ПериодичностьПланирования.Месяц Тогда
		ПредставлениеПериода = Формат(ДатаПланирования, "ДФ='ММММ гггг ""г.""'");
	ИначеЕсли Периодичность=Перечисления.ПериодичностьПланирования.Квартал Тогда
		ПредставлениеПериода = Формат(ДатаПланирования, "ДФ='к ""квартал"" гггг ""г.""'");
	ИначеЕсли Периодичность=Перечисления.ПериодичностьПланирования.Год Тогда
		ПредставлениеПериода = Формат(ДатаПланирования, "ДФ='гггг ""г.""'");
	КонецЕсли;
	
	ПредставлениеПериода = "Период планирования "+ПредставлениеПериода+" по данным за "+ПланированиеСервер.ВывестиПредставлениеПериода(ЭтотОбъект, Периодичность, ДатаПланирования);
	Элементы.НадписьПредставлениеПериода.Заголовок = ПредставлениеПериода;
	
КонецПроцедуры // ВывестиПредставлениеПериода()

// возвращает дополнительные параметры запроса
//
&НаСервере
Функция ПолучитьДополнительныеПараметрыЗапроса()
	
	// Вычислим максимально допустимое количество периодов для анализа
	ДополнительныеПараметры = Новый Структура;
	
	ДеревоОтбора = РеквизитФормыВЗначение("Отбор");
	
	// Вычислим максимально допустимое количество периодов для анализа
	ДополнительныеПараметры = Новый Структура;
	
	ЭлементОтбора = ДеревоОтбора.Строки.Найти("Подразделение", "ЛевоеЗначение");
	Если ЭлементОтбора.Использование Тогда
		СтрокаУсловия=СтрЗаменить(СтрЗаменить(Документы.БюджетОказанияУслугПоАвтоработам.СформироватьСтрокуВидаСравнения(ЭлементОтбора.ВидСравнения),"#","ТаблицаДанных.ПодразделениеКомпании"),"&","&Подразделение");
		ДополнительныеПараметры.Вставить("ОтборПоПодразделению", СтрокаУсловия);
		ДополнительныеПараметры.Вставить("Подразделение", ЭлементОтбора.ПравоеЗначение);
	КонецЕсли;
	
	ЭлементОтбора = ДеревоОтбора.Строки.Найти("Авторабота", "ЛевоеЗначение");
	Если ЭлементОтбора.Использование Тогда
		СтрокаУсловияОтбора = СтрЗаменить(СтрЗаменить(Документы.БюджетОказанияУслугПоАвтоработам.СформироватьСтрокуВидаСравнения(ЭлементОтбора.ВидСравнения),"#"," ТаблицаДанных.Авторабота"),"&","&Авторабота");
		ПланированиеСервер.ДобавитьДополнительныйОтбор(ДополнительныеПараметры, "ДопОтборы", СтрокаУсловияОтбора, Новый Структура("Авторабота", ЭлементОтбора.ПравоеЗначение));
	КонецЕсли;
	
	Если ТипАнализа=Перечисления.ТипыАнализа.ПоФактическимДаннымПродаж Тогда
		СтрокаУсловияОтбора = "ТаблицаДанных.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|	И ТаблицаДанных.Авторабота <> ЗНАЧЕНИЕ(Справочник.Автоработы.ПустаяСсылка)";
		ПланированиеСервер.ДобавитьДополнительныйОтбор(ДополнительныеПараметры, "ДопОтборы", СтрокаУсловияОтбора, Новый Структура());
		ДополнительныеПараметры.Вставить("ИмяТаблицы", "Продажи");
	ИначеЕсли ТипАнализа=Перечисления.ТипыАнализа.ПоРанееПланируемымДаннымПродаж Тогда
		СтрокаУсловияОтбора = "ТаблицаДанных.СценарийПланирования=&СценарийПланирования";
		ПланированиеСервер.ДобавитьДополнительныйОтбор(ДополнительныеПараметры, "ДопОтборы", СтрокаУсловияОтбора, Новый Структура("СценарийПланирования", СценарийПланирования));
		ДополнительныеПараметры.Вставить("ИмяТаблицы", "БюджетОказанияУслугПоАвтоработам");
	КонецЕсли;
	
	Возврат ДополнительныеПараметры;
	
КонецФункции // ПолучитьДополнительныеПараметрыЗапроса()

// Обработчик окончания выбора значения отбора
//
&НаКлиенте
Процедура ОповещениеВыбораЗначенияОтбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("СписокЗначений") Тогда
		
		ТекущиеДанные = Элементы.Отбор.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.ПравоеЗначение = РезультатЗакрытия;
		
	КонецЕсли;
	Элементы.Отбор.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры //ОповещениеВыбораЗначенияОтбора()

// Функция определения того, что отбор выполняетсяпо списку значений
//
&НаКлиенте
Функция ОтборПоСписку(ВидСравненияОтбора)
	
	РезультатОтбора = Ложь;
	Если ВидСравненияОтбора = ВидСравнения.ВСписке ИЛИ 
		ВидСравненияОтбора = ВидСравнения.ВСпискеПоИерархии ИЛИ
		ВидСравненияОтбора = ВидСравнения.НеВСписке ИЛИ 
		ВидСравненияОтбора= ВидСравнения.НеВСпискеПоИерархии Тогда
		
		РезультатОтбора = Истина;
		
	КонецЕсли;
	
	Возврат РезультатОтбора;
	
КонецФункции //ОтборПоСписку()

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ОТБОРОМ

// Добавляем дополнительные отборы
&НаСервере
Процедура НастроитьПолеОтбора(Подразделение)
	
	// заполним быстрые отборы
	ДеревоОтбор = ЭтотОбъект.Отбор.ПолучитьЭлементы();
	
	НовыйОтбор = ДеревоОтбор.Добавить();
	НовыйОтбор.Использование  = Истина;
	НовыйОтбор.ЛевоеЗначение  = "Подразделение";
	НовыйОтбор.ВидСравнения   = ВидСравнения.Равно;
	НовыйОтбор.ПравоеЗначение = Подразделение;
	НовыйОтбор.Заголовок      = "Подразделение";
	
	НовыйОтбор = ДеревоОтбор.Добавить();
	НовыйОтбор.Использование  = Ложь;
	НовыйОтбор.ЛевоеЗначение  = "Авторабота";
	НовыйОтбор.ВидСравнения   = ВидСравнения.Равно;
	НовыйОтбор.ПравоеЗначение = Справочники.Автоработы.ПустаяСсылка();
	НовыйОтбор.Заголовок      = "Авторабота";
	
КонецПроцедуры // НастроитьПолеОтбора()

// Обработчик события возникающего на клиенте перед началом изменения таблицы "Отбор".
//
&НаКлиенте
Процедура ОтборПередНачаломИзменения(Элемент, Отказ)
	
	Поле = Элементы.Отбор.ТекущийЭлемент;
	Если Поле.Имя = "ОтборПравоеЗначение" Тогда
		
		СтандартнаяОбработка = Истина;
		ВыбраннаяСтрока      = Неопределено;
		ОтборПравоеЗначениеНачалоВыбора(Элемент, ВыбраннаяСтрока, СтандартнаяОбработка);
		
	ИначеЕсли Поле.Имя = "ОтборВидСравнения" Тогда
		
		СтандартнаяОбработка = Истина;
		ВыбраннаяСтрока      = Неопределено;
		ОтборВидСравненияНачалоВыбора(Элемент, ВыбраннаяСтрока, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры //ОтборПередНачаломИзменения()

// Обработчик изменения поля "Вид сравнения" таблицы "Отбор"
//
&НаКлиенте
Процедура ОтборВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Отбор.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.ПравоеЗначение) = Тип("СписокЗначений") И ЗначениеЗаполнено(ТекущиеДанные.ПравоеЗначение) И НЕ ТекущиеДанные.ВидСравнения = ВидСравнения.ВСписке И НЕ ТекущиеДанные.ВидСравнения = ВидСравнения.НеВСписке
		 И НЕ ТекущиеДанные.ВидСравнения = ВидСравнения.ВСпискеПоИерархии И НЕ ТекущиеДанные.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
		
		Значение = ТекущиеДанные.ПравоеЗначение[0].Значение;
		ТекущиеДанные.ПравоеЗначение.Очистить();
		ОтборПравоеЗначениеНачалоВыбора(Элементы.ОтборПравоеЗначение, Значение, Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ОтборВидСравненияПриИзменении()

// Обработчик начала выбора поля "Вид сравнения" таблицы "Отбор"
//
&НаКлиенте
Процедура ОтборВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокВыбора = Элементы.ОтборВидСравнения.СписокВыбора;
	СписокВыбора.Очистить();
	
	СписокВыбора.Добавить(ВидСравнения.Равно,              Строка(ВидСравнения.Равно));
	СписокВыбора.Добавить(ВидСравнения.НеРавно,            Строка(ВидСравнения.НеРавно));
	СписокВыбора.Добавить(ВидСравнения.ВСписке,            Строка(ВидСравнения.ВСписке));
	СписокВыбора.Добавить(ВидСравнения.ВИерархии,          Строка(ВидСравнения.ВИерархии));
	СписокВыбора.Добавить(ВидСравнения.ВСпискеПоИерархии,  Строка(ВидСравнения.ВСпискеПоИерархии));
	СписокВыбора.Добавить(ВидСравнения.НеВСписке,          Строка(ВидСравнения.НеВСписке));
	СписокВыбора.Добавить(ВидСравнения.НеВИерархии,        Строка(ВидСравнения.НеВИерархии));
	СписокВыбора.Добавить(ВидСравнения.НеВСпискеПоИерархии,Строка(ВидСравнения.НеВСпискеПоИерархии));
	
КонецПроцедуры // ОтборВидСравненияНачалоВыбора()

// Обработчик изменения поля "Правое значение" таблицы "Отбор"
//
&НаКлиенте
Процедура ОтборПравоеЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Отбор.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ТекущиеДанные.Использование = ЗначениеЗаполнено(ТекущиеДанные.ПравоеЗначение);
	
КонецПроцедуры

// Обработчик начала выбора поля "Правое значение" таблицы "Отбор"
//
&НаКлиенте
Процедура ОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Отбор.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтборПоСписку(ТекущиеДанные.ВидСравнения) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТекущиеДанные.ВидСравнения = ВидСравнения.ВСпискеПоИерархии ИЛИ ТекущиеДанные.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
			ТолькоГруппы = Истина;
		Иначе
			ТолькоГруппы = Ложь;
		КонецЕсли;
		
		СписокВыбора =  ТекущиеДанные.ПравоеЗначение;
		
		Если ТекущиеДанные.ЛевоеЗначение = "Авторабота" Тогда
			СтруктураПараметров = Новый Структура("СписокВыбора, ТипЗначения, ДоступныеЗначения, ТолькоГруппы", СписокВыбора, Новый ОписаниеТипов("СправочникСсылка.Автоработы"), Неопределено, ТолькоГруппы);
		ИначеЕсли ТекущиеДанные.ЛевоеЗначение = "Подразделение" Тогда
			СтруктураПараметров = Новый Структура("СписокВыбора, ТипЗначения, ДоступныеЗначения, ТолькоГруппы", СписокВыбора, Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"), Неопределено, ТолькоГруппы);
		КонецЕсли;
			
		ОписаниеОповещенияВыбораЗначения = Новый ОписаниеОповещения("ОповещениеВыбораЗначенияОтбора", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ОтчетВыборЗначенияОтбораИзСписка", СтруктураПараметров, Элемент,,,, ОписаниеОповещенияВыбораЗначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		Если ТекущиеДанные.ВидСравнения = ВидСравнения.ВИерархии ИЛИ ТекущиеДанные.ВидСравнения = ВидСравнения.НеВИерархии Тогда
			ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
		Иначе
			ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
		КонецЕсли;
		
		Если ТекущиеДанные.ЛевоеЗначение = "Подразделение" Тогда
			Элементы.ОтборПравоеЗначение.БыстрыйВыбор         = Ложь;
			Элементы.ОтборПравоеЗначение.ОграничениеТипа      = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании");
			Элементы.ОтборПравоеЗначение.КнопкаВыбора         = Истина;
			Элементы.ОтборПравоеЗначение.ВыборГруппИЭлементов = ВыборГруппИЭлементов;
		ИначеЕсли ТекущиеДанные.ЛевоеЗначение = "Авторабота" Тогда
			Элементы.ОтборПравоеЗначение.БыстрыйВыбор         = Ложь;
			Элементы.ОтборПравоеЗначение.ОграничениеТипа      = Новый ОписаниеТипов("СправочникСсылка.Автоработы");
			Элементы.ОтборПравоеЗначение.КнопкаВыбора         = Истина;
			Элементы.ОтборПравоеЗначение.ВыборГруппИЭлементов = ВыборГруппИЭлементов;
		КонецЕсли;
		
		Если ДанныеВыбора <> Неопределено Тогда
			ТекущиеДанные.ПравоеЗначение = ДанныеВыбора;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

