
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ВидСобытия = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ВидСобытия");
	ЗапрещенныеВидыСобытий = Справочники.ВидыСобытий.ЗапрещенныеВидыСобытий();
	
	// Ограничим список видов событий
	Если НЕ ЗначениеЗаполнено(ВидСобытия) И ЗапрещенныеВидыСобытий.Количество() > 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ВидыСобытий,
			"Ссылка",
			Новый ФиксированныйМассив(ЗапрещенныеВидыСобытий),
			ВидСравненияКомпоновкиДанных.НеВСписке,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыСобытий

&НаКлиенте
Процедура ВидыСобытийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущийВидСобытия = Элементы.ВидыСобытий.ТекущиеДанные;
	ЭтаФорма.Закрыть(ТекущийВидСобытия.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущийВидСобытия = Элементы.ВидыСобытий.ТекущиеДанные;
	ЭтаФорма.Закрыть(ТекущийВидСобытия.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

