
#Область ПрограммныйИнтерфейс

// Формирует запрос проверки РНПТ и его отправку на открытый API ФНС
//
// Параметры:
//  Форма				 - УправляемаяФорма - Форма, из которой была вызвана проверка.
//  ПараметрыКоманды	 - Структура - Входящие параметры запроса:
//    * РНПТ - СправочникСсылка.ГТД - РНПТ для проверки ФНС;
//    * Организация - СправочникСсылка.Организации - Организация для определения настроек подключения к ФНС.
//  ОповещениеЗавершения - ОписаниеОповещения - Обработчик, в котором обрабатывается результат проверки.
//
Процедура ОтправитьЗапросПроверкиРНПТ(Форма, ПараметрыКоманды, ОповещениеЗавершения) Экспорт
	
	ДлительнаяОперация = ОбменСФНСВызовСервера.ЗапросПроверкиРНПТ(
		Форма.УникальныйИдентификатор, ПараметрыКоманды);
	
	ПараметрыОперации = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОперации.ТекстСообщения = НСтр("ru='Выполняется запрос проверки РНПТ в ФНС'");
	ПараметрыОперации.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОперации.ВыводитьОкноОжидания = Истина;
	ПараметрыОперации.ВыводитьСообщения = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		ОповещениеЗавершения,
		ПараметрыОперации);
	
КонецПроцедуры

#КонецОбласти
