
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;

	Для Каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.Контрагент) Тогда
			Отказ = Истина;
			СтрокаОтказа = НСтр("ru = 'Не заполнено поле ""Контрагент"". Запись невозможна.'");
			Продолжить;
		КонецЕсли; 
		Если Запись.Контрагент.ЭтоГруппа Тогда
			Отказ = Истина;
			СтрокаОтказа = НСтр("ru = 'Нельзя привязывать куратора к группе контрагентов.'");
			Прервать;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Запись.Куратор) Тогда
			Отказ = Истина;
			СтрокаОтказа = НСтр("ru = 'Не заполнено поле ""Куратор"". Запись невозможна.'");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрокаОтказа);
	КонецЕсли;
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#КонецЕсли