#Область ПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обработчик при изменении настроек.
//
// Параметры:
//  ФормаОтчета - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура ПриИзмененииНастроек(ФормаОтчета) Экспорт
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	ТипЦен = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипЦен"));
	
	Если НЕ ЗначениеЗаполнено(ТипЦен.Значение) Тогда
		
		ТипЦен.Значение = ПраваИНастройкиПользователя.Значение("ОсновнойТипЦенПродажиАвтомобилей");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыПлатформаСервер.ВывестиОтчет(
		ЭтотОбъект,
		ДокументРезультат,
		ДанныеРасшифровки,
		СтандартнаяОбработка,
		,
		,
		,
		Истина
	);
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти