
#Область ПрограммныйИнтерфейс

Функция АдресСервераПЭП() Экспорт
	
	Возврат "https://api.doc4b.ru/v1";
	
КонецФункции

Функция МенеджерСоединения() Экспорт
	
	Возврат ИнтеграцияСоединениеПЭП;
	
КонецФункции

Процедура ПриОпределенииПараметровСоединения(ПараметрыСоединения) Экспорт
	
	ПараметрыСоединения.Вставить("ПисатьЛог", Истина); // Переопределеить после реализации журналирования
	
КонецПроцедуры

// Определяем модуль с интерфейсом для логирования.
// 
// Возвращаемое значение:
//  Произвольный - модуль журналирования
Функция МодульЖурналирования() Экспорт
	
	Возврат МенеджерЖурналированияПЭП;
	
КонецФункции

Функция APIКлюч() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.КлючAPIПЭП.Получить();
	
КонецФункции

#КонецОбласти
