#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыПлатформаСервер.ВывестиОтчет(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	ПараметрыСКД = СхемаКомпоновкиДанных.Параметры;
	
	ОтчетыПлатформаСервер.ПроверкаЗаполненияПараметровОтчета(Параметры, ПараметрыСКД, Отказ);
КонецПроцедуры

#КонецОбласти

#КонецЕсли