
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция записи параметров в регистр сведений
//
Функция ЗаписатьГруппыСовместногоИспользованияСкидокИМаркетинговыхПрограмм(СкидкаАвтомобилей, ТаблицаДанных) Экспорт
	
	Отказ = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.ГруппыСовместногоИспользованияСкидокИМаркетинговыхПрограмм.СоздатьНаборЗаписей();
	Набор.Отбор.Скидка.Установить(СкидкаАвтомобилей);
	
	Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), ТекущаяСтрока);
	КонецЦикла;
	
	Попытка
		Набор.Записать(Истина);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),,,, Отказ);
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции 

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли