
// Общий модуль "Управление печатью клиент (Альфа Авто)"

#Область ПрограммныйИнтерфейс

// Выполняет открытие формы редактирования реквизитов доставки
// 
// Параметры:
//  ЭтотОбъект - ФормаКлиентскогоПриложения - форма из который осуществлен вызов
//
Процедура ОткрытьФормуРедактированияРеквизитовДоставки(ЭтотОбъект) Экспорт

	ПараметрыФормы = ПолучитьПустуюСтруктуруРеквизитовДоставки();
	
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ЭтотОбъект.Объект); 
	
	СформироватьИмяВладельцаФормы(ЭтотОбъект.ИмяФормы, ПараметрыФормы);
	
	ОткрытьФорму("ОбщаяФорма.РедактированиеРеквизитовПечати", 
		ПараметрыФормы, 
		ЭтотОбъект, 
		, 
		, 
		, 
		, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПустуюСтруктуруРеквизитовДоставки() Экспорт

	РеквизитыДоставки = Новый Структура;
	
	РеквизитыДоставки.Вставить("Грузоотправитель");
	РеквизитыДоставки.Вставить("Грузополучатель");
	РеквизитыДоставки.Вставить("Перевозчик");
	РеквизитыДоставки.Вставить("АдресДоставки");
	РеквизитыДоставки.Вставить("Водитель");
	РеквизитыДоставки.Вставить("ОписаниеГруза");
	РеквизитыДоставки.Вставить("МодельАвтомобиля");
	РеквизитыДоставки.Вставить("ГосНомерАвтомобиля");
	РеквизитыДоставки.Вставить("ЕстьПрицеп");
	РеквизитыДоставки.Вставить("МодельПрицепа");
	РеквизитыДоставки.Вставить("ГосНомерПрицепа");
	РеквизитыДоставки.Вставить("ЭтоПеревозкаАвтотранспортом");
	РеквизитыДоставки.Вставить("НомерВодительскогоУдостоверения");
	РеквизитыДоставки.Вставить("Руководитель"); 
	РеквизитыДоставки.Вставить("ГлавныйБухгалтер");  
	РеквизитыДоставки.Вставить("Отпустил"); 
	РеквизитыДоставки.Вставить("Получил");
    РеквизитыДоставки.Вставить("Принял");
	РеквизитыДоставки.Вставить("Организация"); 
	РеквизитыДоставки.Вставить("ПодразделениеКомпании"); 
	РеквизитыДоставки.Вставить("Контрагент");

	Возврат РеквизитыДоставки;
	
КонецФункции

Процедура СформироватьИмяВладельцаФормы(ИмяФормы, ПараметрыФормы)

	МассивИмени = СтрРазделить(ИмяФормы, ".");
	ИмяОбъекта 	= МассивИмени[0] + "." + МассивИмени[1];
	
	ПараметрыФормы.Вставить("ИмяВладельца", ИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти