
#Область СлужебныйПрограммныйИнтерфейс

// +РАРУС
// Формирование списка принтеров.
// 
// Возвращаемое значение:
//  Произвольный - Список принтеров из системы.
//
Функция ОбновитьСписокПринтеров() Экспорт 
	
	Объекты = Неопределено;
	
	Попытка
		
		#Если НЕ МобильныйКлиент Тогда
		Locator = Новый COMОбъект("WbemScripting.SWbemLocator");
		Сервисы = Locator.ConnectServer(".");
		Объекты = Сервисы.InstancesOf("Win32_Printer");
		#Иначе
		ВызватьИсключение НСтр("ru = 'Функция недоступна в режиме мобильного клиента.'");
		#КонецЕсли
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Объекты;
	
КонецФункции // -РАРУС

#КонецОбласти