
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗначений.ТипЗначения       = Параметры.ТипЗначения;
	СписокЗначений.ДоступныеЗначения = Параметры.ДоступныеЗначения;
	Если ТипЗнч(Параметры.СписокВыбора) = Тип("СписокЗначений") Тогда
		СписокЗначений.ЗагрузитьЗначения(Параметры.СписокВыбора.ВыгрузитьЗначения());
	ИначеЕсли ЗначениеЗаполнено(Параметры.СписокВыбора) Тогда
		СписокЗначений.Добавить(Параметры.СписокВыбора);
	КонецЕсли;
	ТолькоГруппы                              = Параметры.ТолькоГруппы;
	
	МассивТипов = Параметры.ТипЗначения.Типы();
	Если МассивТипов.Количество()> 0 Тогда
		Если МассивТипов[0] = Тип("Строка") Тогда
			Элементы.СписокЗначенийЗначение.КнопкаВыбора = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗначений

&НаКлиенте
Процедура СписокЗначенийЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТолькоГруппы Тогда
		Элемент.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОк(Команда)
	
	Закрыть(СписокЗначений);
	
КонецПроцедуры

#КонецОбласти