
#Область ОбработчикиСобытийФормы

// Процедура - при создании на сервере
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Выражение") Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Самостоятельное использование формы не предусмотрено'");
	КонецЕсли;
	
	УстановитьНадписьТекстВыражения();
	ПолеТекстовогоДокумента.УстановитьТекст(Параметры.Выражение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "ОК"
//
&НаКлиенте
Процедура ОК(Команда)
	
	ОповеститьОВыборе(ПолеТекстовогоДокумента.ПолучитьТекст());
	
КонецПроцедуры

// Процедура - обработчик команды "Отмена"
//
&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает текст надписи текста выражения
//
&НаСервере
Процедура УстановитьНадписьТекстВыражения()
	
	НадписьТекстВыражения = НСтр("ru = 'В тексте выражения можно использовать следующие предопределенные параметры:
	|В тексте выражения можно использовать следующие предопределенные параметры:
	|   Результат      - результат вычисления (на входе - значение по умолчанию)
	|   ТекстЯчейки    - текст текущей ячейки
	|   ТекстыЯчеек    - массив текстов ячеек строки
	|   ТекущиеДанные  - структура загруженных значений
	|   флКонтрольЗаполнения - флаг запрета создания новых элементов
	|   ДокументОбъект - документ для загрузки данных
	|Встроенные функции, функции общих модулей.'");;
	
КонецПроцедуры // УстановитьНадписьТекстВыражения()

#КонецОбласти

