
#Область ПрограммныйИнтерфейс

// Формирует структуру с параметрами подключения к серверам AutoPad Web
//
// Параметры:
//  Объект - ОбработкаОбъект.ОбменСAudaPadWeb - Объект для которого формирует параметры подключения.
// 
// Возвращаемое значение:
//  Структура - Структура параметров подключения.
//
Функция ПараметрыПодключенияОбъекта(Объект) Экспорт
	
	Параметры = Новый Структура;
	
	СервисЗаданийШаблон      = "https://%1/b2b/services/TaskService_v1?wsdl";
	СервисПрикрепленийШаблон = "https://%1/b2b/services/AttachmentService_v1?wsdl";
	
	Параметры.Вставить("СервисЗаданий"      , СтрШаблон(СервисЗаданийШаблон, Объект.АдресСервера));
	Параметры.Вставить("СервисПрикреплений" , СтрШаблон(СервисПрикрепленийШаблон, Объект.АдресСервера));
	Параметры.Вставить("АдресСервера"       , Объект.АдресСервера);
	Параметры.Вставить("РесурсЗаданий"      , "/b2b/services/TaskService_v1?wsdl");
	Параметры.Вставить("РесурсПрикреплений" , "/b2b/services/AttachmentService_v1?wsdl");
	Параметры.Вставить("Логин"              , Объект.ЛогинAutoPadWeb);
	Параметры.Вставить("Пароль"             , Объект.ПарольAutoPadWeb);
	Параметры.Вставить("ЛогинПрокси"        , ?(Объект.ИспользоватьПрокси, Объект.ЛогинПрокси, ""));
	Параметры.Вставить("ПарольПрокси"       , ?(Объект.ИспользоватьПрокси, Объект.ПарольПрокси, ""));
	Параметры.Вставить("ПространствоИмен"   , "http://serviceinterface_v1.b2b.audatex.com");
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти