
#Область ПрограммныйИнтерфейс

// Возвращает массив 
// 
// Параметры:
//  ИмяФормы - Строка - имя формы, в которой произошло событие
//  Модуль   - ОбщийМодуль - 
// 
// Возвращаемое значение:
//  Массив - массив модулей
//
Функция МодулиДляОбработки(ИмяФормы, Модуль) Экспорт
	
	СвязьФормИМодулейДляОбработки = Модуль.СвязьФормИМодулейДляОбработки();
	МодулиДляОбработки = СвязьФормИМодулейДляОбработки.Получить(ИмяФормы);
	
	Если МодулиДляОбработки <> Неопределено Тогда
		
		Возврат ВМассив(МодулиДляОбработки); 
		
	КонецЕсли;
	
	МодулиДляОбработки = СвязьФормИМодулейДляОбработки.Получить(ИмяМетаданногоИзИмениФормы(ИмяФормы));
	
	Если МодулиДляОбработки <> Неопределено Тогда
		
		Возврат ВМассив(МодулиДляОбработки); 
		
	КонецЕсли; 
	
	Возврат Новый Массив();
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ВМассив(Знач Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Значение);
	
КонецФункции

Функция ИмяМетаданногоИзИмениФормы(Знач ИмяФормы)
	
	ЧастиИмени = СтрРазделить(ИмяФормы, ".");
	
	Если ЧастиИмени.Количество() < 2 Тогда
		
		Возврат ИмяФормы;
		
	КонецЕсли;
	
	Возврат СтрШаблон("%1.%2", ЧастиИмени[0], ЧастиИмени[1]);
	
КонецФункции

#КонецОбласти