
#Область ПрограммныйИнтерфейс

// Добавление дополнительных сведений о версии объекта
//
// Параметры:
//  Объект - для создания версии.
//  СведенияОВерсииОбъекта - версия объекта.
//
Процедура ДобавитьДополнительныеСведенияОВерсииОбъекта(Объект, СведенияОВерсииОбъекта) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РабочееМестоКлиента = ПараметрыСеанса.РабочееМестоКлиента;
	Если ЗначениеЗаполнено(РабочееМестоКлиента) И ЗначениеЗаполнено(РабочееМестоКлиента.ИмяКомпьютера) Тогда
		ИмяКомпьютера = РабочееМестоКлиента.ИмяКомпьютера;
	Иначе 
		ИмяКомпьютера = НСтр("ru = '<не установлен>'");
	КонецЕсли;
	
	СведенияОВерсииОбъекта.Вставить("Компьютер", ИмяКомпьютера);
	
	Если Объект.ДополнительныеСвойства.Свойство("__РегистрацияИзменений__ПередЗаписью") Тогда
		Если Объект.ДополнительныеСвойства.__РегистрацияИзменений__ПередЗаписью.Свойство("Событие") Тогда
			СведенияОВерсииОбъекта.Вставить("Событие", Объект.ДополнительныеСвойства.__РегистрацияИзменений__ПередЗаписью.Событие);// событие документа
		Иначе
			СведенияОВерсииОбъекта.Вставить("Событие", Перечисления.СобытияВерсионирования.Запись);// по умолчанию - запись
		КонецЕсли;
	Иначе
		СведенияОВерсииОбъекта.Вставить("Событие", Перечисления.СобытияВерсионирования.Запись);// для справочника - всегда запись
	КонецЕсли;

КонецПроцедуры

#КонецОбласти