#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ПараметрКоманды.Пустая() Тогда
		
		Оповестить("ПереходВЗаписьНаРемонт", ПараметрКоманды, ПараметрыВыполненияКоманды.Источник);
		
		ФормаЗаписиНаРемонт = ОткрытьФорму(
			"Обработка.ЗаписьНаРемонт.Форма", Новый Структура("Контекст", ПараметрКоманды),, "ОткрытаяЗаписьНаРемонт");
		
		Оповестить("ЗаполнитьЗаписьНаРемонт", ПараметрКоманды, ПараметрыВыполненияКоманды.Источник);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти