///////////////////////////////////////////////////////////////////////////////
// Модуль формы справочника "Значимые события"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Процедура-обработчик события "ПриСозданииНаСервере" Формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Источник") Тогда
		Источник = Параметры.Источник;
	КонецЕсли;
	
	ДеревоПолей = РеквизитФормыВЗначение("Поля");
	ДеревоПолей = ЗначимыеСобытия.ПолучитьДеревоМетаданныхОбъекта(Источник,,Ложь);
	ЗначениеВРеквизитФормы(ДеревоПолей, "Поля");
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура-обработчик события "Выбор" таблицы "Поля"
//
&НаКлиенте
Процедура ПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Обрабатываем в зависимости от типа строки
	Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		Если Элементы.Поля.Развернут(ВыбраннаяСтрока) Тогда
			Элементы.Поля.Свернуть(ВыбраннаяСтрока);
		Иначе
			Элементы.Поля.Развернуть(ВыбраннаяСтрока);
		КонецЕсли;
	Иначе
		ОповеститьОВыборе(Элемент.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры // ПоляВыбор()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура-обработчик команды "Выбрать"
//
&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбраннаяСтрока = Элементы.Поля.ТекущаяСтрока;
	ТекущиеДанныеСтроки = Элементы.Поля.ТекущиеДанные;
	Если ТекущиеДанныеСтроки=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Вызываем обработчик события
	ПоляВыбор(Элементы.Поля, ВыбраннаяСтрока, Элементы.ПоляПоле, ЛОЖЬ);
	
КонецПроцедуры // Выбрать()

#КонецОбласти

