#Область ПрограммныйИнтерфейс

// Включает режим ожидания для поля табличного документа
//
// Параметры:
//  Поле - ПолеТабличногоДокумента - офомряемый элемент;
//  Текст - Строка - текст, который будет отображаться пользователю во время ожидания;
//  Картинка - Картинка - картинка, которая будет отображаться пользователю во время ожидания;
//
Процедура ВключитьРежимОжиданияПоляТабличногоДокумента(Поле, Текст = "", Картинка = Неопределено) Экспорт
	
	Если ПустаяСтрока(Текст) Тогда
		
		Текст = НСтр("ru = 'Обновление...'");
		
	КонецЕсли;
	
	Если Картинка = Неопределено Тогда
		
		Картинка = БиблиотекаКартинок.ДлительнаяОперация48;
		
	КонецЕсли;
	
	ОтображениеСостояния = Поле.ОтображениеСостояния;
	ОтображениеСостояния.Видимость = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Текст = Текст;
	ОтображениеСостояния.Картинка = Картинка;
	
КонецПроцедуры

// Выключает режим ожидания для поля табличного документа
//
// Параметры:
//  Поле - ПолеТабличногоДокумента - офомряемый элемент;
//
Процедура ВыключитьРежимОжиданияПоляТабличногоДокумента(Поле) Экспорт
	
	ОтображениеСостояния = Поле.ОтображениеСостояния;
	ОтображениеСостояния.Видимость = Ложь;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	
КонецПроцедуры

#КонецОбласти