#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ЗаказПокупателя = ПолучитьЗначениеДокументаОснования(ПараметрКоманды);
	
	Если ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ЗаказПокупателя",				ЗаказПокупателя);
		Отбор.Вставить("СостояниеГотовКОтгрузке",       Истина);
		Отбор.Вставить("СостояниеОжидаетПоставки",      Истина);
		Отбор.Вставить("СостояниеТребуетсяОбеспечение", Истина);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Отбор", Отбор);
		
		СостояниеОбеспеченияКлиент.ОткрытьСостояниеОбеспечения(ПараметрКоманды, ПараметрыОткрытия);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьЗначениеДокументаОснования(Ссылка)
	Возврат Ссылка.ДокументОснование;
КонецФункции

#КонецОбласти