// Модуль менеджера регистра сведений "Прайс-листы контрагентов скидки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДополнитьСкидкамиПрайЛиста(ПрайсЛист, ТегиПроизводители, НаДату = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТегиИПроизводители.ПрайсЛист КАК ПрайсЛист,
	|	ТегиИПроизводители.ТегПозиции КАК ТегПозиции,
	|	ТегиИПроизводители.Производитель КАК Производитель
	|ПОМЕСТИТЬ ВТ_ТегиИПроизводители
	|ИЗ
	|	&ТегиИПроизводители КАК ТегиИПроизводители
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТегПозиции,
	|	Производитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентовСкидкиСрезПоследних.ТегПозиции КАК ТегПозиции,
	|	ПрайсЛистыКонтрагентовСкидкиСрезПоследних.Производитель КАК Производитель,
	|	ПрайсЛистыКонтрагентовСкидкиСрезПоследних.Скидка КАК СтарыйПроцент
	|ПОМЕСТИТЬ Цены
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовСкидки.СрезПоследних(
	|			&НаДату,
	|			ПрайсЛист = &ПрайсЛист
	|				И (ТегПозиции, Производитель) В
	|					(ВЫБРАТЬ
	|						ВТ_ТегиИПроизводители.ТегПозиции,
	|						ВТ_ТегиИПроизводители.Производитель
	|					ИЗ
	|						ВТ_ТегиИПроизводители КАК ВТ_ТегиИПроизводители)) КАК ПрайсЛистыКонтрагентовСкидкиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТегПозиции,
	|	Производитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТегиИПроизводители.ПрайсЛист,
	|	ВТ_ТегиИПроизводители.ТегПозиции,
	|	ВТ_ТегиИПроизводители.Производитель,
	|	ЕСТЬNULL(Цены.СтарыйПроцент, 0) КАК СтарыйПроцент
	|ИЗ
	|	ВТ_ТегиИПроизводители КАК ВТ_ТегиИПроизводители
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	|		ПО ВТ_ТегиИПроизводители.ТегПозиции = Цены.ТегПозиции
	|			И ВТ_ТегиИПроизводители.Производитель = Цены.Производитель";
	
	Запрос.УстановитьПараметр("ТегиИПроизводители" , ТегиПроизводители);
	Запрос.УстановитьПараметр("НаДату"             , НаДату);
	Запрос.УстановитьПараметр("ПрайсЛист"          , ПрайсЛист);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли