// Общая форма "Дополнительная форма объекта комментарий"

#Область ОбработчикиСобытийФормы

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
		
	// Производим заполнение данных формы на основании переданного объекта
	Если ТипЗнч(Параметры.Объект)=Тип("ДанныеФормыСтруктура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.Объект);
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.Ссылка);
	КонецЕсли;
	
	ФормаОбъекта = (ТипЗнч(Параметры.Объект)=Тип("ДанныеФормыСтруктура")); 
	
	Если Параметры.Свойство("УникальныйИдентификатор") Тогда
		ПередаваемыйУникальныйИдентификатор = Параметры.УникальныйИдентификатор;
	Иначе
		ПередаваемыйУникальныйИдентификатор = УникальныйИдентификатор;
	КонецЕсли;
	
	// Проверим блокировку редактирования объекта другим пользователем.
	ТолькоПросмотр = УправлениеДиалогомСервер.ПроверитьЗапретРедактированияДанных(Параметры.Ссылка, ПередаваемыйУникальныйИдентификатор);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик события нажатия кнопки "Подбор номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Применить(Команда)
	
	Результат = Новый Структура();
	Результат.Вставить("Комментарий", Комментарий);
	
	Если ФормаОбъекта И НЕ ВладелецФормы.ТолькоПросмотр Тогда
		ВладелецФормы.Модифицированность = Истина;
	КонецЕсли;
	
	Закрыть(Результат);
		
КонецПроцедуры // Применить()

#КонецОбласти