#Область ПрограммныйИнтерфейс

// Формирует данные о цене автомобиля из документа "ИзменениеЦенАвтомобилей", связанного с текущим документом.
//
// Параметры:
//  Документ - ДокументСссылка - документ, для которого формируются данные.
//
// Возвращаемое значение:
//  Структура - сформированные данные;
//  Неопределено - если документ "ИзменениеЦенАвтомобилей"не найден.
//
Функция ПолучитьДокументСогласованияЦены(Документ) Экспорт
	
	ИмяОбработки = "а6ХранилищеЗащищеннойОбработки.а6ПараметрыЛицензирования.ЗащитаАвтомобилиСПробегом";
	Возврат ЗащищенныеФункцииСервер
		.ПолучитьЗащищеннуюОбработку(ИмяОбработки)
		.ПолучитьДокументСогласованияЦены(Документ);
	
КонецФункции

#КонецОбласти