
#Область ПрограммныйИнтерфейс

// Возвращает режима поиска идентификатора клиента
// 
// Возвращаемое значение:
//  Структура - 
//
Функция РежимыПоискаИдентификатораКлиента() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ИдентификаторКлиента", "ИдентификаторКлиента");
	Результат.Вставить("ИдентификаторКлиентаСДопПоиском", "ИдентификаторКлиентаСДопПоиском");
	Результат.Вставить("ИмяКомпьютераИИмяПользователя", "ИмяКомпьютераИИмяПользователя");
	Результат.Вставить("ИмяКомпьютера", "ИмяКомпьютера");
	Возврат Результат;
	
КонецФункции

// Возвращает режима поиска идентификатора клиента
// 
// Возвращаемое значение:
//  Структура - 
//
Функция РежимыПоискаИдентификатораКлиентаПодробности() Экспорт
	
	РежимыПоискаИдентификатораКлиента = РежимыПоискаИдентификатораКлиента();
	
	Результат = Новый Структура();
	
	Описание = Новый Структура();
	Описание.Вставить("Представление", НСтр("ru = 'Стандартный режим'"));
	Описание.Вставить("Подсказка", НСтр("ru = 'Идентификатор генерируется средствами платформы. Зависит от параметров системы. Если не удалось найти рабочее место по такому идентификатору, выполняется поиск по МАС-адресу и/или имени компьютера.'"));
	Результат.Вставить(РежимыПоискаИдентификатораКлиента.ИдентификаторКлиента, Описание);
	
	Описание = Новый Структура();
	Описание.Вставить("Представление", НСтр("ru = 'Стандартный режим с поиском по наименованию'"));
	Описание.Вставить("Подсказка", НСтр("ru = 'Идентификатор генерируется средствами платформы. Зависит от параметров системы. Если не удалось найти рабочее место в стандартном режиме, выполняется поиск по наименованию в формате Имя пользователя(Имя компьютера). Если таких рабочих мест несколько - берется первое найденное.'"));
	Результат.Вставить(РежимыПоискаИдентификатораКлиента.ИдентификаторКлиентаСДопПоиском, Описание);
	
	Описание = Новый Структура();
	Описание.Вставить("Представление", НСтр("ru = 'Имя компьютера и имя пользователя'"));
	Описание.Вставить("Подсказка", НСтр("ru = 'Идентификатор формируется из имени компьютера и имени пользователя. Поиск осуществляется по идентификатору.'"));
	Результат.Вставить(РежимыПоискаИдентификатораКлиента.ИмяКомпьютераИИмяПользователя, Описание);
	
	Описание = Новый Структура();
	Описание.Вставить("Представление", НСтр("ru = 'Имя компьютера'"));
	Описание.Вставить("Подсказка", НСтр("ru = 'Идентификатор формируется из имени компьютера. Поиск осуществляется по идентификатору.'"));
	Результат.Вставить(РежимыПоискаИдентификатораКлиента.ИмяКомпьютера, Описание);
	Возврат Результат;
	
КонецФункции

#КонецОбласти