////////////////////////////////////////////////////////////////////////////////
// Общий модуль "Утверждение документов (вызов сервера)"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Получает статусы документа с учетом текущего статуса.
//
// Параметры:
//  Документ - ДокументСсылка - Документ, для которого получаются статусы
//  ПолноеИмяОбъекта - Строка - Имя документа
//  ЗаполнятьДоступные - Булево - Заполнять коллекцию доступных статусов
//  ЗаполнятьВозможные - Булево - Заполнять коллекцию ваозможных статусов
//
// Возвращаемое значение:
//   Структура - Статусы для документа:
//   * Все - Соответствие - Все статусы утверждения
//   * Доступные - СписокЗначений - Доступные статусы утверждения
//   * Возможные - СписокЗначений - Возможные статусы утверждения
//
Функция СтатусыДокумента(Документ, ПолноеИмяОбъекта, ЗаполнятьДоступные=Истина, ЗаполнятьВозможные=Истина) Экспорт
	
	Возврат УтверждениеДокументовСервер.СтатусыДокумента(Документ, ПолноеИмяОбъекта, ЗаполнятьДоступные, ЗаполнятьВозможные);
	
КонецФункции

Процедура ОбработкаКомандыФормы(Форма, ИмяКоманды, Документ) Экспорт
	
	УтверждениеДокументовСервер.ОбработкаКомандыФормы(Форма, ИмяКоманды, Документ);
	
КонецПроцедуры

Процедура УстановитьДоступностьФормыДляРедактирования(Форма, Документ, ИзменениеЗапрещено = Неопределено) Экспорт
	
	Если ИзменениеЗапрещено = Неопределено Тогда
		ИзменениеЗапрещено = Форма.ТолькоПросмотр;
	Иначе
		ИзменениеЗапрещено = ИзменениеЗапрещено ИЛИ Форма.ТолькоПросмотр;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		УтверждениеДокументовСервер.УстановитьДоступностьФормыДляРедактирования(Форма, ИзменениеЗапрещено, Документ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти