
#Область ОбработчикиСобытий 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НеПроведен(ПараметрКоманды) Тогда
		
		ПоказатьПредупреждение(, СообщениеОНеобходимостиПроведения());
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Основание,Команда", ПараметрКоманды, "ОплатитьЧерезКассу");
	ОткрытьФорму(
		"Документ.ЧекНаОплату.ФормаОбъекта",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник
	);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НеПроведен(Документ)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Проведен, Состояние");
	ПровестиДокумент = Не (ЗначенияРеквизитов.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Заявка
		Или ЗначенияРеквизитов.Состояние = Справочники.ВидыСостоянийЗаказНарядов.ВРаботе);
		
	Возврат Не (Не ПровестиДокумент ИЛИ ПровестиДокумент И ЗначенияРеквизитов.Проведен);
	
КонецФункции

&НаКлиенте
Функция СообщениеОНеобходимостиПроведения()
	
	Возврат НСтр("ru = 'Для выполнения оплаты документ должен быть проведен'");
	
КонецФункции

#КонецОбласти
