#Область ПрограммныйИнтерфейс

// Возвращает признак активности обособленного учета товаров по организациям
// 
// Параметры:
//  Дата - Дата
// 
// Возвращаемое значение:
//  Булево
Функция ОбособленныйУчетТоваровПоОрганизациям(Дата = Неопределено) Экспорт
	
	Возврат ЗапасыТоваров.ОбособленныйУчетТоваровПоОрганизациям(Дата);

КонецФункции

// Возвращает признак установки режима контроля остатков на складах "По компании"
//
// Возвращаемое значение:
//  Булево - Истина, если установлен режим контроля остатков на складах "По компании", Ложь в противном случае.
//
Функция РежимКонтроляОстатковНаСкладахПоКомпании() Экспорт
	
	Возврат ЗапасыТоваров.РежимКонтроляОстатковНаСкладахПоКомпании();
	
КонецФункции

#КонецОбласти