///////////////////////////////////////////////////////////////////////////////////////////////////////
// Расширение подсистемы БСП "Печать"
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзБСП

// см. УправлениеПечатьюПереопределяемый.ПриОпределенииНастроекПечати
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПроверкаПроведенияПередПечатью = Не ПраваИНастройкиПользователя.Значение("ПечатьНепроведенных");
	СписокОбъектов = Настройки.ОбъектыПечати;
	
	// Справочники
	СписокОбъектов.Добавить(Справочники.Карточки);
	СписокОбъектов.Добавить(Справочники.Контрагенты);
	СписокОбъектов.Добавить(Справочники.НастройкаПечатиКомплекта);
	СписокОбъектов.Добавить(Справочники.Номенклатура);
	СписокОбъектов.Добавить(Справочники.ПодтверждающиеДокументы);
	СписокОбъектов.Добавить(Справочники.СкладыКомпании);
	СписокОбъектов.Добавить(Справочники.Сотрудники);
	СписокОбъектов.Добавить(Справочники.ПрочиеАктивы);
	СписокОбъектов.Добавить(Справочники.Автоработы);
	СписокОбъектов.Добавить(Справочники.Автомобили);
	СписокОбъектов.Добавить(Справочники.ДоговорыВзаиморасчетов);
	
	// Документы
	СписокОбъектов.Добавить(Документы.АвансовыйОтчет);
	СписокОбъектов.Добавить(Документы.АктОценкиАвтомобиля);
	СписокОбъектов.Добавить(Документы.АктПриемаПередачиЦенныхБумаг);
	СписокОбъектов.Добавить(Документы.АктРазногласий);
	СписокОбъектов.Добавить(Документы.АктСверкиВзаиморасчетов);
	СписокОбъектов.Добавить(Документы.Амортизация);
	СписокОбъектов.Добавить(Документы.БюджетДДС);
	СписокОбъектов.Добавить(Документы.БюджетДоходовИРасходов);
	СписокОбъектов.Добавить(Документы.БюджетЗакупок);
	СписокОбъектов.Добавить(Документы.БюджетЗакупокАвтомобилей);
	СписокОбъектов.Добавить(Документы.БюджетОказанияУслугПоАвтоработам);
	СписокОбъектов.Добавить(Документы.БюджетПродаж);
	СписокОбъектов.Добавить(Документы.БюджетПродажАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводВЭксплуатацию);
	СписокОбъектов.Добавить(Документы.ВводВЭксплуатациюАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводОстатковАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводОстатковВзаиморасчетов);
	СписокОбъектов.Добавить(Документы.ВводОстатковНакопительныхСумм);
	СписокОбъектов.Добавить(Документы.ВводОстатковПрочихАктивов);
	СписокОбъектов.Добавить(Документы.ВводОстатковТоваров);
	СписокОбъектов.Добавить(Документы.ВводОстатковТоваровВПроизводстве);
	СписокОбъектов.Добавить(Документы.Взаимозачет);
	СписокОбъектов.Добавить(Документы.ВозвратОтПокупателя);
	СписокОбъектов.Добавить(Документы.ВозвратОтПокупателяАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВозвратПоставщику);
	СписокОбъектов.Добавить(Документы.ВозвратПоставщикуАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВыводИзЭксплуатацииАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВыводИзОборотаКодовМаркировки);
	СписокОбъектов.Добавить(Документы.Выписка);
	СписокОбъектов.Добавить(Документы.ВыплатаЗарплаты);
	СписокОбъектов.Добавить(Документы.ДефектовочнаяВедомость);
	СписокОбъектов.Добавить(Документы.ДоговорАренды);
	СписокОбъектов.Добавить(Документы.ЖалобаКлиента);
	СписокОбъектов.Добавить(Документы.ЗаказВнутренний);
	СписокОбъектов.Добавить(Документы.ЗаказКодовМаркировки);
	СписокОбъектов.Добавить(Документы.ЗаказНаАвтомобиль);
	СписокОбъектов.Добавить(Документы.ЗаказНаряд);
	СписокОбъектов.Добавить(Документы.ЗаказПокупателя);
	СписокОбъектов.Добавить(Документы.ЗаказПоставщику);
	СписокОбъектов.Добавить(Документы.ЗаказПоставщикуНаАвтомобиль);
	СписокОбъектов.Добавить(Документы.ЗакрытиеПериода);
	СписокОбъектов.Добавить(Документы.ЗакрытиеСмены);
	СписокОбъектов.Добавить(Документы.ЗаменаВЗаказеПокупателя);
	СписокОбъектов.Добавить(Документы.ЗаменаВЗаказеПоставщику);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаАренду);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаРасходДС);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаРемонт);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаХранениеШин);
	СписокОбъектов.Добавить(Документы.ИзвлечениеТоваровИзПроизводства);
	СписокОбъектов.Добавить(Документы.Инкассация);
	СписокОбъектов.Добавить(Документы.ИнвентаризацияОрдерногоСклада);
	СписокОбъектов.Добавить(Документы.ИнвентаризацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.Инвентаризация);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенОпций);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенАвторабот);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенАвтомобилей);
	СписокОбъектов.Добавить(Документы.ИзменениеЦен);
	СписокОбъектов.Добавить(Документы.ИзменениеДоговораАренды);
	СписокОбъектов.Добавить(Документы.ИзменениеАссортиментаПодразделения);
	СписокОбъектов.Добавить(Документы.КорректировкаРеализацииАвтомобилей);
	СписокОбъектов.Добавить(Документы.КорректировкаРеализации);
	СписокОбъектов.Добавить(Документы.КорректировкаПоступленияАвтомобилей);
	СписокОбъектов.Добавить(Документы.КорректировкаПоступления);
	СписокОбъектов.Добавить(Документы.КорректировкаОпцийАвтомобиля);
	СписокОбъектов.Добавить(Документы.КорректировкаЗаказаПоставщику);
	СписокОбъектов.Добавить(Документы.КорректировкаЗаказаПокупателя);
	СписокОбъектов.Добавить(Документы.КорректировкаДолга);
	СписокОбъектов.Добавить(Документы.КорректировкаДвижений);
	СписокОбъектов.Добавить(Документы.Комплектация);
	СписокОбъектов.Добавить(Документы.НачислениеЗарплаты);
	СписокОбъектов.Добавить(Документы.НазначениеСкидокШапки);
	СписокОбъектов.Добавить(Документы.НазначениеСкидокСтроки);
	СписокОбъектов.Добавить(Документы.ОптовыйЗаказКлиентаНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОптовыйЗаказПоставщикуНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомитентуЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомитенту);
	СписокОбъектов.Добавить(Документы.ОтчетКомиссионераЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомиссионера);
	СписокОбъектов.Добавить(Документы.ОтчетПрослеживаемыеТоварыОтчетОбОперациях);
	СписокОбъектов.Добавить(Документы.ОбслуживаниеАктива);
	СписокОбъектов.Добавить(Документы.ПриходныйСкладскойОрдерНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ПриходныйСкладскойОрдер);
	СписокОбъектов.Добавить(Документы.ПриходныйКассовыйОрдер);
	СписокОбъектов.Добавить(Документы.ПоступлениеТоваров);
	СписокОбъектов.Добавить(Документы.ПоступлениеДопРасходов);
	СписокОбъектов.Добавить(Документы.ПоступлениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.ПлатежноеПоручение);
	СписокОбъектов.Добавить(Документы.ПланФакт);
	СписокОбъектов.Добавить(Документы.ПланПоступленияДС);
	СписокОбъектов.Добавить(Документы.ПересортицаТоваров);
	СписокОбъектов.Добавить(Документы.ПереразмещениеТоваров);
	СписокОбъектов.Добавить(Документы.ПереразмещениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.ПереоценкаАвтомобилей);
	СписокОбъектов.Добавить(Документы.Переоценка);
	СписокОбъектов.Добавить(Документы.ПеремещениеТоваровВПроизводство);
	СписокОбъектов.Добавить(Документы.ПеремещениеТоваров);
	СписокОбъектов.Добавить(Документы.ПеремещениеНезавершенногоПроизводства);
	СписокОбъектов.Добавить(Документы.ПеремещениеДенежныхСредств);
	СписокОбъектов.Добавить(Документы.ПеремещениеАктивов);
	СписокОбъектов.Добавить(Документы.ПеремещениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.ПеремещениеРезервов);
	СписокОбъектов.Добавить(Документы.РезервированиеЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.РезервированиеАвтомобилей);
	СписокОбъектов.Добавить(Документы.РеализацияТоваров);
	СписокОбъектов.Добавить(Документы.РеализацияАктивов);
	СписокОбъектов.Добавить(Документы.РеализацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.РасходныйСкладскойОрдерНаАвтомобили);
	СписокОбъектов.Добавить(Документы.РасходныйСкладскойОрдер);
	СписокОбъектов.Добавить(Документы.РасходныйКассовыйОрдер);
	СписокОбъектов.Добавить(Документы.Рассылка);
	СписокОбъектов.Добавить(Документы.РаспределениеЗаказаПокупателя);
	СписокОбъектов.Добавить(Документы.РазукомплектацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.Разукомплектация);
	СписокОбъектов.Добавить(Документы.РабочийЛист);
	СписокОбъектов.Добавить(Документы.Событие);
	СписокОбъектов.Добавить(Документы.СообщениеSMS);
	СписокОбъектов.Добавить(Документы.СчетФактураПолученный);
	СписокОбъектов.Добавить(Документы.СчетФактураВыданный);
	СписокОбъектов.Добавить(Документы.СчетОтПоставщикаЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.СчетОтПоставщика);
	СписокОбъектов.Добавить(Документы.СчетНаОплатуЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.СчетНаОплату);
	СписокОбъектов.Добавить(Документы.СтраховойПолис);
	СписокОбъектов.Добавить(Документы.СписаниеТоваров);
	СписокОбъектов.Добавить(Документы.СписаниеАктивов);
	СписокОбъектов.Добавить(Документы.СписаниеАвтомобилей);
	СписокОбъектов.Добавить(Документы.СнятиеРезервовЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.СнятиеРезервовАвтомобилей);
	СписокОбъектов.Добавить(Документы.СнятиеРаспределенияЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.СводныйРемонтныйЗаказ);
	СписокОбъектов.Добавить(Документы.ТестДрайв);
	СписокОбъектов.Добавить(Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.УведомлениеОВвозеПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.ЧекНаОплату);
	СписокОбъектов.Добавить(Документы.Чек);
	СписокОбъектов.Добавить(Документы.ЧекКоррекции);
	СписокОбъектов.Добавить(Документы.ЭлектронноеПисьмоВходящее);
	СписокОбъектов.Добавить(Документы.ЭлектронноеПисьмоИсходящее);
	СписокОбъектов.Добавить(Документы.ПередачаТоваровМеждуОрганизациями);
	
КонецПроцедуры

#КонецОбласти

// Определяет объекты конфигурации, в которых необходимо разместить кнопку ПараметрыДокумента
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов.
//
Процедура ПриОпределенииОбъектовСПараметрамиДокумента(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ПоступлениеТоваров);
	СписокОбъектов.Добавить(Документы.АвансовыйОтчет);
	СписокОбъектов.Добавить(Документы.АктОценкиАвтомобиля);
	СписокОбъектов.Добавить(Документы.АктПриемаПередачиЦенныхБумаг);
	СписокОбъектов.Добавить(Документы.АктРазногласий);
	СписокОбъектов.Добавить(Документы.АктСверкиВзаиморасчетов);
	СписокОбъектов.Добавить(Документы.Амортизация);
	СписокОбъектов.Добавить(Документы.БюджетДДС);
	СписокОбъектов.Добавить(Документы.БюджетДоходовИРасходов);
	СписокОбъектов.Добавить(Документы.БюджетЗакупок);
	СписокОбъектов.Добавить(Документы.БюджетЗакупокАвтомобилей);
	СписокОбъектов.Добавить(Документы.БюджетОказанияУслугПоАвтоработам);
	СписокОбъектов.Добавить(Документы.БюджетПродаж);
	СписокОбъектов.Добавить(Документы.БюджетПродажАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводВОборотКодовМаркировки);
	СписокОбъектов.Добавить(Документы.ВводВЭксплуатацию);
	СписокОбъектов.Добавить(Документы.ВводВЭксплуатациюАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводОстатковАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводОстатковВзаиморасчетов);
	СписокОбъектов.Добавить(Документы.ВводОстатковНакопительныхСумм);
	СписокОбъектов.Добавить(Документы.ВводОстатковПрочихАктивов);
	СписокОбъектов.Добавить(Документы.ВводОстатковТоваров);
	СписокОбъектов.Добавить(Документы.ВводОстатковТоваровВПроизводстве);
	СписокОбъектов.Добавить(Документы.Взаимозачет);
	СписокОбъектов.Добавить(Документы.ВозвратВОборотКодовМаркировки);
	СписокОбъектов.Добавить(Документы.ВозвратОтПокупателя);
	СписокОбъектов.Добавить(Документы.ВозвратОтПокупателяАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВозвратПоставщику);
	СписокОбъектов.Добавить(Документы.ВозвратПоставщикуАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВыводИзОборотаКодовМаркировки);
	СписокОбъектов.Добавить(Документы.ВыводИзЭксплуатацииАвтомобилей);
	СписокОбъектов.Добавить(Документы.Выписка);
	СписокОбъектов.Добавить(Документы.ВыплатаЗарплаты);
	СписокОбъектов.Добавить(Документы.ДефектовочнаяВедомость);
	СписокОбъектов.Добавить(Документы.ДоговорАренды);
	СписокОбъектов.Добавить(Документы.ЖалобаКлиента);
	СписокОбъектов.Добавить(Документы.ЗаказВнутренний);
	СписокОбъектов.Добавить(Документы.ЗаказКодовМаркировки);
	СписокОбъектов.Добавить(Документы.ЗаказНаАвтомобиль);
	СписокОбъектов.Добавить(Документы.ЗаказНаряд);
	СписокОбъектов.Добавить(Документы.ЗаказПокупателя);
	СписокОбъектов.Добавить(Документы.ЗаказПоставщику);
	СписокОбъектов.Добавить(Документы.ЗаказПоставщикуНаАвтомобиль);
	СписокОбъектов.Добавить(Документы.ЗакрытиеПериода);
	СписокОбъектов.Добавить(Документы.ЗакрытиеСмены);
	СписокОбъектов.Добавить(Документы.ЗаменаВЗаказеПокупателя);
	СписокОбъектов.Добавить(Документы.ЗаменаВЗаказеПоставщику);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаАренду);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаКомпенсациюПоМаркетинговойПрограмме);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаРасходДС);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаАвтомобиль);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаРемонт);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаХранениеШин);
	СписокОбъектов.Добавить(Документы.ИзвлечениеТоваровИзПроизводства);
	СписокОбъектов.Добавить(Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.ЧекНаОплату);
	СписокОбъектов.Добавить(Документы.Чек);
	СписокОбъектов.Добавить(Документы.ЧекКоррекции);
	СписокОбъектов.Добавить(Документы.ТестДрайв);
	СписокОбъектов.Добавить(Документы.ТаможеннаяДекларацияИмпорт);
	СписокОбъектов.Добавить(Документы.Табель);
	СписокОбъектов.Добавить(Документы.СчетФактураПолученный);
	СписокОбъектов.Добавить(Документы.СчетФактураВыданный);
	СписокОбъектов.Добавить(Документы.СчетОтПоставщикаЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.СчетОтПоставщика);
	СписокОбъектов.Добавить(Документы.СчетНаОплатуЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.СчетНаОплату);
	СписокОбъектов.Добавить(Документы.СтраховойПолис);
	СписокОбъектов.Добавить(Документы.СписаниеТоваров);
	СписокОбъектов.Добавить(Документы.СписаниеКодовМаркировки);
	СписокОбъектов.Добавить(Документы.СписаниеАктивов);
	СписокОбъектов.Добавить(Документы.СписаниеАвтомобилей);
	СписокОбъектов.Добавить(Документы.СнятиеРезервовЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.СнятиеРезервовАвтомобилей);
	СписокОбъектов.Добавить(Документы.СнятиеРаспределенияЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.СводныйРемонтныйЗаказ);
	СписокОбъектов.Добавить(Документы.РезервированиеЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.РезервированиеАвтомобилей);
	СписокОбъектов.Добавить(Документы.РеестрДокументов);
	СписокОбъектов.Добавить(Документы.РеализацияТоваров);
	СписокОбъектов.Добавить(Документы.РеализацияАктивов);
	СписокОбъектов.Добавить(Документы.РеализацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.РасходныйСкладскойОрдерНаАвтомобили);
	СписокОбъектов.Добавить(Документы.РасходныйСкладскойОрдер);
	СписокОбъектов.Добавить(Документы.РасходныйКассовыйОрдер);
	СписокОбъектов.Добавить(Документы.Событие);
	СписокОбъектов.Добавить(Документы.Рассылка);
	СписокОбъектов.Добавить(Документы.РаспределениеЗаказаПокупателя);
	СписокОбъектов.Добавить(Документы.РазукомплектацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.РабочийЛистОтделаСтрахования);
	СписокОбъектов.Добавить(Документы.Разукомплектация);
	СписокОбъектов.Добавить(Документы.РабочийЛистКредитногоОтдела);
	СписокОбъектов.Добавить(Документы.РабочийЛистВыкупаАвтомобиля);
	СписокОбъектов.Добавить(Документы.РабочийЛист);
	СписокОбъектов.Добавить(Документы.ПриходныйСкладскойОрдерНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ПриходныйСкладскойОрдер);
	СписокОбъектов.Добавить(Документы.ПриходныйКассовыйОрдер);
	СписокОбъектов.Добавить(Документы.ПоступлениеДопРасходов);
	СписокОбъектов.Добавить(Документы.ПоступлениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.ПлатежноеПоручение);
	СписокОбъектов.Добавить(Документы.ПланФакт);
	СписокОбъектов.Добавить(Документы.ПланПоступленияДС);
	СписокОбъектов.Добавить(Документы.ПересортицаТоваров);
	СписокОбъектов.Добавить(Документы.ПереразмещениеТоваров);
	СписокОбъектов.Добавить(Документы.ПереразмещениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.ПереоценкаВалютныхСредств);
	СписокОбъектов.Добавить(Документы.ПереоценкаАвтомобилей);
	СписокОбъектов.Добавить(Документы.Переоценка);
	СписокОбъектов.Добавить(Документы.ПереносИстории);
	СписокОбъектов.Добавить(Документы.ПеремещениеТоваровВПроизводство);
	СписокОбъектов.Добавить(Документы.ПеремещениеТоваров);
	СписокОбъектов.Добавить(Документы.ПеремещениеНезавершенногоПроизводства);
	СписокОбъектов.Добавить(Документы.ПеремещениеРезервов);
	СписокОбъектов.Добавить(Документы.ПеремещениеДенежныхСредств);
	СписокОбъектов.Добавить(Документы.ПеремещениеАктивов);
	СписокОбъектов.Добавить(Документы.ПеремещениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.Перемаркировка);
	СписокОбъектов.Добавить(Документы.ОптовыйЗаказКлиентаНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОптовыйЗаказПоставщикуНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомитентуЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомитенту);
	СписокОбъектов.Добавить(Документы.ОтчетКомиссионераЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомиссионера);
	СписокОбъектов.Добавить(Документы.ОбслуживаниеАктива);
	СписокОбъектов.Добавить(Документы.ОтгрузкаТоваровКодовМаркировки);
	СписокОбъектов.Добавить(Документы.НачислениеЗарплаты);
	СписокОбъектов.Добавить(Документы.НазначениеСкидокШапки);
	СписокОбъектов.Добавить(Документы.НазначениеСкидокСтроки);
	СписокОбъектов.Добавить(Документы.НазначениеСкидокНаценокПоПрайсЛисту);
	СписокОбъектов.Добавить(Документы.КорректировкаСтатусовКодовМаркировки);
	СписокОбъектов.Добавить(Документы.КорректировкаРеализацииАвтомобилей);
	СписокОбъектов.Добавить(Документы.КорректировкаРеализации);
	СписокОбъектов.Добавить(Документы.КорректировкаПоступленияАвтомобилей);
	СписокОбъектов.Добавить(Документы.КорректировкаПоступления);
	СписокОбъектов.Добавить(Документы.КорректировкаОпцийАвтомобиля);
	СписокОбъектов.Добавить(Документы.КорректировкаКомпенсацииПоМаркетинговойПрограмме);
	СписокОбъектов.Добавить(Документы.КорректировкаЗаказаПоставщику);
	СписокОбъектов.Добавить(Документы.КорректировкаЗаказаПокупателя);
	СписокОбъектов.Добавить(Документы.КорректировкаДолга);
	СписокОбъектов.Добавить(Документы.КорректировкаДвижений);
	СписокОбъектов.Добавить(Документы.КорректировкаБонусов);
	СписокОбъектов.Добавить(Документы.Комплектация);
	СписокОбъектов.Добавить(Документы.Инкассация);
	СписокОбъектов.Добавить(Документы.КассоваяСмена);
	СписокОбъектов.Добавить(Документы.ИнвентаризацияОрдерногоСклада);
	СписокОбъектов.Добавить(Документы.ИнвентаризацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.Инвентаризация);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенОпций);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенАренды);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенАвторабот);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенАвтомобилей);
	СписокОбъектов.Добавить(Документы.ИзменениеЦен);
	СписокОбъектов.Добавить(Документы.ИзменениеДоговораАренды);
	СписокОбъектов.Добавить(Документы.ИзменениеАссортиментаПодразделения);
	СписокОбъектов.Добавить(Документы.УведомлениеОВвозеПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.ОтчетПрослеживаемыеТоварыОтчетОбОперациях);
	СписокОбъектов.Добавить(Документы.СообщениеSMS);
	СписокОбъектов.Добавить(Документы.ЭлектронноеПисьмоВходящее);
	СписокОбъектов.Добавить(Документы.ЭлектронноеПисьмоИсходящее);
	СписокОбъектов.Добавить(Документы.ПередачаТоваровМеждуОрганизациями);
	СписокОбъектов.Добавить(Документы.ОтчетОНанесенииКодовМаркировки);
	
КонецПроцедуры

// Определяет объекты конфигурации, в которых необходимо разместить кнопку ПечатьРеестра
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов.
//
Процедура ПриОпределенииОбъектовСПечатьюРеестра(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ПоступлениеТоваров);
	СписокОбъектов.Добавить(Документы.АвансовыйОтчет);
	СписокОбъектов.Добавить(Документы.АктОценкиАвтомобиля);
	СписокОбъектов.Добавить(Документы.АктПриемаПередачиЦенныхБумаг);
	СписокОбъектов.Добавить(Документы.АктРазногласий);
	СписокОбъектов.Добавить(Документы.АктСверкиВзаиморасчетов);
	СписокОбъектов.Добавить(Документы.Амортизация);
	СписокОбъектов.Добавить(Документы.БюджетДДС);
	СписокОбъектов.Добавить(Документы.БюджетДоходовИРасходов);
	СписокОбъектов.Добавить(Документы.БюджетЗакупок);
	СписокОбъектов.Добавить(Документы.БюджетЗакупокАвтомобилей);
	СписокОбъектов.Добавить(Документы.БюджетОказанияУслугПоАвтоработам);
	СписокОбъектов.Добавить(Документы.БюджетПродаж);
	СписокОбъектов.Добавить(Документы.БюджетПродажАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводВОборотКодовМаркировки);
	СписокОбъектов.Добавить(Документы.ВводВЭксплуатацию);
	СписокОбъектов.Добавить(Документы.ВводВЭксплуатациюАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводОстатковАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводОстатковВзаиморасчетов);
	СписокОбъектов.Добавить(Документы.ВводОстатковНакопительныхСумм);
	СписокОбъектов.Добавить(Документы.ВводОстатковПрочихАктивов);
	СписокОбъектов.Добавить(Документы.ВводОстатковТоваров);
	СписокОбъектов.Добавить(Документы.ВводОстатковТоваровВПроизводстве);
	СписокОбъектов.Добавить(Документы.Взаимозачет);
	СписокОбъектов.Добавить(Документы.ВозвратВОборотКодовМаркировки);
	СписокОбъектов.Добавить(Документы.ВозвратОтПокупателя);
	СписокОбъектов.Добавить(Документы.ВозвратОтПокупателяАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВозвратПоставщику);
	СписокОбъектов.Добавить(Документы.ВозвратПоставщикуАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВыводИзОборотаКодовМаркировки);
	СписокОбъектов.Добавить(Документы.ВыводИзЭксплуатацииАвтомобилей);
	СписокОбъектов.Добавить(Документы.Выписка);
	СписокОбъектов.Добавить(Документы.ВыплатаЗарплаты);
	СписокОбъектов.Добавить(Документы.ДефектовочнаяВедомость);
	СписокОбъектов.Добавить(Документы.ДоговорАренды);
	СписокОбъектов.Добавить(Документы.ЖалобаКлиента);
	СписокОбъектов.Добавить(Документы.ЗаказВнутренний);
	СписокОбъектов.Добавить(Документы.ЗаказКодовМаркировки);
	СписокОбъектов.Добавить(Документы.ЗаказНаАвтомобиль);
	СписокОбъектов.Добавить(Документы.ЗаказНаряд);
	СписокОбъектов.Добавить(Документы.ЗаказПокупателя);
	СписокОбъектов.Добавить(Документы.ЗаказПоставщику);
	СписокОбъектов.Добавить(Документы.ЗаказПоставщикуНаАвтомобиль);
	СписокОбъектов.Добавить(Документы.ЗакрытиеПериода);
	СписокОбъектов.Добавить(Документы.ЗакрытиеСмены);
	СписокОбъектов.Добавить(Документы.ЗаменаВЗаказеПокупателя);
	СписокОбъектов.Добавить(Документы.ЗаменаВЗаказеПоставщику);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаАренду);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаКомпенсациюПоМаркетинговойПрограмме);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаРасходДС);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаАвтомобиль);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаРемонт);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаХранениеШин);
	СписокОбъектов.Добавить(Документы.ИзвлечениеТоваровИзПроизводства);
	СписокОбъектов.Добавить(Документы.УведомлениеОВвозеПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.ОтчетПрослеживаемыеТоварыОтчетОбОперациях);
	СписокОбъектов.Добавить(Документы.ЧекНаОплату);
	СписокОбъектов.Добавить(Документы.Чек);
	СписокОбъектов.Добавить(Документы.ЧекКоррекции);
	СписокОбъектов.Добавить(Документы.ТестДрайв);
	СписокОбъектов.Добавить(Документы.ТаможеннаяДекларацияИмпорт);
	СписокОбъектов.Добавить(Документы.Табель);
	СписокОбъектов.Добавить(Документы.СчетФактураПолученный);
	СписокОбъектов.Добавить(Документы.СчетФактураВыданный);
	СписокОбъектов.Добавить(Документы.СчетОтПоставщикаЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.СчетОтПоставщика);
	СписокОбъектов.Добавить(Документы.СчетНаОплатуЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.СчетНаОплату);
	СписокОбъектов.Добавить(Документы.СтраховойПолис);
	СписокОбъектов.Добавить(Документы.СписаниеТоваров);
	СписокОбъектов.Добавить(Документы.СписаниеКодовМаркировки);
	СписокОбъектов.Добавить(Документы.СписаниеАктивов);
	СписокОбъектов.Добавить(Документы.СписаниеАвтомобилей);
	СписокОбъектов.Добавить(Документы.СнятиеРезервовЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.СнятиеРезервовАвтомобилей);
	СписокОбъектов.Добавить(Документы.СнятиеРаспределенияЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.СводныйРемонтныйЗаказ);
	СписокОбъектов.Добавить(Документы.РезервированиеЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.РезервированиеАвтомобилей);
	СписокОбъектов.Добавить(Документы.РеестрДокументов);
	СписокОбъектов.Добавить(Документы.РеализацияТоваров);
	СписокОбъектов.Добавить(Документы.РеализацияАктивов);
	СписокОбъектов.Добавить(Документы.РеализацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.РасходныйСкладскойОрдерНаАвтомобили);
	СписокОбъектов.Добавить(Документы.РасходныйСкладскойОрдер);
	СписокОбъектов.Добавить(Документы.РасходныйКассовыйОрдер);
	СписокОбъектов.Добавить(Документы.Событие);
	СписокОбъектов.Добавить(Документы.Рассылка);
	СписокОбъектов.Добавить(Документы.РаспределениеЗаказаПокупателя);
	СписокОбъектов.Добавить(Документы.РазукомплектацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.РабочийЛистОтделаСтрахования);
	СписокОбъектов.Добавить(Документы.Разукомплектация);
	СписокОбъектов.Добавить(Документы.РабочийЛистКредитногоОтдела);
	СписокОбъектов.Добавить(Документы.РабочийЛистВыкупаАвтомобиля);
	СписокОбъектов.Добавить(Документы.РабочийЛист);
	СписокОбъектов.Добавить(Документы.ПриходныйСкладскойОрдерНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ПриходныйСкладскойОрдер);
	СписокОбъектов.Добавить(Документы.ПриходныйКассовыйОрдер);
	СписокОбъектов.Добавить(Документы.ПоступлениеДопРасходов);
	СписокОбъектов.Добавить(Документы.ПоступлениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.ПлатежноеПоручение);
	СписокОбъектов.Добавить(Документы.ПланФакт);
	СписокОбъектов.Добавить(Документы.ПланПоступленияДС);
	СписокОбъектов.Добавить(Документы.ПересортицаТоваров);
	СписокОбъектов.Добавить(Документы.ПереразмещениеТоваров);
	СписокОбъектов.Добавить(Документы.ПереразмещениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.ПереоценкаВалютныхСредств);
	СписокОбъектов.Добавить(Документы.ПереоценкаАвтомобилей);
	СписокОбъектов.Добавить(Документы.Переоценка);
	СписокОбъектов.Добавить(Документы.ПереносИстории);
	СписокОбъектов.Добавить(Документы.ПеремещениеТоваровВПроизводство);
	СписокОбъектов.Добавить(Документы.ПеремещениеТоваров);
	СписокОбъектов.Добавить(Документы.ПеремещениеНезавершенногоПроизводства);
	СписокОбъектов.Добавить(Документы.ПеремещениеРезервов);
	СписокОбъектов.Добавить(Документы.ПеремещениеДенежныхСредств);
	СписокОбъектов.Добавить(Документы.ПеремещениеАктивов);
	СписокОбъектов.Добавить(Документы.ПеремещениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.Перемаркировка);
	СписокОбъектов.Добавить(Документы.ОптовыйЗаказКлиентаНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОптовыйЗаказПоставщикуНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомитентуЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомитенту);
	СписокОбъектов.Добавить(Документы.ОтчетКомиссионераЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомиссионера);
	СписокОбъектов.Добавить(Документы.ОбслуживаниеАктива);
	СписокОбъектов.Добавить(Документы.ОтгрузкаТоваровКодовМаркировки);
	СписокОбъектов.Добавить(Документы.НачислениеЗарплаты);
	СписокОбъектов.Добавить(Документы.НазначениеСкидокШапки);
	СписокОбъектов.Добавить(Документы.НазначениеСкидокСтроки);
	СписокОбъектов.Добавить(Документы.НазначениеСкидокНаценокПоПрайсЛисту);
	СписокОбъектов.Добавить(Документы.КорректировкаСтатусовКодовМаркировки);
	СписокОбъектов.Добавить(Документы.КорректировкаРеализацииАвтомобилей);
	СписокОбъектов.Добавить(Документы.КорректировкаРеализации);
	СписокОбъектов.Добавить(Документы.КорректировкаПоступленияАвтомобилей);
	СписокОбъектов.Добавить(Документы.КорректировкаПоступления);
	СписокОбъектов.Добавить(Документы.КорректировкаОпцийАвтомобиля);
	СписокОбъектов.Добавить(Документы.КорректировкаКомпенсацииПоМаркетинговойПрограмме);
	СписокОбъектов.Добавить(Документы.КорректировкаЗаказаПоставщику);
	СписокОбъектов.Добавить(Документы.КорректировкаЗаказаПокупателя);
	СписокОбъектов.Добавить(Документы.КорректировкаДолга);
	СписокОбъектов.Добавить(Документы.КорректировкаДвижений);
	СписокОбъектов.Добавить(Документы.КорректировкаБонусов);
	СписокОбъектов.Добавить(Документы.Комплектация);
	СписокОбъектов.Добавить(Документы.Инкассация);
	СписокОбъектов.Добавить(Документы.КассоваяСмена);
	СписокОбъектов.Добавить(Документы.ИнвентаризацияОрдерногоСклада);
	СписокОбъектов.Добавить(Документы.ИнвентаризацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.Инвентаризация);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенОпций);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенАренды);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенАвторабот);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенАвтомобилей);
	СписокОбъектов.Добавить(Документы.ИзменениеЦен);
	СписокОбъектов.Добавить(Документы.ИзменениеДоговораАренды);
	СписокОбъектов.Добавить(Документы.ИзменениеАссортиментаПодразделения);
	СписокОбъектов.Добавить(Документы.ПередачаТоваровМеждуОрганизациями);
	СписокОбъектов.Добавить(Документы.ОтчетОНанесенииКодовМаркировки);
	//
	СписокОбъектов.Добавить(ЖурналыДокументов.Автосалон);
	СписокОбъектов.Добавить(ЖурналыДокументов.Бюджетирование);
	СписокОбъектов.Добавить(ЖурналыДокументов.ДокументыКодовМаркировки);
	СписокОбъектов.Добавить(ЖурналыДокументов.ЖурналКладовщика);
	СписокОбъектов.Добавить(ЖурналыДокументов.ЗаказНаряд);
	СписокОбъектов.Добавить(ЖурналыДокументов.ЗаказыИРезервы);
	СписокОбъектов.Добавить(ЖурналыДокументов.КассовыеОрдера);
	СписокОбъектов.Добавить(ЖурналыДокументов.ОбслуживаниеАвтомобиля);
	СписокОбъектов.Добавить(ЖурналыДокументов.Покупатели);
	СписокОбъектов.Добавить(ЖурналыДокументов.Поставщики);
	СписокОбъектов.Добавить(ЖурналыДокументов.ПрочиеАктивы);
	СписокОбъектов.Добавить(ЖурналыДокументов.РасчетыПоЗарплате);
	СписокОбъектов.Добавить(ЖурналыДокументов.СкладскиеАкты);
	СписокОбъектов.Добавить(ЖурналыДокументов.ТоварныеДокументы);
	СписокОбъектов.Добавить(ЖурналыДокументов.СкладскиеОрдера);
	//
	СписокОбъектов.Добавить(Справочники.Контрагенты);
	СписокОбъектов.Добавить(Справочники.Номенклатура);
	СписокОбъектов.Добавить(Справочники.КодыОперацийПрослеживаемости);
	СписокОбъектов.Добавить(Справочники.СкладыКомпании);
	
КонецПроцедуры

// Определяет объекты конфигурации, в которых необходимо разместить кнопку ПечатьКомплектов
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов.
//
Процедура ПриОпределенииОбъектовСПечатьюКомплектов(СписокОбъектов) Экспорт
	
	// Документы
	СписокОбъектов.Добавить(Документы.АвансовыйОтчет);
	СписокОбъектов.Добавить(Документы.АктОценкиАвтомобиля);
	СписокОбъектов.Добавить(Документы.АктПриемаПередачиЦенныхБумаг);
	СписокОбъектов.Добавить(Документы.АктРазногласий);
	СписокОбъектов.Добавить(Документы.АктСверкиВзаиморасчетов);
	СписокОбъектов.Добавить(Документы.Амортизация);
	СписокОбъектов.Добавить(Документы.БюджетДДС);
	СписокОбъектов.Добавить(Документы.БюджетДоходовИРасходов);
	СписокОбъектов.Добавить(Документы.БюджетЗакупок);
	СписокОбъектов.Добавить(Документы.БюджетЗакупокАвтомобилей);
	СписокОбъектов.Добавить(Документы.БюджетОказанияУслугПоАвтоработам);
	СписокОбъектов.Добавить(Документы.БюджетПродаж);
	СписокОбъектов.Добавить(Документы.БюджетПродажАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводВЭксплуатацию);
	СписокОбъектов.Добавить(Документы.ВводВЭксплуатациюАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводОстатковАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВводОстатковВзаиморасчетов);
	СписокОбъектов.Добавить(Документы.ВводОстатковНакопительныхСумм);
	СписокОбъектов.Добавить(Документы.ВводОстатковПрочихАктивов);
	СписокОбъектов.Добавить(Документы.ВводОстатковТоваров);
	СписокОбъектов.Добавить(Документы.ВводОстатковТоваровВПроизводстве);
	СписокОбъектов.Добавить(Документы.Взаимозачет);
	СписокОбъектов.Добавить(Документы.ВозвратОтПокупателя);
	СписокОбъектов.Добавить(Документы.ВозвратОтПокупателяАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВозвратПоставщику);
	СписокОбъектов.Добавить(Документы.ВозвратПоставщикуАвтомобилей);
	СписокОбъектов.Добавить(Документы.ВыводИзОборотаКодовМаркировки);
	СписокОбъектов.Добавить(Документы.ВыводИзЭксплуатацииАвтомобилей);
	СписокОбъектов.Добавить(Документы.Выписка);
	СписокОбъектов.Добавить(Документы.ВыплатаЗарплаты);
	СписокОбъектов.Добавить(Документы.ДефектовочнаяВедомость);
	СписокОбъектов.Добавить(Документы.ДоговорАренды);
	СписокОбъектов.Добавить(Документы.ЖалобаКлиента);
	СписокОбъектов.Добавить(Документы.ЗаказВнутренний);
	СписокОбъектов.Добавить(Документы.ЗаказКодовМаркировки);
	СписокОбъектов.Добавить(Документы.ЗаказНаАвтомобиль);
	СписокОбъектов.Добавить(Документы.ЗаказНаряд);
	СписокОбъектов.Добавить(Документы.ЗаказПокупателя);
	СписокОбъектов.Добавить(Документы.ЗаказПоставщику);
	СписокОбъектов.Добавить(Документы.ЗаказПоставщикуНаАвтомобиль);
	СписокОбъектов.Добавить(Документы.ЗакрытиеПериода);
	СписокОбъектов.Добавить(Документы.ЗакрытиеСмены);
	СписокОбъектов.Добавить(Документы.ЗаменаВЗаказеПокупателя);
	СписокОбъектов.Добавить(Документы.ЗаменаВЗаказеПоставщику);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаАренду);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаРасходДС);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаРемонт);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаХранениеШин);
	СписокОбъектов.Добавить(Документы.ИзвлечениеТоваровИзПроизводства);
	СписокОбъектов.Добавить(Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.ЧекНаОплату);
	СписокОбъектов.Добавить(Документы.Чек);
	СписокОбъектов.Добавить(Документы.ЧекКоррекции);
	СписокОбъектов.Добавить(Документы.ТестДрайв);
	СписокОбъектов.Добавить(Документы.Табель);
	СписокОбъектов.Добавить(Документы.СчетФактураПолученный);
	СписокОбъектов.Добавить(Документы.СчетФактураВыданный);
	СписокОбъектов.Добавить(Документы.СчетОтПоставщикаЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.СчетОтПоставщика);
	СписокОбъектов.Добавить(Документы.СчетНаОплатуЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.СчетНаОплату);
	СписокОбъектов.Добавить(Документы.СтраховойПолис);
	СписокОбъектов.Добавить(Документы.СписаниеТоваров);
	СписокОбъектов.Добавить(Документы.СписаниеАктивов);
	СписокОбъектов.Добавить(Документы.СписаниеАвтомобилей);
	СписокОбъектов.Добавить(Документы.СнятиеРезервовЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.СнятиеРезервовАвтомобилей);
	СписокОбъектов.Добавить(Документы.СнятиеРаспределенияЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.СводныйРемонтныйЗаказ);
	СписокОбъектов.Добавить(Документы.РезервированиеЗаказовПокупателя);
	СписокОбъектов.Добавить(Документы.РезервированиеАвтомобилей);
	СписокОбъектов.Добавить(Документы.РеализацияТоваров);
	СписокОбъектов.Добавить(Документы.РеализацияАктивов);
	СписокОбъектов.Добавить(Документы.РеализацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.РасходныйСкладскойОрдерНаАвтомобили);
	СписокОбъектов.Добавить(Документы.РасходныйСкладскойОрдер);
	СписокОбъектов.Добавить(Документы.РасходныйКассовыйОрдер);
	СписокОбъектов.Добавить(Документы.Событие);
	СписокОбъектов.Добавить(Документы.Рассылка);
	СписокОбъектов.Добавить(Документы.РаспределениеЗаказаПокупателя);
	СписокОбъектов.Добавить(Документы.РазукомплектацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.Разукомплектация);
	СписокОбъектов.Добавить(Документы.РабочийЛист);
	СписокОбъектов.Добавить(Документы.ПоступлениеТоваров);
	СписокОбъектов.Добавить(Документы.ПриходныйСкладскойОрдерНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ПриходныйСкладскойОрдер);
	СписокОбъектов.Добавить(Документы.ПриходныйКассовыйОрдер);
	СписокОбъектов.Добавить(Документы.ПоступлениеДопРасходов);
	СписокОбъектов.Добавить(Документы.ПоступлениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.ПлатежноеПоручение);
	СписокОбъектов.Добавить(Документы.ПланФакт);
	СписокОбъектов.Добавить(Документы.ПланПоступленияДС);
	СписокОбъектов.Добавить(Документы.ПересортицаТоваров);
	СписокОбъектов.Добавить(Документы.ПереразмещениеТоваров);
	СписокОбъектов.Добавить(Документы.ПереразмещениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.ПереоценкаАвтомобилей);
	СписокОбъектов.Добавить(Документы.Переоценка);
	СписокОбъектов.Добавить(Документы.ПеремещениеТоваровВПроизводство);
	СписокОбъектов.Добавить(Документы.ПеремещениеТоваров);
	СписокОбъектов.Добавить(Документы.ПеремещениеНезавершенногоПроизводства);
	СписокОбъектов.Добавить(Документы.ПеремещениеРезервов);
	СписокОбъектов.Добавить(Документы.ПеремещениеДенежныхСредств);
	СписокОбъектов.Добавить(Документы.ПеремещениеАктивов);
	СписокОбъектов.Добавить(Документы.ПеремещениеАвтомобилей);
	СписокОбъектов.Добавить(Документы.ОптовыйЗаказКлиентаНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОптовыйЗаказПоставщикуНаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомитентуЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомитенту);
	СписокОбъектов.Добавить(Документы.ОтчетКомиссионераЗаАвтомобили);
	СписокОбъектов.Добавить(Документы.ОтчетКомиссионера);
	СписокОбъектов.Добавить(Документы.ОбслуживаниеАктива);
	СписокОбъектов.Добавить(Документы.НачислениеЗарплаты);
	СписокОбъектов.Добавить(Документы.НазначениеСкидокШапки);
	СписокОбъектов.Добавить(Документы.НазначениеСкидокСтроки);
	СписокОбъектов.Добавить(Документы.КорректировкаРеализацииАвтомобилей);
	СписокОбъектов.Добавить(Документы.КорректировкаРеализации);
	СписокОбъектов.Добавить(Документы.КорректировкаПоступленияАвтомобилей);
	СписокОбъектов.Добавить(Документы.КорректировкаПоступления);
	СписокОбъектов.Добавить(Документы.КорректировкаОпцийАвтомобиля);
	СписокОбъектов.Добавить(Документы.КорректировкаЗаказаПоставщику);
	СписокОбъектов.Добавить(Документы.КорректировкаЗаказаПокупателя);
	СписокОбъектов.Добавить(Документы.КорректировкаДолга);
	СписокОбъектов.Добавить(Документы.КорректировкаДвижений);
	СписокОбъектов.Добавить(Документы.Комплектация);
	СписокОбъектов.Добавить(Документы.Инкассация);
	СписокОбъектов.Добавить(Документы.ИнвентаризацияОрдерногоСклада);
	СписокОбъектов.Добавить(Документы.ИнвентаризацияАвтомобилей);
	СписокОбъектов.Добавить(Документы.Инвентаризация);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенОпций);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенАвторабот);
	СписокОбъектов.Добавить(Документы.ИзменениеЦенАвтомобилей);
	СписокОбъектов.Добавить(Документы.ИзменениеЦен);
	СписокОбъектов.Добавить(Документы.ИзменениеДоговораАренды);
	СписокОбъектов.Добавить(Документы.ИзменениеАссортиментаПодразделения);
	СписокОбъектов.Добавить(Документы.УведомлениеОВвозеПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров);
	СписокОбъектов.Добавить(Документы.ОтчетПрослеживаемыеТоварыОтчетОбОперациях);
	СписокОбъектов.Добавить(Документы.ПередачаТоваровМеждуОрганизациями);
	
	// Журналы документов
	СписокОбъектов.Добавить(ЖурналыДокументов.Автосалон);
	СписокОбъектов.Добавить(ЖурналыДокументов.Бюджетирование);
	СписокОбъектов.Добавить(ЖурналыДокументов.ДокументыКодовМаркировки);
	СписокОбъектов.Добавить(ЖурналыДокументов.ЖурналКладовщика);
	СписокОбъектов.Добавить(ЖурналыДокументов.ЗаказНаряд);
	СписокОбъектов.Добавить(ЖурналыДокументов.ЗаказыИРезервы);
	СписокОбъектов.Добавить(ЖурналыДокументов.КассовыеОрдера);
	СписокОбъектов.Добавить(ЖурналыДокументов.ОбслуживаниеАвтомобиля);
	СписокОбъектов.Добавить(ЖурналыДокументов.Покупатели);
	СписокОбъектов.Добавить(ЖурналыДокументов.Поставщики);
	СписокОбъектов.Добавить(ЖурналыДокументов.ПрочиеАктивы);
	СписокОбъектов.Добавить(ЖурналыДокументов.РасчетыПоЗарплате);
	СписокОбъектов.Добавить(ЖурналыДокументов.СкладскиеАкты);
	СписокОбъектов.Добавить(ЖурналыДокументов.ТоварныеДокументы);
	СписокОбъектов.Добавить(ЖурналыДокументов.СкладскиеОрдера);
	
КонецПроцедуры	

// Размещает команды печати на форме.
//
// Параметры:
//   Форма                            - УправляемаяФорма - форма, в которой необходимо разместить подменю Печать.
//   МестоРазмещенияКомандПоУмолчанию - ЭлементФормы - группа, в которую необходимо разместить подменю Печать,
//                                                     по умолчанию размещается в командную панель формы.
//   ОбъектыПечати                    - Массив - список объектов метаданных, для которых необходимо сформировать
//                                               объединенное подменю Печать.
Процедура ПриСозданииНаСервере(Форма, Знач МестоРазмещенияКомандПоУмолчанию = Неопределено, ОбъектыПечати = Неопределено) Экспорт // *РАРУС
	Если Форма.Команды.Найти("АдресНастроекКомандВоВременномХранилище") <> Неопределено Тогда
		Возврат; // Команды печати уже выведены при помощи механики подключаемых команд.
	КонецЕсли;
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ОбъектыПечати = Неопределено Тогда
		КомандыПечати = УправлениеПечатьюПовтИсп.КомандыПечатиФормы(ИмяФормы, ОбъектыПечати).Скопировать();
		Для НомерКоманды = -КомандыПечати.Количество() + 1 По 0 Цикл
			ОписаниеКомандыПечати = КомандыПечати[-НомерКоманды];
			ФункциональныеОпцииКомандыПечати = СтрРазделить(ОписаниеКомандыПечати.ФункциональныеОпции, ", ", Ложь);
			ВидимостьКоманды = ФункциональныеОпцииКомандыПечати.Количество() = 0;
			Для Каждого ФункциональнаяОпция Из ФункциональныеОпцииКомандыПечати Цикл
				Если ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
					ВидимостьКоманды = ВидимостьКоманды Или Форма.ПолучитьФункциональнуюОпциюФормы(ФункциональнаяОпция);
				Иначе
					ВидимостьКоманды = ВидимостьКоманды Или ПолучитьФункциональнуюОпцию(ФункциональнаяОпция);
				КонецЕсли;
				
				Если ВидимостьКоманды Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ОписаниеКомандыПечати.СкрытаФункциональнымиОпциями = Не ВидимостьКоманды;
		КонецЦикла;
	Иначе
		КомандыПечати = УправлениеПечатью.КомандыПечатиФормы(Форма, ОбъектыПечати).Скопировать();
	КонецЕсли;
	
	// +РАРУС
	КомандыПечати.Колонки.Добавить("ЭтоГруппа",          Новый ОписаниеТипов("Булево"));
	КомандыПечати.Колонки.Добавить("ВидГруппыПодменю",   Новый ОписаниеТипов("Булево"));
	КомандыПечати.Колонки.Добавить("ЭлементФормы",       Новый ОписаниеТипов("Строка"));
	КомандыПечати.Колонки.Добавить("НастройкаВидимости", Новый ОписаниеТипов("ХранилищеЗначения"));

	УправлениеПечатьюПлатформа.СоздатьГруппыКомандНаФорме(Форма, КомандыПечати, МестоРазмещенияКомандПоУмолчанию);
	// -РАРУС
	
	ТаблицаКоманд = КомандыПечати.Скопировать(,"МестоРазмещения");
	ТаблицаКоманд.Свернуть("МестоРазмещения");
	МестаРазмещения = ТаблицаКоманд.ВыгрузитьКолонку("МестоРазмещения");
	
	Для Каждого МестоРазмещения Из МестаРазмещения Цикл
		НайденныеКоманды = КомандыПечати.НайтиСтроки(Новый Структура("МестоРазмещения,СкрытаФункциональнымиОпциями,Отключена", МестоРазмещения, Ложь, Ложь));
		ЭлементФормыДляРазмещения = Форма.Элементы.Найти(МестоРазмещения);
		Если ЭлементФормыДляРазмещения = Неопределено Тогда
			ЭлементФормыДляРазмещения = МестоРазмещенияКомандПоУмолчанию;
		// +РАРУС
		Иначе
			// Необходимо опустить все добавленные группы в конец списка
			Форма.Элементы.Переместить(ЭлементФормыДляРазмещения, ЭлементФормыДляРазмещения.Родитель);
		// -РАРУС
		КонецЕсли;
		
		Если НайденныеКоманды.Количество() > 0 Тогда
			ДобавитьКомандыПечати(Форма, НайденныеКоманды, ЭлементФормыДляРазмещения);
		КонецЕсли;
	КонецЦикла;
	
	АдресКомандПечатиВоВременномХранилище = "АдресКомандПечатиВоВременномХранилище";
	КомандаФормы = Форма.Команды.Найти(АдресКомандПечатиВоВременномХранилище);
	Если КомандаФормы = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(АдресКомандПечатиВоВременномХранилище);
		КомандаФормы.Действие = ПоместитьВоВременноеХранилище(КомандыПечати, Форма.УникальныйИдентификатор);
	Иначе
		ОбщийСписокКомандПечатиФормы = ПолучитьИзВременногоХранилища(КомандаФормы.Действие);
		Для Каждого КомандаПечати Из КомандыПечати Цикл
			ЗаполнитьЗначенияСвойств(ОбщийСписокКомандПечатиФормы.Добавить(), КомандаПечати);
		КонецЦикла;
		КомандаФормы.Действие = ПоместитьВоВременноеХранилище(ОбщийСписокКомандПечатиФормы, Форма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

// Создает подменю "Печать" на форме и добавляет в него команды печати.
// Если команда печати одна, то вместо подменю добавляется кнопка с названием печатной формы.
Процедура ДобавитьКомандыПечати(Форма, КомандыПечати, Знач МестоРазмещенияКоманд = Неопределено)
	
	Если МестоРазмещенияКоманд = Неопределено Тогда
		МестоРазмещенияКоманд = Форма.КоманднаяПанель;
	КонецЕсли;
	
	ОднаКомандаПечати = КомандыПечати.Количество() = 1;
	// +РАРУС
	//Если МестоРазмещенияКоманд.Вид = ВидГруппыФормы.Подменю Тогда
	//	Если ОднаКомандаПечати Тогда
	//		МестоРазмещенияКоманд.Вид = ВидГруппыФормы.ГруппаКнопок;
	//	КонецЕсли;
	//Иначе
	//	Если Не ОднаКомандаПечати Тогда
	//		ПодменюПечать =
	//			Форма.Элементы.Добавить(МестоРазмещенияКоманд.Имя + "ПодменюПечать", Тип("ГруппаФормы"), МестоРазмещенияКоманд);
	//		ПодменюПечать.Вид = ВидГруппыФормы.Подменю;
	//		ПодменюПечать.Заголовок = НСтр("ru = 'Печать'");
	//		ПодменюПечать.Картинка = БиблиотекаКартинок.Печать;
	//		
	//		МестоРазмещенияКоманд = ПодменюПечать;
	//	КонецЕсли;
	//КонецЕсли;
	// -РАРУС
	
	Для Каждого ОписаниеКомандыПечати Из КомандыПечати Цикл
		НомерКоманды = ОписаниеКомандыПечати.Владелец().Индекс(ОписаниеКомандыПечати);
		ИмяКоманды = МестоРазмещенияКоманд.Имя + "КомандаПечати" + НомерКоманды;
		
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		// +РАРУС
		КомандаФормы.Действие = "Подключаемый_ОбработкаКомандыФормы";
		// -РАРУС
		КомандаФормы.Заголовок = ОписаниеКомандыПечати.Представление;
		КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
		КомандаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
		
		Если ЗначениеЗаполнено(ОписаниеКомандыПечати.Картинка) Тогда
			КомандаФормы.Картинка = ОписаниеКомандыПечати.Картинка;
		ИначеЕсли ОднаКомандаПечати Тогда
			КомандаФормы.Картинка = БиблиотекаКартинок.Печать;
		КонецЕсли;
		
		ОписаниеКомандыПечати.ИмяКомандыНаФорме = ИмяКоманды;
		
		// +РАРУС
		ОписаниеКомандыПечати.ЭлементФормы = ИмяКоманды;
		НовыйЭлемент = Форма.Элементы.Добавить(ОписаниеКомандыПечати.ЭлементФормы, Тип("КнопкаФормы"), МестоРазмещенияКоманд);
		// -РАРУС
		НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	КонецЦикла;
	
	// заглушка
	ИмяКоманды = МестоРазмещенияКоманд.Имя + "КомандаПечатиЗаглушка";
	
	КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
	КомандаФормы.Действие = "";
	КомандаФормы.Заголовок = НСтр("ru = '(нет печатных форм)'");
	КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
	КомандаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	НовыйЭлемент = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), МестоРазмещенияКоманд);
	НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	НовыйЭлемент.Видимость = Ложь;
	НовыйЭлемент.Доступность = Ложь;
	
КонецПроцедуры

// Задает область печати объекта в табличном документе. Необходимо использовать при выводе нескольких печатных форм
// в одном табличном документе для возможности печати комплектов документов, а также для возможности сохранения
// печатных форм в отдельных файлах.
// Необходимо вызывать после формирования каждой печатной формы в табличном документе.
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - печатная форма;
//  ПараметрыОбласти - Структура - координаты позиции начала и окончания очередной области в документе;
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  Ссылка - ЛюбаяСсылка - объект печати.
//
// Пример:
//  Пока ВыборкаПоДокументам.Следующий() Цикл
//    НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
//    // ... вывод печатной формы в табличный документ ...
//    УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, ПараметрыОбласти, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
//  КонецЦикла;
//
Процедура ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, ПараметрыОбласти, ОбъектыПечати, Ссылка) Экспорт
	
	Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка)) Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Недопустимое значение параметра ""Ссылка"",
			|ожидалось значение ссылочного типа, передано значение: ""%1"" (тип %2)'"), Ссылка, ТипЗнч(Ссылка));
		Попытка // Такая конструкция нужна для проброса стека в журнал регистрации.
			ВызватьИсключение ТекстСообщения;
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Печать'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		Возврат;
	КонецЕсли;
	
	Элемент = ОбъектыПечати.НайтиПоЗначению(Ссылка);
	Если Элемент = Неопределено Тогда
		ИмяОбласти = "Документ_" + Формат(ОбъектыПечати.Количество() + 1, "ЧН=; ЧГ=")
			+ "_Колонка" + Формат(ПараметрыОбласти.НомерКолонкиНачало, "ЧН=; ЧГ=");
		ОбъектыПечати.Добавить(Ссылка, ИмяОбласти);
	Иначе
		ИмяОбласти = Элемент.Представление;
	КонецЕсли;
	
	НомерСтрокиОкончание = ТабличныйДокумент.ВысотаТаблицы;
	
	ТабличныйДокумент.Область(
		ПараметрыОбласти.НомерСтрокиНачало,
		ПараметрыОбласти.НомерКолонкиНачало,
		НомерСтрокиОкончание,
		ПараметрыОбласти.НомерКолонкиОкончание).Имя = ИмяОбласти;
	
	Если Не УправлениеПечатью.НастройкиПечати().ИспользоватьПодписиИПечати Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Рисунок Из ТабличныйДокумент.Рисунки Цикл
		ЭтоПодписьИПечать = Ложь;
		Для Каждого ИмяОбластиСПодписьюИПечатью Из УправлениеПечатью.ПрефиксыИменОбластейСПодписьюИПечатью() Цикл
			Если СтрНайти(Рисунок.Имя, ИмяОбластиСПодписьюИПечатью) > 0 Тогда
				ЭтоПодписьИПечать = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ЭтоПодписьИПечать Тогда
			Продолжить;
		КонецЕсли;
		Если Рисунок.ТипРисунка = ТипРисункаТабличногоДокумента.Картинка И СтрНайти(Рисунок.Имя, "_Документ_") = 0 Тогда
			Рисунок.Имя = Рисунок.Имя + "_" + ИмяОбласти;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДублирующиеФаксимиле(ТабличныйДокумент,ОбъектыПечати, ДокументПечати, Организация) Экспорт
	// дублирующие факсимиле 
	// ПодписьИП - ПодписьРуководитель, ПодписьИП - ПодписьГлавныйБухгалтер, ПечатьОрганизации - ПечатьОрганизацииЗаПостащика
	
	Если Организация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоОсновноеФаксимиле = Организация.ФормаСобственности = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель;
	СуффиксРисунка = ПолучитьСуффикс(ОбъектыПечати, ДокументПечати); 
	ОчиститьДублирующиеФаксимиле(ТабличныйДокумент, СуффиксРисунка, "ПодписьРуководитель", "ПодписьИП", НЕ ЭтоОсновноеФаксимиле);
	ОчиститьДублирующиеФаксимиле(ТабличныйДокумент, СуффиксРисунка, "ПодписьГлавныйБухгалтер", "ПодписьИП",НЕ ЭтоОсновноеФаксимиле);
	
	ЭтоОсновноеФаксимиле = УправлениеПечатьюПлатформа.ПолучитьДокументыПоставщика(ДокументПечати);
	ОчиститьДублирующиеФаксимиле(ТабличныйДокумент, СуффиксРисунка, "ПечатьОрганизации", "ПечатьОрганизацииЗаПостащика", НЕ ЭтоОсновноеФаксимиле);
	
КонецПроцедуры

Функция ПолучитьСуффикс (ОбъектыПечати, ДокументПечати) 
	
	ДанныеСуффикса = ОбъектыПечати.НайтиПоЗначению(ДокументПечати);
	Возврат ДанныеСуффикса.Представление; 
	
КонецФункции  

Процедура ОчиститьДублирующиеФаксимиле (ТабличныйДокумент, СуффиксРисунка, ОсновноеФаксимиле, ДублирующееФаксимиле, ИспользоватьОсновноеФаксимиле)
	
	ИмяДублирующегоФаксимиле = СтрШаблон("%1_%2",ДублирующееФаксимиле, СуффиксРисунка);
	ИмяОсновногоФаксимиле = СтрШаблон("%1_%2",ОсновноеФаксимиле, СуффиксРисунка);
	
	ОбластьДублирующегоФаксимиле = ТабличныйДокумент.Области.Найти(ИмяДублирующегоФаксимиле);
	Если ОбластьДублирующегоФаксимиле = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьОсновноеФаксимиле Тогда
		ТабличныйДокумент.Рисунки.Удалить(ОбластьДублирующегоФаксимиле.Имя);
	Иначе
		ОбластьОсновногоФаксимиле = ТабличныйДокумент.Области.Найти(ИмяОсновногоФаксимиле);
		Если ОбластьОсновногоФаксимиле <> Неопределено Тогда
			ТабличныйДокумент.Рисунки.Удалить(ОбластьОсновногоФаксимиле.Имя);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры 

// см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
Процедура ДобавитьУсловиеВидимостиПоследнейКоманды(КомандыПечати, Реквизит, Значение = Неопределено, Знач ВидСравнения = Неопределено) Экспорт
	
	Если КомандыПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если КомандыПечати.Колонки.Найти("УсловияВидимости") = Неопределено Тогда
		КомандыПечати.Колонки.Добавить("УсловияВидимости", Новый ОписаниеТипов("Массив"));	
	КонецЕсли;
	
	ПоследняяКомандаПечати = КомандыПечати.Получить(КомандыПечати.Количество()-1);
	
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(ПоследняяКомандаПечати, Реквизит, Значение, ВидСравнения);
	
КонецПроцедуры

#КонецОбласти