#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено ИЛИ ПараметрКоманды.Пустая() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОтчетОтбор = Новый Структура;
	ОтчетОтбор.Вставить("Автомобиль", ПараметрКоманды);
	ОткрытьФорму(
		"Отчет.ОстаткиИОборотыАвтомобилей.Форма",
		Новый Структура("Отбор,КлючВарианта,СформироватьПриОткрытии", ОтчетОтбор, "ОстаткиИОборотыАвтомобиля", Истина),
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность
	);
	
КонецПроцедуры

#КонецОбласти