#Область ПрограммныйИнтерфейс  

// возвращает ссылку на ставку НДС
// Параметры: 
//	Ставка - Число - значение ставки 
//	РасчетнаяСтавка - Булево - признак расчетной ставки
//
// Возвращаемое значение:
//	СправочникСсылка.СтавкиНДС
//
функция СтавкаНДСПоЗначению(Ставка, РасчетнаяСтавка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Ставка = &Ставка
		|	И СтавкиНДС.РасчетнаяСтавка = &РасчетнаяСтавка
		|	И СтавкиНДС.Ссылка <> ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)";
	
	Запрос.УстановитьПараметр("РасчетнаяСтавка", РасчетнаяСтавка);
	Запрос.УстановитьПараметр("Ставка", Ставка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Справочники.СтавкиНДС.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить()[0].Ссылка;
	
КонецФункции

#КонецОбласти
