#Область ПрограммныйИнтерфейс

// См. ОбменСБанкамиКлиентПереопределяемый.РазобратьВыпискуБанка
Процедура РазобратьВыпискуБанка(СообщениеОбмена) Экспорт
	
	ДанныеВыписки = ОбменСБанкамиАльфаАвтоВызовСервера.ПолучитьДанныеВыпискиБанкаТекстовыйФормат(СообщениеОбмена);
	
	Если НЕ ЗначениеЗаполнено(ДанныеВыписки.СсылкаНаХранилище) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимПоУмолчанию",                "ЗагрузкаДокументов");
	ПараметрыОткрытия.Вставить("Организация",                     ДанныеВыписки.Организация);
	ПараметрыОткрытия.Вставить("ЭлектроннаяВыпискаБанка",         СообщениеОбмена);
	ПараметрыОткрытия.Вставить("СоглашениеПрямогоОбменаСБанками", ДанныеВыписки.НастройкаОбмена);
	ПараметрыОткрытия.Вставить("АдресФайлаВыписки",               ДанныеВыписки.СсылкаНаХранилище);
	Если ДанныеВыписки.МассивСчетов.Количество()>0 Тогда
		ПараметрыОткрытия.Вставить("БанковскийСчет",              ДанныеВыписки.МассивСчетов[0]);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.КлиентБанк.Форма", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти
