
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресСписка") И ЭтоАдресВременногоХранилища(Параметры.АдресСписка) Тогда
		
		ТаблицаВыбора.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресСписка));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВыбора

&НаКлиенте
Процедура ТаблицаВыбораВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Закрыть(ТаблицаВыбора.НайтиПоИдентификатору(Значение).Сделка);
	
КонецПроцедуры

#КонецОбласти

