///////////////////////////////////////////////////////////////////////////////
// Модуль формы списка регистра накоплений "Начисления сотрудникам по заказ-нарядам"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормой.НастроитьОсновнойДинамическийСписокФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// ОценкаПроизводительности
	Если Копирование Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("КопированиеРегистраНакопленияНачисленияСотрудникамПоЗаказНарядам");
	Иначе
		ОценкаПроизводительностиКлиент.ЗамерВремени("СозданиеРегистраНакопленияНачисленияСотрудникамПоЗаказНарядам");
	КонецЕсли;
	// Конец ОценкаПроизводительности
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеЗаписиРегистраНакопленияНачисленияСотрудникамПоЗаказНарядам");
	
КонецПроцедуры

#КонецОбласти