
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка И ЭтотОбъект.Количество() > 0 И ЗначениеЗаполнено(Отбор.Владелец.Значение) Тогда
		ЕстьОсновные = Ложь;
		Для Каждого Запись Из ЭтотОбъект Цикл
			ЕстьОсновные = ЕстьОсновные ИЛИ Запись.Основной;
		КонецЦикла;
		
		// нужно избавиться от других основных объектов
		Если ЕстьОсновные Тогда
			// Установим блокировку на запись данных
			СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрСведений", "КонтактныеЛица");
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("Владелец", Отбор.Владелец.Значение);
			
			ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки,, Отказ);
			
			НаборПоВладельцу = РегистрыСведений.КонтактныеЛица.СоздатьНаборЗаписей();
			НаборПоВладельцу.Отбор.Владелец.Установить(Отбор.Владелец.Значение);
			
			НаборПоВладельцу.Прочитать();
			
			Для Каждого Запись Из НаборПоВладельцу Цикл
				Запись.Основной = Ложь;
			КонецЦикла;
			
			НаборПоВладельцу.ОбменДанными.Загрузка = Истина;
			НаборПоВладельцу.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли