// См. описание одноименной процедуры в общем модуле РегламентныеЗаданияПереопределяемый.
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	// Продажи / РезервированиеТоваров
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.АвтоматическоеСнятиеРезервов;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьЗаказы;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.НапоминаниеПроСнятиеРезервов;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьЗаказы;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// ТехнологическаяПлатформа / БазоваяФункциональность (Администрирование) 
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.УдалениеПомеченныхОбъектов;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// ТехнологическаяПлатформа / ПроведениеДокументов
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностей;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ДопроведениеПоПартиям;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// ТехнологическаяПлатформа / ПоискЗаменаЗначений
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ВыполнениеОтложенныхЗаменЗначений;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// ТехнологическаяПлатформа / сфпСофтФонПроф
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.сфпОбновлениеТелефонныхКниг;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.сфпИспользоватьСофтФон;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// СтандартныеПодсистемы / Валюты
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ЗагрузкаКурсовВалют;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// СтандартныеПодсистемы / ВерсионированиеОбъектов
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ВыгрузкаВерсийОбъектов;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьВерсионированиеОбъектов;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОчисткаУстаревшихВерсийОбъектов;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьВерсионированиеОбъектов;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// СтандартныеПодсистемы / ОбновлениеВерсииИБ
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОтложенноеОбновлениеИБ;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;

	// СтандартныеПодсистемы / УправлениеИтогамиИАгрегатами
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбновлениеАгрегатов;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
		
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПерестроениеАгрегатов;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
		
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.УстановкаПериодаРассчитанныхИтогов;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// СтандартныеПодсистемы / ОтправкаSMS
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОтправкаSMS;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьПочтовыйКлиент;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// ПолучениеИОтправкаЭлектронныхПисем
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПолучениеИОтправкаЭлектронныхПисем;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьПочтовыйКлиент;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// ЭкспортОценкиПроизводительности
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ЭкспортОценкиПроизводительности;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// +Альфа
	
	// Снабжение / Прайс-Листы
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.АвтозагрузкаПрайсЛистовКонтрагентов;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.АвтообновлениеПрайсЛистовКонтрагентов;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// Маркетинг / БонусныеПрограммы
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.АктивацияБонусныхБаллов;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОповещениеОБонусныхБаллах;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// Снабжение / Прайс-Листы
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.АвтозагрузкаПрайсЛистовКонтрагентов;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.АвтообновлениеПрайсЛистовКонтрагентов;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// Маркетинг / БонусныеПрограммы
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.АктивацияБонусныхБаллов;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОповещениеОБонусныхБаллах;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПоискИУдалениеНеиспользуемыхАвтомобилей;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ДоступенАвтосалон;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// -Альфа
	
КонецПроцедуры

