
#Область ПрограммныйИнтерфейс

// См. СПАРКРискиКлиентСерверПереопределяемый.ПриОпределенииСвойствКонтрагентаВОбъекте
Процедура ПриОпределенииСвойствКонтрагентаВОбъекте(КонтрагентОбъект, Форма, СвойстваКонтрагента) Экспорт
	
	СвойстваКонтрагента.ИНН = КонтрагентОбъект.ИНН;
	СвойстваКонтрагента.ПодлежитПроверке = (КонтрагентОбъект.ФормаСобственности =
		ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЮридическоеЛицо"));
	СвойстваКонтрагента.СвояОрганизация = ТипЗнч(КонтрагентОбъект.Ссылка) <> Тип("СправочникСсылка.Контрагенты"); 
	
КонецПроцедуры

#Область ИндексыСПАРККонтрагента

// См. СПАРКРискиКлиентСерверПереопределяемый.ОтобразитьИндексыСПАРК
Процедура ОтобразитьИндексыСПАРК(
			РезультатИндексыКонтрагента,
			КонтрагентОбъект,
			Контрагент,
			Форма,
			ИспользованиеРазрешено,
			Параметры,
			СтандартнаяОбработка) Экспорт

	Если
		Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента"
		Или Форма.ИмяФормы = "Справочник.Организации.Форма.ФормаЭлемента"
	Тогда
        
        СтандартнаяОбработка = Ложь;
        Элементы = Форма.Элементы;
        
        Если Не ИспользованиеРазрешено Тогда
        	
            Элементы.ПоказатьЗначенияИндексовКонтрагента.Видимость = Ложь;
            Возврат;
            
        КонецЕсли;
        
        Элементы.ПоказатьЗначенияИндексовКонтрагента.Видимость = РезультатИндексыКонтрагента.ПодлежитПроверке;
        
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти