#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подготовить таблицу документа для подбора
//
// Параметры:
//  ТаблицаДокумента - ТаблицаЗначений - Табличная часть товаров документа.
//  Адрес            - Строка - Адрес во временном хранилище с результатом выполнения.
//
Процедура ПодготовитьТаблицуДокументаДляПодбора(ТаблицаДокумента, Адрес) Экспорт
	
	ДанныеДокумента = ТаблицаДокумента.Выгрузить();
	ДанныеДокумента.Очистить();
	
	ДанныеДокумента.Колонки.Добавить(
		"СтрокаВДокументе",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3)));
	
	Для Каждого Строка Из ТаблицаДокумента Цикл
		НоваяСтрока = ДанныеДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		НоваяСтрока.СтрокаВДокументе = Строка.ПолучитьИдентификатор();
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ДанныеДокумента, Адрес);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли