#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено ИЛИ ПараметрКоманды.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МассивЧастей 		= СтрРазделить(ПараметрыВыполненияКоманды.Источник.ИмяФормы, ".");
	ПолноеИмяОбъекта 	= СтрШаблон("%1.%2", МассивЧастей[0], МассивЧастей[1]);
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	ОтчетОтбор.Вставить("Автомобиль", ПараметрКоманды);
	ОтчетОтбор.Вставить("ЭтоЗаказНаряд", ПолноеИмяОбъекта = "Документ.ЗаказНаряд");
	
	ЭкспериментальноеФормированиеОтчета = ПолучитьКонстанту();
	Если ЭкспериментальноеФормированиеОтчета Тогда
		ИмяФормы = "Отчет.ИсторияАвтомобилей.Форма.НастройкиОборотыЭксперимент";
	Иначе
		ИмяФормы = "Отчет.ИсторияАвтомобилей.Форма.НастройкиОбороты";
	КонецЕсли;
	ОткрытьФорму(ИмяФормы, ОтчетОтбор, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьКонстанту()

	Возврат Константы.ФормироватьОтчетИсторияАвтомобилейВНовомФормате.Получить();

КонецФункции

#КонецОбласти