
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ХранитьФайлыВТомахНаДискеПриИзмененииЗавершение(Ответ, Элемент) Экспорт
	Перем Результат;
	
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		НаборКонстант.ХранитьФайлыВТомахНаДиске = НЕ НаборКонстант.ХранитьФайлыВТомахНаДиске;
	Иначе
		УстановитьЗначениеКонстанты(
			НаборКонстант.ХранитьФайлыВТомахНаДиске,
			"ХранитьФайлыВТомахНаДиске",
			Результат);
			
		ОбновитьПовторноИспользуемыеЗначения();
		Оповестить("Запись_НаборКонстант", Новый Структура, "ХранитьФайлыВТомахНаДиске");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапросыНаИспользованиеВнешнихРесурсовТомовХраненияФайлов(Включение)
	
	ЗапросыНаИспользование = Новый Массив;
	
	Если Включение Тогда
		Справочники.ТомаХраненияФайлов.ДобавитьЗапросыНаИспользованиеВнешнихРесурсовВсехТомов(
			ЗапросыНаИспользование);
	Иначе
		Справочники.ТомаХраненияФайлов.ДобавитьЗапросыНаОтменуИспользованияВнешнихРесурсовВсехТомов(
			ЗапросыНаИспользование);
	КонецЕсли;
	
	Возврат ЗапросыНаИспользование;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьЗначениеКонстанты(КонстантаЗначение, КонстантаИмя, Результат)
	
	Результат = Новый Структура;
	
	КонстантаМенеджер = Константы[КонстантаИмя];
	Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
		КонстантаМенеджер.Установить(КонстантаЗначение);
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ХранитьФайлыВТомахНаДискеПриИзменении(Элемент)
	
	СтароеЗначение = НЕ НаборКонстант.ХранитьФайлыВТомахНаДиске;
	
	Попытка
		ЗапросыНаИспользованиеВнешнихРесурсов =
			ЗапросыНаИспользованиеВнешнихРесурсовТомовХраненияФайлов(НаборКонстант.ХранитьФайлыВТомахНаДиске);
		
		РаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(
			ЗапросыНаИспользованиеВнешнихРесурсов,
			ЭтотОбъект,
			Новый ОписаниеОповещения("ХранитьФайлыВТомахНаДискеПриИзмененииЗавершение", ЭтотОбъект, Элемент));
	Исключение
		НаборКонстант.ХранитьФайлыВТомахНаДиске = СтароеЗначение;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// СтандартныеПодсистемы.ФайловыеФункции
&НаКлиенте
Процедура СправочникТомаХраненияФайлов(Команда)
	
	ОткрытьФорму("Справочник.ТомаХраненияФайлов.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокПрайсЛистов(Команда)
	
	ОткрытьФорму("Справочник.ПрайсЛистыКонтрагентов.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВременноеХранилище(Команда)
	
	ОткрытьФорму("РегистрСведений.ПрайсЛистыКонтрагентовВременный.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурнал(Команда)
	
	ОткрытьФорму("РегистрСведений.ПрайсЛистыКонтрагентовЖурналЗагрузки.ФормаСписка",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти