///////////////////////////////////////////////////////////////////////////////
// Модуль формы записи регистра "Прайс-листы контрагентов автообновление"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = Отказ Или РаботаСФормой.НужноОтменитьОткрытиеФормы();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		НастроитьПараметрыВыбораЭлементовФормы();
		УправлениеДиалогомНаСервере();
	КонецЕсли;
	
	НастроитьСписокВыбораПериодичностиПроверкиНовыхДанных();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	НастроитьПараметрыВыбораЭлементовФормы();
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСлужебногоПрограммногоИнтерфейса

&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	УправлениеДиалогомРегистраСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	УправлениеДиалогомРегистраСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура НастроитьСписокВыбораПериодичностиПроверкиНовыхДанных();
	
	СписокВыбора = Элементы.ПериодичностьПроверкиНовыхДанных.СписокВыбора;
	СписокВыбора.Очистить();
	
	ДоступныеЗначения = Справочники.ПрайсЛистыКонтрагентов.ПериодичностиПроверкиНовыхДанных();
	Для Каждого Строка Из ДоступныеЗначения Цикл
		НоваяСтрока = СписокВыбора.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

