// Модуль менеджера справочника "Сервисные компании"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// 	 Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	УникальныеРеквизитыАвтоработы = Новый Массив;
	УникальныеРеквизитыАвтоработы.Добавить("Авторабота");
	УникальныеРеквизитыАвтоработы.Добавить("Количество");
	
	УникальныеРеквизиты.Вставить("Код");
	УникальныеРеквизиты.Вставить("Автоработы",УникальныеРеквизитыАвтоработы);
	
	УникальныеРеквизитыДиапазоны = Новый Массив;
	УникальныеРеквизитыДиапазоны.Добавить("НачальноеЗначение");
	УникальныеРеквизитыДиапазоны.Добавить("КонечноеЗначение");
	УникальныеРеквизиты.Вставить("ДиапазоныVIN",УникальныеРеквизитыДиапазоны);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события возникающего при изменении данных реквизита "Модель".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура МодельПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.Модель <> Объект.ВариантКомплектации.Владелец Тогда
		Объект.ВариантКомплектации = Справочники.ВариантыКомплектации.ПустаяСсылка();
	КонецЕсли; 
	
КонецПроцедуры // МодельПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Вариант комплектации".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВариантКомплектацииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Объект.ВариантКомплектации) Тогда
		Если Объект.Модель <> Объект.ВариантКомплектации.Владелец Тогда
			Объект.Модель = Объект.ВариантКомплектации.Владелец;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // МодельПриИзменении()

#КонецОбласти

#Область ОбработчикиЗаполненияОбъекта

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
	ОтображатьЗаполнитьИзФайла = ПраваИНастройкиПользователя.Значение("ОтображатьЗаполнитьИзФайла");
	
	ЗаполнениеОбъектовАльфаАвто.ДобавитьКомандуОчиститкиТабличнойЧасти(КомандыЗаполнения, "Автоработы");
	КомандыЗаполнения[0].ВидимостьВФормах = "ФормаЭлемента";
	
	Если ОтображатьЗаполнитьИзФайла Тогда
		ЗаполнениеОбъектовАльфаАвто.ДобавитьКомандуЗаполненияТабличнойЧастиИзФайла(КомандыЗаполнения, "Автоработы");
		КомандыЗаполнения[1].ВидимостьВФормах = "ФормаЭлемента";
	КонецЕсли;
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

#КонецОбласти

#КонецОбласти

#КонецЕсли