#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("ПрайсЛист", ПараметрКоманды));
	
	ОткрытьФорму(
		"РегистрСведений.ПрайсЛистыКонтрагентовВременный.ФормаСписка",
		ПараметрыОткрытия,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор,
		ПараметрыВыполненияКоманды.Источник.Окно,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти