
#Область ПрограммныйИнтерфейс

// см. ПраваИНастройкиПользователя.ОбновитьВКэше
//
Процедура ОбновитьВКэше(Знач Право, НовоеЗначение, ОбъектРасширения = Неопределено) Экспорт
	
	ПраваИНастройкиПользователя.ОбновитьВКэше(Право, НовоеЗначение, ОбъектРасширения);
	
КонецПроцедуры

// см. ПраваИНастройкиПользователя.Значение
//
Функция Значение(Знач Право, ОбъектРасширения = Неопределено) Экспорт
	
	Возврат ПраваИНастройкиПользователя.Значение(Право, ОбъектРасширения);
	
КонецФункции

// см. ПраваИНастройкиПользователя.ЕстьРоль
//
Функция ЕстьРоль(ИмяРоли) Экспорт
	
	Возврат ПраваИНастройкиПользователя.ЕстьРоль(ИмяРоли);
	
КонецФункции

#КонецОбласти
