
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция проверяет входит ли документ в список "неоднозначных" партионных документов.
//
// Параметры:
//  МетаданныеДок - ОбъектМетаданных - Объект описания метаданных документа.
//
// Возвращаемое значение:
//  Булево - Признак проведения документа.
//
Функция ДокументНеВсегдаПроводитьсяПоПартиям(МетаданныеДок) Экспорт
	
	Исключения = Новый Массив;
	
	Исключения.Добавить(Метаданные.Документы.Переоценка);
	Исключения.Добавить(Метаданные.Документы.Инвентаризация);
	Исключения.Добавить(Метаданные.Документы.ПоступлениеДопРасходов);
	
	Если Исключения.Найти(МетаданныеДок) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ДокументНеВсегдаПроводитьсяПоПартиям()

// Функция возвращает массив партионных регистров
// состав этих регистров может отличаться в различных конфигурациях.
//
// Возвращаемое значение:
//  Массив - Массив партионных регистров.
//
Функция ПолучитьПартионныеРегистры() Экспорт
	
	МассивПартионныхРегистров=Новый Массив;
	МассивПартионныхРегистров.Добавить("ПартииТоваровКомпании");
	МассивПартионныхРегистров.Добавить("ПартииТоваровОтданные");
	МассивПартионныхРегистров.Добавить("ДоходыИРасходы");
	МассивПартионныхРегистров.Добавить("Продажи");
	МассивПартионныхРегистров.Добавить("РеализованныеТовары");
	МассивПартионныхРегистров.Добавить("ТоварыВПроизводстве");
	МассивПартионныхРегистров.Добавить("КомплектацияАвтомобилей");
	
	Возврат МассивПартионныхРегистров;
	
КонецФункции // ПолучитьПартионныеРегистры()

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);

	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов.
//  Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли

