
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Экран = ПолучитьЗначениеПараметраСтруктуры(Параметры, "НачальноеЗначение", "");
	
	Если Параметры.Свойство("ОтображатьКод") Тогда
		ОтображатьКод = Параметры.ОтображатьКод;
	КонецЕсли;
	
	Если Параметры.Свойство("ДоступностьОтображенияКода") Тогда
		Элементы.ОтображатьКод.Доступность = Параметры.ДоступностьОтображенияКода;
	КонецЕсли;
	
	УправлениеЭлементамиФормыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтображатьКод(Команда)
	
	ОтображатьКод = НЕ ОтображатьКод;
	УправлениеЭлементамиФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятора01(Команда)
	
	ДобавитьСимволВКонецСтроки(Экран, "1");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятора02(Команда)
	
	ДобавитьСимволВКонецСтроки(Экран, "2");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятора03(Команда)
	
	ДобавитьСимволВКонецСтроки(Экран, "3");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятора04(Команда)
	
	ДобавитьСимволВКонецСтроки(Экран, "4");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятора05(Команда)
	
	ДобавитьСимволВКонецСтроки(Экран, "5");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятора06(Команда)
	
	ДобавитьСимволВКонецСтроки(Экран, "6");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятора07(Команда)
	
	ДобавитьСимволВКонецСтроки(Экран, "7");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятора08(Команда)
	
	ДобавитьСимволВКонецСтроки(Экран, "8");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятора09(Команда)
	
	ДобавитьСимволВКонецСтроки(Экран, "9");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятора00(Команда)
	
	ДобавитьСимволВКонецСтроки(Экран, "0");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятораОчистить(Команда)
	
	ОчиститьСтроку(Экран);
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятораУдалитьПоследнийСимвол(Команда)
	
	УдалитьСимволВКонцеСтроки(Экран);
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаКалькулятораЗакрытьИВернутьРезультат(Команда)
	
	Закрыть(Экран);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Настройка элементов формы
//
&НаСервере
Процедура УправлениеЭлементамиФормыНаСервере()
	
	Элементы.Экран.Видимость       = ОтображатьКод;
	Элементы.ЭкранПароля.Видимость = НЕ ОтображатьКод;
	Элементы.ОтображатьКод.Пометка = НЕ ОтображатьКод;
	ОбновитьПолеПароля();
	
КонецПроцедуры

// Процедура обновляет поле пароля
//
&НаСервере
Процедура ОбновитьПолеПароля()
	
	Если НЕ Элементы.ЭкранПароля.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	ЭкранПароля = "";
	КоличествоЗвездочек = СтрДлина(Экран);
	Для Сч = 1 По КоличествоЗвездочек Цикл
		ЭкранПароля = ЭкранПароля + "*";
	КонецЦикла;
	
КонецПроцедуры

// Добавление символа в конец строки
&НаКлиенте
Процедура ДобавитьСимволВКонецСтроки(Строка, Символ)
	
	Строка = Строка + Символ;
	ОбновитьПолеПароля();
	
КонецПроцедуры

// Удаление последнего символа строки
&НаКлиенте
Процедура УдалитьСимволВКонцеСтроки(Строка)
	
	Строка = Сред(Строка, 1, СтрДлина(Строка)-1);
	ОбновитьПолеПароля();
	
КонецПроцедуры

// Очистка строки
&НаКлиенте
Процедура ОчиститьСтроку(Строка)
	
	Строка = "";
	ОбновитьПолеПароля();
	
КонецПроцедуры

#КонецОбласти
