// Модуль набора записей регистра "Повреждения автомобилей"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.Период) Тогда
			Запись.Период = ТекущаяДатаСеанса();
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.Автор) Тогда
			Если ЗначениеЗаполнено(Пользователи.ТекущийПользователь()) Тогда
				Запись.Автор = Пользователи.ТекущийПользователь();
			Иначе
				Запись.Автор = ПользователиКлиентСервер.ТекущийВнешнийПользователь();
			КонецЕсли;
		КонецЕсли;
		
		Запись.ДатаИзменения = ТекущаяДатаСеанса();
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли