#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипыНоменклатуры = Параметры.СоответствиеТиповНоменклатуры; 
		
	Для Каждого Строка Из ТипыНоменклатуры Цикл
			
		СоответствиеТипов = ЭтотОбъект.ТипНаименование.Добавить();
		СоответствиеТипов.ТипНоменклатуры = Строка.ТипНоменклатуры;
		СоответствиеТипов.Наименование = Строка.НаименованиеВидаНоменклатуры;
			
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗакрытияФормы = Новый Структура();
	ПараметрыЗакрытияФормы.Вставить("АдресТаблицыВоВременномХранилище", СформироватьТаблицу());
	ПараметрыЗакрытияФормы.Вставить("ИмяТаблицыДляЗаполнения", "СоответствиеТиповНоменклатуры");
	
	ОповеститьОВыборе(ПараметрыЗакрытияФормы);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция СформироватьТаблицу()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ТипНоменклатуры");
	Таблица.Колонки.Добавить("НаименованиеВидаНоменклатуры"); 
	
	Для Каждого Строка из ЭтотОбъект.ТипНаименование Цикл 
		СтрокаТип = Таблица.Добавить();
		СтрокаТип.ТипНоменклатуры = Строка.ТипНоменклатуры; 
		СтрокаТип.НаименованиеВидаНоменклатуры = СокрЛП(Строка.Наименование);
	КонецЦикла;	

	Возврат ПоместитьВоВременноеХранилище(Таблица, УникальныйИдентификатор);

КонецФункции  
#КонецОбласти 