// Модуль менеджера регистра сведений "Рекомендации по автомобилю"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПроверкаЗапланированныхРекомендацийАвтомобиля(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА РекомендацииПоАвтомобилю.Выполнена = ИСТИНА
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Завершено)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА (РекомендацииПоАвтомобилю.ЗаявкаНаРемонт <> ЗНАЧЕНИЕ(Документ.ЗаявкаНаРемонт.ПустаяСсылка)
	               |						ИЛИ РекомендацииПоАвтомобилю.ЗаказНаряд <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка))
	               |						И РекомендацииПоАвтомобилю.Выполнена = ЛОЖЬ
	               |					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Выполняется)
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА РекомендацииПоАвтомобилю.ПричинаОтказа <> ЗНАЧЕНИЕ(Справочник.ПричиныОтказаОтОбслуживания.ПустаяСсылка)
	               |							ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Отменено)
	               |						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Запланировано)
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Состояние
	               |ИЗ
	               |	РегистрСведений.РекомендацииПоАвтомобилю КАК РекомендацииПоАвтомобилю
	               |ГДЕ
	               |	РекомендацииПоАвтомобилю.Автомобиль = &Автомобиль";
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	ТаблицаРекомендаций = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРекомендаций.Найти(Перечисления.СостоянияСобытий.Запланировано, "Состояние") <> Неопределено;
	
КонецФункции // ПроверкаЗапланированныхРекомендацийАвтомобиля()

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	ОбязательныеРеквизиты.Добавить("Количество");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#КонецОбласти

#КонецОбласти

#КонецЕсли