// Модуль набора записей регистра "Границы производство"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ЗаказНаряд Экспорт;      // Документ.ЗаказНаряд ИЛИ Массив. Содержит заказ-наряды по которым сдвигается граница последовательности
Перем МоментВремени Экспорт;   // Дата-время документа
Перем ДокументСсылка Экспорт;  // Ссылка на документ
Перем ЗаказНарядБыл Экспорт; 	// Документ.ЗаказНаряд ИЛИ Массив. Содержит заказ-наряды до изменения
Перем МоментВремениБыл Экспорт;   // Дата-время документа до изменения

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли