
#Область ПрограммныйИнтерфейс

// см. ЗаполнениеОбъектовАльфаАвто.ИзменитьОписаниеКоманды
Процедура ИзменитьОписаниеКоманды(ИмяКомандыВФорме, АдресНастроек, ПараметрыЗаполнения, Обработчик) Экспорт
	
	ЗаполнениеОбъектовАльфаАвто.ИзменитьОписаниеКоманды(ИмяКомандыВФорме, АдресНастроек, ПараметрыЗаполнения, Обработчик);
	
КонецПроцедуры

// Процедура заполнения складскими остатками.
//
// Параметры:
//  Объект				 - ДанныеФормыСтруктура	 - Заполняемый документ
//  ПараметрыЗаполнения	 - Структура			 - Структура параметров, необходимых для заполнения складскими остатками.
//													При необходимости хранит дополнительные фильтры.   
//
Процедура ЗагрузкаИзФайла(Объект, ПараметрыЗаполнения) Экспорт
	
	ЗаполнениеОбъектовАльфаАвто.ЗагрузкаИзФайла(Объект, ПараметрыЗаполнения);
	
КонецПроцедуры

#КонецОбласти
