////////////////////////////////////////////////////////////////////////////////
// Процедуры повторного использования по работе с производителями:
//  - Поиск производителей в базе
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет поиск производителя по наименованию или синониму.
// Поиск выполняется по точному соответствию.
//
// Параметры:
//  Наименование - Строка - Наименование производителя.
//
// Возвращаемое значение:
//  СправочникСсылка.Производители - Ссылка на производителя.
//
Функция НайтиПроизводителяПоНаименованию(Наименование) Экспорт
	
	Возврат Справочники.Производители.НайтиПроизводителяПоНаименованию(Наименование);
	
КонецФункции // НайтиПроизводителяПоНаименованию()

#КонецОбласти