
#Область ПрограммныйИнтерфейс

// См. РаботаСКонтрагентамиКлиентСерверПереопределяемый.ПриОпределенииОбъектаИСсылкиПоФорме
Процедура ПриОпределенииОбъектаИСсылкиПоФорме(Форма, Результат) Экспорт
	
	Результат.Ссылка = Форма.Объект.Ссылка;
	Результат.Объект = Форма.Объект;
	
КонецПроцедуры

// См. РаботаСКонтрагентамиКлиентСерверПереопределяемый.ОтобразитьРезультатПроверкиКонтрагентаВСправочнике
Процедура ОтобразитьРезультатПроверкиКонтрагентаВСправочнике(Форма, ПредставлениеРезультатаПроверки) Экспорт
	
	Форма.РезультатПроверкиКонтрагента = ПредставлениеРезультатаПроверки;	
	
КонецПроцедуры

#КонецОбласти