
#Область СлужебныйПрограммныйИнтерфейс

// Открывает настройку отражения в учете.
//
// Параметры:
//  ПараметрыФормы - см. НовыеПараметрыФормыНастройкиОтраженияВУчете
//  ПараметрыОткрытияФормы - см. ОбщегоНазначенияБЭДКлиент.ОткрытьФормуБЭД.ПараметрыОткрытияФормы
//
Процедура ОткрытьНастройкуОтраженияВУчете(ПараметрыФормы, ПараметрыОткрытияФормы = Неопределено) Экспорт
	
	Если ПараметрыОткрытияФормы = Неопределено Тогда
		ПараметрыОткрытияФормы = ОбщегоНазначенияБЭДКлиент.НовыеПараметрыОткрытияФормы();
	КонецЕсли;
	Если ТипЗнч(ПараметрыОткрытияФормы) = Тип("Структура") Тогда
		ПараметрыОткрытияФормы.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	ОбщегоНазначенияБЭДКлиент.ОткрытьФормуБЭД(
		"РегистрСведений.НастройкиПолученияЭлектронныхДокументов.Форма.НастройкиОтраженияДокументовВУчете",
		ПараметрыФормы, ПараметрыОткрытияФормы, Истина);
	
КонецПроцедуры

// Возвращает параметры формы настройки отражения в учете.
// 
// Возвращаемое значение:
// 	Структура:
// * Организация - ОпределяемыйТип.Организация
// * Контрагент - ОпределяемыйТип.КонтрагентБЭД
// * ИдентификаторОрганизации - Строка
// * ИдентификаторКонтрагента - Строка
// * СоздатьНовыйПоИдентификаторам - Булево
// * Создание - Булево
Функция НовыеПараметрыФормыНастройкиОтраженияВУчете() Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Организация");
	ПараметрыОткрытия.Вставить("Контрагент");
	ПараметрыОткрытия.Вставить("ИдентификаторКонтрагента", "");
	ПараметрыОткрытия.Вставить("ИдентификаторОрганизации", "");
	ПараметрыОткрытия.Вставить("СоздатьНовыйПоИдентификаторам", Неопределено);
	ПараметрыОткрытия.Вставить("Создание", Ложь);
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

// Открывает форму списка настроек отражения в учете.
// 
// Параметры:
// 	Контрагент - ОпределяемыйТип.КонтрагентБЭД
Процедура ОткрытьНастройкиОтраженияВУчете(Контрагент) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	
	ОткрытьФорму("РегистрСведений.НастройкиПолученияЭлектронныхДокументов.Форма.НастройкиОтраженияВходящихДокументов",
		ПараметрыФормы,, Контрагент,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти