// Модуль менеджера регистра "Штрихкоды"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

// Функция определяет наличие штрихкода у переданного документа
//
// Параметры:
//  Документ - ДокументСсылка - документ, для которого определяется проверка
//
// Возвращаемое значение:
//  Булево - Истина, если есть штрихкод, Ложь - в противном случае.
//
Функция ЕстьШтрихкодУДокумента(Документ) Экспорт
	
	Если Метаданные.РегистрыСведений.ШтрихКоды.Измерения.Объект.Тип.СодержитТип(ТипЗнч(Документ)) Тогда
		// получим штрих код документа
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ШтрихКоды.ШтрихКод
		|ИЗ
		|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	ШтрихКоды.Объект = &Объект
		|	И ШтрихКоды.Запрет = ЛОЖЬ");
		Запрос.УстановитьПараметр("Объект", Документ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли