// Модуль набора записей регистра "Штрихкоды"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;

	#Если Клиент Тогда
	// SUIG - обновляем не конкретные строки, а все сразу
	// При обновлении конкретной строки система падает,
	// причем не всегда, а через раз. Поэтому приходится дважды (для нового и старого наборов) оповещать
	// все видимые строки.
	Оповестить("ЗаписаныШтрихкоды");
#КонецЕсли

КонецПроцедуры 

#КонецОбласти

#КонецЕсли