///////////////////////////////////////////////////////////////////////////////
// Модуль формы РедактированиеСпискаКомпьютеров обработки "Поддержка"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = НСтр("ru = 'Список компьютеров (текущий:" + Символы.НПП + ИмяКомпьютера() + ")'");
	
	Компьютеры = Параметры.СписокКомпьютеров.Скопировать();
	Компьютеры.ТипЗначения = Новый ОписаниеТипов("Строка");
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик события нажатия кнопки "Применить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Применить(Команда)
	
	Закрыть(Компьютеры);
	
КонецПроцедуры // Применить()

#КонецОбласти

