#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Номенклатура", ПараметрКоманды));
	ПараметрыФормы.Вставить("СкрыватьНоменклатуру");   
	ПараметрыФормы.Вставить("ЗакрепитьСПрава");
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	Массив = Новый Массив;
	Массив.Добавить("Номенклатура");
	ПараметрыФормы.Вставить("ЗаблокированныеПоля", Массив);

	ОткрытьФорму("РегистрСведений.СвязаннаяНоменклатура.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти