
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор = ОтборыДляОтчета(ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КлючВарианта", "Остатки");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму(
		"Отчет.ВзаиморасчетыСКонтрагентом.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор,
		ПараметрыВыполненияКоманды.Окно
	);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОтборыДляОтчета(ЗаказНаАвтомобиль)
	
	РеквизитыЗаказа = Новый Структура("Контрагент,Сделка", "Контрагент", "Ссылка");
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаказНаАвтомобиль, РеквизитыЗаказа);
	Результат.Вставить("КонецПериода", КонецДня(ТекущаяДатаСеанса()));
	Возврат Результат;
	
КонецФункции

#КонецОбласти
