///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	 ПараметрыФормы = Новый Структура("Предмет", ПараметрКоманды);
	// АльфаАвто
	Если
		ПараметрыВыполненияКоманды.Параметры <> Неопределено
		И ПараметрыВыполненияКоманды.Параметры.Свойство("Предмет")
		И ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Параметры.Предмет)
	Тогда
		
		ПараметрыФормы = Новый Структура("Предмет", ПараметрыВыполненияКоманды.Параметры.Предмет);
		
	КонецЕсли;
	
	ОткрытьФорму(
		"Справочник.Заметки.Форма.ЗаметкиПоПредмету",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	// Конец АльфаАвто
КонецПроцедуры

#КонецОбласти
