
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Выражение") Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Самостоятельное использование формы не предусмотрено'");
	КонецЕсли;
	
	ПолеТекстовогоДокумента.УстановитьТекст(Параметры.Выражение);
	
	ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.УстановитьНадписьТекстВыражения(Параметры, НадписьТекстВыражения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "ОК"
//
&НаКлиенте
Процедура ОК(Команда)
	
	ОповеститьОВыборе(ПолеТекстовогоДокумента.ПолучитьТекст());
	
КонецПроцедуры

// Процедура - обработчик команды "Отмена"
//
&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

