
#Область СлужебныйПрограммныйИнтерфейс

Функция ПользователюДоступноИзменениеПодразделения() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить(
		"ЗапрещенаПерезаписьПодразделения", 
		ПраваИНастройкиПользователя.Значение("ПерезаписьПодразделения")
	);
	Результат.Вставить("ТекущееПодразделение", ПараметрыСеанса.ПодразделениеКомпании);
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьЗаголовокНадписиНалоговыйДокумент(Форма, Объект) Экспорт
	
	Форма.НалоговыйДокумент = ЗащищенныеФункцииСервер.УстановитьЗаголовокНадписиНалоговыйДокумент(Форма, Объект);
	
КонецПроцедуры

#КонецОбласти