
#Область СлужебныеПроцедурыИФункции

Функция ОбновитьНаСервереММ(Объект, СхемаКомпановкиДанных, ВидВыбора) Экспорт
	
	ДеревоРезультат = Новый ДеревоЗначений;
	
	Если ВидВыбора = "ВозвратАвтомобилейОтПокупателяКомиссия" Тогда
		СхемаКомпановкиДанных = Обработки.ПодборАвтомобилейДляВозвратов.ПолучитьМакет("ВозвратАвтомобилейОтПокупателяКомиссия");
	ИначеЕсли ВидВыбора = "ОтчетКомитенту" Тогда
		СхемаКомпановкиДанных = Обработки.ПодборАвтомобилейДляВозвратов.ПолучитьМакет("ОтчетКомитенту");
	Иначе
		СхемаКомпановкиДанных = Обработки.ПодборАвтомобилейДляВозвратов.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанныхОбщая");
	КонецЕсли;
	
	Объект.НастройкиОтбораКомпоновщикаДанных.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(Объект.ДатаНачала));
	Объект.НастройкиОтбораКомпоновщикаДанных.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКонца", ?(Объект.ДатаКонца='00010101',КонецДня(ТекущаяДатаСеанса()),КонецДня(Объект.ДатаКонца)));
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпановкиДанных, Объект.НастройкиОтбораКомпоновщикаДанных.Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДеревоРезультат);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	ПроцессорВывода.ЗакончитьВывод();
	
	Возврат ДеревоРезультат;
	
КонецФункции

#КонецОбласти