///////////////////////////////////////////////////////////////////////////////
// Модуль формы записи регистра "Состояния кодов маркировки".
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = Отказ Или РаботаСФормой.НужноОтменитьОткрытиеФормы();
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		НастроитьПараметрыВыбораЭлементовФормы();
		УправлениеДиалогомНаСервере();
		
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	НастроитьПараметрыВыбораЭлементовФормы();
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСлужебногоПрограммногоИнтерфейса

&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	УправлениеДиалогомРегистраСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	ИспользованиеХарактеристик   = Запись.Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик;
	Если ИспользованиеХарактеристик = 1 Тогда
		ВладелецХарактеристикаНоменклатуры = Запись.Номенклатура.ТипНоменклатуры;
	ИначеЕсли ИспользованиеХарактеристик = 2 Тогда
		ВладелецХарактеристикаНоменклатуры = Запись.Номенклатура;
	Иначе
		ВладелецХарактеристикаНоменклатуры = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	УправлениеДиалогомРегистраСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Элементы.ХарактеристикаНоменклатуры.Доступность = Запись.Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик <> 3;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

